const area = [{
    "name": "北京市",
    "level": "1",
    "id": 1,
    "childs": [{
      "name": "北京市",
      "level": "2",
      "id": 10,
      "childs": [{
          "name": "东城区",
          "level": "3",
          "id": 29
        },
        {
          "name": "西城区",
          "level": "3",
          "id": 1731
        },
        {
          "name": "朝阳区",
          "level": "3",
          "id": 3708
        },
        {
          "name": "丰台区",
          "level": "3",
          "id": 8460
        },
        {
          "name": "石景山区",
          "level": "3",
          "id": 11085
        },
        {
          "name": "海淀区",
          "level": "3",
          "id": 12180
        },
        {
          "name": "门头沟区",
          "level": "3",
          "id": 19345
        },
        {
          "name": "房山区",
          "level": "3",
          "id": 20331
        },
        {
          "name": "通州区",
          "level": "3",
          "id": 36453
        },
        {
          "name": "顺义区",
          "level": "3",
          "id": 42745
        },
        {
          "name": "昌平区",
          "level": "3",
          "id": 52366
        },
        {
          "name": "大兴区",
          "level": "3",
          "id": 54786
        },
        {
          "name": "怀柔区",
          "level": "3",
          "id": 56798
        },
        {
          "name": "平谷区",
          "level": "3",
          "id": 57454
        },
        {
          "name": "密云区",
          "level": "3",
          "id": 62742
        },
        {
          "name": "延庆区",
          "level": "3",
          "id": 64532
        }
      ]
    }]
  },
  {
    "name": "天津市",
    "level": "1",
    "id": 2,
    "childs": [{
      "name": "天津市",
      "level": "2",
      "id": 17,
      "childs": [{
          "name": "和平区",
          "level": "3",
          "id": 36
        },
        {
          "name": "河东区",
          "level": "3",
          "id": 646
        },
        {
          "name": "河西区",
          "level": "3",
          "id": 2146
        },
        {
          "name": "南开区",
          "level": "3",
          "id": 3397
        },
        {
          "name": "河北区",
          "level": "3",
          "id": 4874
        },
        {
          "name": "红桥区",
          "level": "3",
          "id": 6159
        },
        {
          "name": "东丽区",
          "level": "3",
          "id": 7519
        },
        {
          "name": "西青区",
          "level": "3",
          "id": 9352
        },
        {
          "name": "津南区",
          "level": "3",
          "id": 11008
        },
        {
          "name": "北辰区",
          "level": "3",
          "id": 12696
        },
        {
          "name": "武清区",
          "level": "3",
          "id": 13901
        },
        {
          "name": "宝坻区",
          "level": "3",
          "id": 20976
        },
        {
          "name": "滨海新区",
          "level": "3",
          "id": 23822
        },
        {
          "name": "宁河区",
          "level": "3",
          "id": 32658
        },
        {
          "name": "静海区",
          "level": "3",
          "id": 34118
        },
        {
          "name": "蓟州区",
          "level": "3",
          "id": 35898
        }
      ]
    }]
  },
  {
    "name": "河北省",
    "level": "1",
    "id": 3,
    "childs": [{
        "name": "石家庄市",
        "level": "2",
        "id": 20,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 30
          },
          {
            "name": "长安区",
            "level": "3",
            "id": 35
          },
          {
            "name": "桥西区",
            "level": "3",
            "id": 1596
          },
          {
            "name": "新华区",
            "level": "3",
            "id": 2939
          },
          {
            "name": "井陉矿区",
            "level": "3",
            "id": 4152
          },
          {
            "name": "裕华区",
            "level": "3",
            "id": 4740
          },
          {
            "name": "藁城区",
            "level": "3",
            "id": 5818
          },
          {
            "name": "鹿泉区",
            "level": "3",
            "id": 7430
          },
          {
            "name": "栾城区",
            "level": "3",
            "id": 9033
          },
          {
            "name": "井陉县",
            "level": "3",
            "id": 9970
          },
          {
            "name": "正定县",
            "level": "3",
            "id": 12273
          },
          {
            "name": "行唐县",
            "level": "3",
            "id": 17762
          },
          {
            "name": "灵寿县",
            "level": "3",
            "id": 18917
          },
          {
            "name": "高邑县",
            "level": "3",
            "id": 20144
          },
          {
            "name": "深泽县",
            "level": "3",
            "id": 26622
          },
          {
            "name": "赞皇县",
            "level": "3",
            "id": 27172
          },
          {
            "name": "无极县",
            "level": "3",
            "id": 28578
          },
          {
            "name": "平山县",
            "level": "3",
            "id": 29529
          },
          {
            "name": "元氏县",
            "level": "3",
            "id": 38496
          },
          {
            "name": "赵县",
            "level": "3",
            "id": 39191
          },
          {
            "name": "晋州市",
            "level": "3",
            "id": 39877
          },
          {
            "name": "新乐市",
            "level": "3",
            "id": 40263
          }
        ]
      },
      {
        "name": "唐山市",
        "level": "2",
        "id": 40446,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 40447
          },
          {
            "name": "路南区",
            "level": "3",
            "id": 40448
          },
          {
            "name": "路北区",
            "level": "3",
            "id": 40615
          },
          {
            "name": "古冶区",
            "level": "3",
            "id": 40860
          },
          {
            "name": "开平区",
            "level": "3",
            "id": 41072
          },
          {
            "name": "丰南区",
            "level": "3",
            "id": 45580
          },
          {
            "name": "丰润区",
            "level": "3",
            "id": 46224
          },
          {
            "name": "曹妃甸区",
            "level": "3",
            "id": 47663
          },
          {
            "name": "滦县",
            "level": "3",
            "id": 52095
          },
          {
            "name": "滦南县",
            "level": "3",
            "id": 59170
          },
          {
            "name": "乐亭县",
            "level": "3",
            "id": 60177
          },
          {
            "name": "迁西县",
            "level": "3",
            "id": 61312
          },
          {
            "name": "玉田县",
            "level": "3",
            "id": 77163
          },
          {
            "name": "遵化市",
            "level": "3",
            "id": 81771
          },
          {
            "name": "迁安市",
            "level": "3",
            "id": 85063
          }
        ]
      },
      {
        "name": "秦皇岛市",
        "level": "2",
        "id": 87953,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 87954
          },
          {
            "name": "海港区",
            "level": "3",
            "id": 87956
          },
          {
            "name": "山海关区",
            "level": "3",
            "id": 95734
          },
          {
            "name": "北戴河区",
            "level": "3",
            "id": 98132
          },
          {
            "name": "抚宁区",
            "level": "3",
            "id": 98301
          },
          {
            "name": "青龙满族自治县",
            "level": "3",
            "id": 98729
          },
          {
            "name": "昌黎县",
            "level": "3",
            "id": 104318
          },
          {
            "name": "卢龙县",
            "level": "3",
            "id": 104916
          }
        ]
      },
      {
        "name": "邯郸市",
        "level": "2",
        "id": 105643,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 105644
          },
          {
            "name": "邯山区",
            "level": "3",
            "id": 105645
          },
          {
            "name": "丛台区",
            "level": "3",
            "id": 111322
          },
          {
            "name": "复兴区",
            "level": "3",
            "id": 111640
          },
          {
            "name": "峰峰矿区",
            "level": "3",
            "id": 112832
          },
          {
            "name": "邯郸县",
            "level": "3",
            "id": 114554
          },
          {
            "name": "临漳县",
            "level": "3",
            "id": 116949
          },
          {
            "name": "成安县",
            "level": "3",
            "id": 117916
          },
          {
            "name": "大名县",
            "level": "3",
            "id": 118906
          },
          {
            "name": "涉县",
            "level": "3",
            "id": 120390
          },
          {
            "name": "磁县",
            "level": "3",
            "id": 122846
          },
          {
            "name": "肥乡县",
            "level": "3",
            "id": 123869
          },
          {
            "name": "永年县",
            "level": "3",
            "id": 124290
          },
          {
            "name": "邱县",
            "level": "3",
            "id": 125261
          },
          {
            "name": "鸡泽县",
            "level": "3",
            "id": 125767
          },
          {
            "name": "广平县",
            "level": "3",
            "id": 137828
          },
          {
            "name": "馆陶县",
            "level": "3",
            "id": 138142
          },
          {
            "name": "魏县",
            "level": "3",
            "id": 138738
          },
          {
            "name": "曲周县",
            "level": "3",
            "id": 140104
          },
          {
            "name": "武安市",
            "level": "3",
            "id": 140991
          }
        ]
      },
      {
        "name": "邢台市",
        "level": "2",
        "id": 145307,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 145318
          },
          {
            "name": "桥东区",
            "level": "3",
            "id": 145319
          },
          {
            "name": "桥西区",
            "level": "3",
            "id": 151132
          },
          {
            "name": "邢台县",
            "level": "3",
            "id": 151260
          },
          {
            "name": "临城县",
            "level": "3",
            "id": 151929
          },
          {
            "name": "内丘县",
            "level": "3",
            "id": 152256
          },
          {
            "name": "柏乡县",
            "level": "3",
            "id": 152720
          },
          {
            "name": "隆尧县",
            "level": "3",
            "id": 152918
          },
          {
            "name": "任县",
            "level": "3",
            "id": 153236
          },
          {
            "name": "南和县",
            "level": "3",
            "id": 153440
          },
          {
            "name": "宁晋县",
            "level": "3",
            "id": 153723
          },
          {
            "name": "巨鹿县",
            "level": "3",
            "id": 154594
          },
          {
            "name": "新河县",
            "level": "3",
            "id": 159965
          },
          {
            "name": "广宗县",
            "level": "3",
            "id": 160244
          },
          {
            "name": "平乡县",
            "level": "3",
            "id": 160466
          },
          {
            "name": "威县",
            "level": "3",
            "id": 160728
          },
          {
            "name": "清河县",
            "level": "3",
            "id": 163864
          },
          {
            "name": "临西县",
            "level": "3",
            "id": 164290
          },
          {
            "name": "南宫市",
            "level": "3",
            "id": 164785
          },
          {
            "name": "沙河市",
            "level": "3",
            "id": 172320
          }
        ]
      },
      {
        "name": "保定市",
        "level": "2",
        "id": 175799,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 175803
          },
          {
            "name": "竞秀区",
            "level": "3",
            "id": 175805
          },
          {
            "name": "莲池区",
            "level": "3",
            "id": 176016
          },
          {
            "name": "满城区",
            "level": "3",
            "id": 176267
          },
          {
            "name": "清苑区",
            "level": "3",
            "id": 181196
          },
          {
            "name": "徐水区",
            "level": "3",
            "id": 183003
          },
          {
            "name": "涞水县",
            "level": "3",
            "id": 184412
          },
          {
            "name": "阜平县",
            "level": "3",
            "id": 188375
          },
          {
            "name": "定兴县",
            "level": "3",
            "id": 189169
          },
          {
            "name": "唐县",
            "level": "3",
            "id": 192263
          },
          {
            "name": "高阳县",
            "level": "3",
            "id": 197949
          },
          {
            "name": "容城县",
            "level": "3",
            "id": 204365
          },
          {
            "name": "涞源县",
            "level": "3",
            "id": 204813
          },
          {
            "name": "望都县",
            "level": "3",
            "id": 205502
          },
          {
            "name": "安新县",
            "level": "3",
            "id": 205879
          },
          {
            "name": "易县",
            "level": "3",
            "id": 206358
          },
          {
            "name": "曲阳县",
            "level": "3",
            "id": 207002
          },
          {
            "name": "蠡县",
            "level": "3",
            "id": 207621
          },
          {
            "name": "顺平县",
            "level": "3",
            "id": 212299
          },
          {
            "name": "博野县",
            "level": "3",
            "id": 220552
          },
          {
            "name": "雄县",
            "level": "3",
            "id": 225893
          },
          {
            "name": "涿州市",
            "level": "3",
            "id": 226790
          },
          {
            "name": "安国市",
            "level": "3",
            "id": 228640
          },
          {
            "name": "高碑店市",
            "level": "3",
            "id": 233655
          }
        ]
      },
      {
        "name": "张家口市",
        "level": "2",
        "id": 236806,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 236847
          },
          {
            "name": "桥东区",
            "level": "3",
            "id": 236849
          },
          {
            "name": "桥西区",
            "level": "3",
            "id": 237202
          },
          {
            "name": "宣化区",
            "level": "3",
            "id": 237576
          },
          {
            "name": "下花园区",
            "level": "3",
            "id": 239022
          },
          {
            "name": "万全区",
            "level": "3",
            "id": 239318
          },
          {
            "name": "崇礼区",
            "level": "3",
            "id": 243524
          },
          {
            "name": "张北县",
            "level": "3",
            "id": 246583
          },
          {
            "name": "康保县",
            "level": "3",
            "id": 247207
          },
          {
            "name": "沽源县",
            "level": "3",
            "id": 247708
          },
          {
            "name": "尚义县",
            "level": "3",
            "id": 253938
          },
          {
            "name": "蔚县",
            "level": "3",
            "id": 262821
          },
          {
            "name": "阳原县",
            "level": "3",
            "id": 263871
          },
          {
            "name": "怀安县",
            "level": "3",
            "id": 268714
          },
          {
            "name": "怀来县",
            "level": "3",
            "id": 269235
          },
          {
            "name": "涿鹿县",
            "level": "3",
            "id": 273974
          },
          {
            "name": "赤城县",
            "level": "3",
            "id": 274893
          }
        ]
      },
      {
        "name": "承德市",
        "level": "2",
        "id": 286924,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 286987
          },
          {
            "name": "双桥区",
            "level": "3",
            "id": 286988
          },
          {
            "name": "双滦区",
            "level": "3",
            "id": 287309
          },
          {
            "name": "鹰手营子矿区",
            "level": "3",
            "id": 287581
          },
          {
            "name": "承德县",
            "level": "3",
            "id": 287753
          },
          {
            "name": "兴隆县",
            "level": "3",
            "id": 298426
          },
          {
            "name": "平泉县",
            "level": "3",
            "id": 299477
          },
          {
            "name": "滦平县",
            "level": "3",
            "id": 300788
          },
          {
            "name": "隆化县",
            "level": "3",
            "id": 302166
          },
          {
            "name": "丰宁满族自治县",
            "level": "3",
            "id": 308802
          },
          {
            "name": "宽城满族自治县",
            "level": "3",
            "id": 309684
          },
          {
            "name": "围场满族蒙古族自治县",
            "level": "3",
            "id": 314529
          }
        ]
      },
      {
        "name": "沧州市",
        "level": "2",
        "id": 330686,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 330728
          },
          {
            "name": "新华区",
            "level": "3",
            "id": 330732
          },
          {
            "name": "运河区",
            "level": "3",
            "id": 341439
          },
          {
            "name": "沧县",
            "level": "3",
            "id": 341783
          },
          {
            "name": "青县",
            "level": "3",
            "id": 343568
          },
          {
            "name": "东光县",
            "level": "3",
            "id": 344960
          },
          {
            "name": "海兴县",
            "level": "3",
            "id": 353545
          },
          {
            "name": "盐山县",
            "level": "3",
            "id": 355182
          },
          {
            "name": "肃宁县",
            "level": "3",
            "id": 362274
          },
          {
            "name": "南皮县",
            "level": "3",
            "id": 365183
          },
          {
            "name": "吴桥县",
            "level": "3",
            "id": 365634
          },
          {
            "name": "献县",
            "level": "3",
            "id": 371977
          },
          {
            "name": "孟村回族自治县",
            "level": "3",
            "id": 374223
          },
          {
            "name": "泊头市",
            "level": "3",
            "id": 374771
          },
          {
            "name": "任丘市",
            "level": "3",
            "id": 376650
          },
          {
            "name": "黄骅市",
            "level": "3",
            "id": 378722
          },
          {
            "name": "河间市",
            "level": "3",
            "id": 380619
          }
        ]
      },
      {
        "name": "廊坊市",
        "level": "2",
        "id": 384421,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 384468
          },
          {
            "name": "安次区",
            "level": "3",
            "id": 384470
          },
          {
            "name": "广阳区",
            "level": "3",
            "id": 385562
          },
          {
            "name": "固安县",
            "level": "3",
            "id": 386375
          },
          {
            "name": "永清县",
            "level": "3",
            "id": 391916
          },
          {
            "name": "香河县",
            "level": "3",
            "id": 393127
          },
          {
            "name": "大城县",
            "level": "3",
            "id": 409085
          },
          {
            "name": "文安县",
            "level": "3",
            "id": 410000
          },
          {
            "name": "大厂回族自治县",
            "level": "3",
            "id": 411125
          },
          {
            "name": "霸州市",
            "level": "3",
            "id": 415131
          },
          {
            "name": "三河市",
            "level": "3",
            "id": 415609
          }
        ]
      },
      {
        "name": "衡水市",
        "level": "2",
        "id": 416690,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 416703
          },
          {
            "name": "桃城区",
            "level": "3",
            "id": 416704
          },
          {
            "name": "冀州区",
            "level": "3",
            "id": 417044
          },
          {
            "name": "枣强县",
            "level": "3",
            "id": 417492
          },
          {
            "name": "武邑县",
            "level": "3",
            "id": 418351
          },
          {
            "name": "武强县",
            "level": "3",
            "id": 419334
          },
          {
            "name": "饶阳县",
            "level": "3",
            "id": 419902
          },
          {
            "name": "安平县",
            "level": "3",
            "id": 427693
          },
          {
            "name": "故城县",
            "level": "3",
            "id": 432295
          },
          {
            "name": "景县",
            "level": "3",
            "id": 433712
          },
          {
            "name": "阜城县",
            "level": "3",
            "id": 435766
          },
          {
            "name": "深州市",
            "level": "3",
            "id": 437010
          }
        ]
      },
      {
        "name": "省直辖县级行政区划",
        "level": "2",
        "id": 437874,
        "childs": [{
            "name": "定州市",
            "level": "3",
            "id": 437898
          },
          {
            "name": "辛集市",
            "level": "3",
            "id": 438780
          }
        ]
      }
    ]
  },
  {
    "name": "山西省",
    "level": "1",
    "id": 4,
    "childs": [{
        "name": "太原市",
        "level": "2",
        "id": 22,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 37
          },
          {
            "name": "小店区",
            "level": "3",
            "id": 39
          },
          {
            "name": "迎泽区",
            "level": "3",
            "id": 1533
          },
          {
            "name": "杏花岭区",
            "level": "3",
            "id": 2430
          },
          {
            "name": "尖草坪区",
            "level": "3",
            "id": 3713
          },
          {
            "name": "万柏林区",
            "level": "3",
            "id": 5158
          },
          {
            "name": "晋源区",
            "level": "3",
            "id": 6554
          },
          {
            "name": "清徐县",
            "level": "3",
            "id": 7482
          },
          {
            "name": "阳曲县",
            "level": "3",
            "id": 8944
          },
          {
            "name": "娄烦县",
            "level": "3",
            "id": 10048
          },
          {
            "name": "古交市",
            "level": "3",
            "id": 11086
          }
        ]
      },
      {
        "name": "大同市",
        "level": "2",
        "id": 12545,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 12684
          },
          {
            "name": "城区",
            "level": "3",
            "id": 12690
          },
          {
            "name": "矿区",
            "level": "3",
            "id": 13512
          },
          {
            "name": "南郊区",
            "level": "3",
            "id": 14392
          },
          {
            "name": "新荣区",
            "level": "3",
            "id": 15404
          },
          {
            "name": "阳高县",
            "level": "3",
            "id": 16103
          },
          {
            "name": "天镇县",
            "level": "3",
            "id": 21092
          },
          {
            "name": "广灵县",
            "level": "3",
            "id": 21914
          },
          {
            "name": "灵丘县",
            "level": "3",
            "id": 22802
          },
          {
            "name": "浑源县",
            "level": "3",
            "id": 31320
          },
          {
            "name": "左云县",
            "level": "3",
            "id": 32000
          },
          {
            "name": "大同县",
            "level": "3",
            "id": 32484
          }
        ]
      },
      {
        "name": "阳泉市",
        "level": "2",
        "id": 41124,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 41136
          },
          {
            "name": "城区",
            "level": "3",
            "id": 41137
          },
          {
            "name": "矿区",
            "level": "3",
            "id": 41409
          },
          {
            "name": "郊区",
            "level": "3",
            "id": 41608
          },
          {
            "name": "平定县",
            "level": "3",
            "id": 41955
          },
          {
            "name": "盂县",
            "level": "3",
            "id": 46961
          }
        ]
      },
      {
        "name": "长治市",
        "level": "2",
        "id": 51796,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 51831
          },
          {
            "name": "城区",
            "level": "3",
            "id": 51832
          },
          {
            "name": "郊区",
            "level": "3",
            "id": 52256
          },
          {
            "name": "长治县",
            "level": "3",
            "id": 53151
          },
          {
            "name": "襄垣县",
            "level": "3",
            "id": 54551
          },
          {
            "name": "屯留县",
            "level": "3",
            "id": 56028
          },
          {
            "name": "平顺县",
            "level": "3",
            "id": 61126
          },
          {
            "name": "黎城县",
            "level": "3",
            "id": 61778
          },
          {
            "name": "壶关县",
            "level": "3",
            "id": 62176
          },
          {
            "name": "长子县",
            "level": "3",
            "id": 62918
          },
          {
            "name": "武乡县",
            "level": "3",
            "id": 69824
          },
          {
            "name": "沁县",
            "level": "3",
            "id": 74388
          },
          {
            "name": "沁源县",
            "level": "3",
            "id": 75409
          },
          {
            "name": "潞城市",
            "level": "3",
            "id": 76056
          }
        ]
      },
      {
        "name": "晋城市",
        "level": "2",
        "id": 77794,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 77868
          },
          {
            "name": "城区",
            "level": "3",
            "id": 77870
          },
          {
            "name": "沁水县",
            "level": "3",
            "id": 78788
          },
          {
            "name": "阳城县",
            "level": "3",
            "id": 80741
          },
          {
            "name": "陵川县",
            "level": "3",
            "id": 83108
          },
          {
            "name": "泽州县",
            "level": "3",
            "id": 84811
          },
          {
            "name": "高平市",
            "level": "3",
            "id": 87838
          }
        ]
      },
      {
        "name": "朔州市",
        "level": "2",
        "id": 88457,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 88458
          },
          {
            "name": "朔城区",
            "level": "3",
            "id": 88459
          },
          {
            "name": "平鲁区",
            "level": "3",
            "id": 89259
          },
          {
            "name": "山阴县",
            "level": "3",
            "id": 96721
          },
          {
            "name": "应县",
            "level": "3",
            "id": 101321
          },
          {
            "name": "右玉县",
            "level": "3",
            "id": 105572
          },
          {
            "name": "怀仁县",
            "level": "3",
            "id": 109162
          }
        ]
      },
      {
        "name": "晋中市",
        "level": "2",
        "id": 113976,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 114022
          },
          {
            "name": "榆次区",
            "level": "3",
            "id": 114026
          },
          {
            "name": "榆社县",
            "level": "3",
            "id": 124926
          },
          {
            "name": "左权县",
            "level": "3",
            "id": 125598
          },
          {
            "name": "和顺县",
            "level": "3",
            "id": 126264
          },
          {
            "name": "昔阳县",
            "level": "3",
            "id": 127220
          },
          {
            "name": "寿阳县",
            "level": "3",
            "id": 128234
          },
          {
            "name": "太谷县",
            "level": "3",
            "id": 129035
          },
          {
            "name": "祁县",
            "level": "3",
            "id": 129479
          },
          {
            "name": "平遥县",
            "level": "3",
            "id": 129974
          },
          {
            "name": "灵石县",
            "level": "3",
            "id": 135036
          },
          {
            "name": "介休市",
            "level": "3",
            "id": 135989
          }
        ]
      },
      {
        "name": "运城市",
        "level": "2",
        "id": 138085,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 138115
          },
          {
            "name": "盐湖区",
            "level": "3",
            "id": 138116
          },
          {
            "name": "临猗县",
            "level": "3",
            "id": 139272
          },
          {
            "name": "万荣县",
            "level": "3",
            "id": 148908
          },
          {
            "name": "闻喜县",
            "level": "3",
            "id": 149893
          },
          {
            "name": "稷山县",
            "level": "3",
            "id": 150660
          },
          {
            "name": "新绛县",
            "level": "3",
            "id": 151073
          },
          {
            "name": "绛县",
            "level": "3",
            "id": 156157
          },
          {
            "name": "垣曲县",
            "level": "3",
            "id": 156508
          },
          {
            "name": "夏县",
            "level": "3",
            "id": 157019
          },
          {
            "name": "平陆县",
            "level": "3",
            "id": 157715
          },
          {
            "name": "芮城县",
            "level": "3",
            "id": 158191
          },
          {
            "name": "永济市",
            "level": "3",
            "id": 158652
          },
          {
            "name": "河津市",
            "level": "3",
            "id": 166407
          }
        ]
      },
      {
        "name": "忻州市",
        "level": "2",
        "id": 167083,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 167112
          },
          {
            "name": "忻府区",
            "level": "3",
            "id": 167114
          },
          {
            "name": "定襄县",
            "level": "3",
            "id": 172832
          },
          {
            "name": "五台县",
            "level": "3",
            "id": 172998
          },
          {
            "name": "代县",
            "level": "3",
            "id": 173805
          },
          {
            "name": "繁峙县",
            "level": "3",
            "id": 174288
          },
          {
            "name": "宁武县",
            "level": "3",
            "id": 174714
          },
          {
            "name": "静乐县",
            "level": "3",
            "id": 178713
          },
          {
            "name": "神池县",
            "level": "3",
            "id": 179149
          },
          {
            "name": "五寨县",
            "level": "3",
            "id": 181509
          },
          {
            "name": "岢岚县",
            "level": "3",
            "id": 182867
          },
          {
            "name": "河曲县",
            "level": "3",
            "id": 183928
          },
          {
            "name": "保德县",
            "level": "3",
            "id": 188197
          },
          {
            "name": "偏关县",
            "level": "3",
            "id": 188962
          },
          {
            "name": "原平市",
            "level": "3",
            "id": 189768
          }
        ]
      },
      {
        "name": "临汾市",
        "level": "2",
        "id": 193025,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 193057
          },
          {
            "name": "尧都区",
            "level": "3",
            "id": 193060
          },
          {
            "name": "曲沃县",
            "level": "3",
            "id": 198772
          },
          {
            "name": "翼城县",
            "level": "3",
            "id": 208445
          },
          {
            "name": "襄汾县",
            "level": "3",
            "id": 208717
          },
          {
            "name": "洪洞县",
            "level": "3",
            "id": 209308
          },
          {
            "name": "古县",
            "level": "3",
            "id": 210198
          },
          {
            "name": "安泽县",
            "level": "3",
            "id": 210538
          },
          {
            "name": "浮山县",
            "level": "3",
            "id": 210887
          },
          {
            "name": "吉县",
            "level": "3",
            "id": 211264
          },
          {
            "name": "乡宁县",
            "level": "3",
            "id": 211444
          },
          {
            "name": "大宁县",
            "level": "3",
            "id": 211752
          },
          {
            "name": "隰县",
            "level": "3",
            "id": 211843
          },
          {
            "name": "永和县",
            "level": "3",
            "id": 211971
          },
          {
            "name": "蒲县",
            "level": "3",
            "id": 212264
          },
          {
            "name": "汾西县",
            "level": "3",
            "id": 212689
          },
          {
            "name": "侯马市",
            "level": "3",
            "id": 220763
          },
          {
            "name": "霍州市",
            "level": "3",
            "id": 221121
          }
        ]
      },
      {
        "name": "吕梁市",
        "level": "2",
        "id": 227328,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 227394
          },
          {
            "name": "离石区",
            "level": "3",
            "id": 227397
          },
          {
            "name": "文水县",
            "level": "3",
            "id": 233265
          },
          {
            "name": "交城县",
            "level": "3",
            "id": 235667
          },
          {
            "name": "兴县",
            "level": "3",
            "id": 236334
          },
          {
            "name": "临县",
            "level": "3",
            "id": 237533
          },
          {
            "name": "柳林县",
            "level": "3",
            "id": 239169
          },
          {
            "name": "石楼县",
            "level": "3",
            "id": 246125
          },
          {
            "name": "岚县",
            "level": "3",
            "id": 251672
          },
          {
            "name": "方山县",
            "level": "3",
            "id": 252332
          },
          {
            "name": "中阳县",
            "level": "3",
            "id": 252807
          },
          {
            "name": "交口县",
            "level": "3",
            "id": 253298
          },
          {
            "name": "孝义市",
            "level": "3",
            "id": 254635
          },
          {
            "name": "汾阳市",
            "level": "3",
            "id": 263818
          }
        ]
      }
    ]
  },
  {
    "name": "内蒙古自治区",
    "level": "1",
    "id": 5,
    "childs": [{
        "name": "呼和浩特市",
        "level": "2",
        "id": 24,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 33
          },
          {
            "name": "新城区",
            "level": "3",
            "id": 38
          },
          {
            "name": "回民区",
            "level": "3",
            "id": 841
          },
          {
            "name": "玉泉区",
            "level": "3",
            "id": 1524
          },
          {
            "name": "赛罕区",
            "level": "3",
            "id": 2567
          },
          {
            "name": "土默特左旗",
            "level": "3",
            "id": 4018
          },
          {
            "name": "托克托县",
            "level": "3",
            "id": 5903
          },
          {
            "name": "和林格尔县",
            "level": "3",
            "id": 6718
          },
          {
            "name": "清水河县",
            "level": "3",
            "id": 7890
          },
          {
            "name": "武川县",
            "level": "3",
            "id": 8773
          }
        ]
      },
      {
        "name": "包头市",
        "level": "2",
        "id": 9678,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 9721
          },
          {
            "name": "东河区",
            "level": "3",
            "id": 9724
          },
          {
            "name": "昆都仑区",
            "level": "3",
            "id": 11033
          },
          {
            "name": "青山区",
            "level": "3",
            "id": 12291
          },
          {
            "name": "石拐区",
            "level": "3",
            "id": 13005
          },
          {
            "name": "白云鄂博矿区",
            "level": "3",
            "id": 18005
          },
          {
            "name": "九原区",
            "level": "3",
            "id": 18100
          },
          {
            "name": "土默特右旗",
            "level": "3",
            "id": 18529
          },
          {
            "name": "固阳县",
            "level": "3",
            "id": 19407
          },
          {
            "name": "达尔罕茂明安联合旗",
            "level": "3",
            "id": 19856
          }
        ]
      },
      {
        "name": "乌海市",
        "level": "2",
        "id": 26485,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 26530
          },
          {
            "name": "海勃湾区",
            "level": "3",
            "id": 26533
          },
          {
            "name": "海南区",
            "level": "3",
            "id": 27050
          },
          {
            "name": "乌达区",
            "level": "3",
            "id": 27496
          }
        ]
      },
      {
        "name": "赤峰市",
        "level": "2",
        "id": 28093,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 28153
          },
          {
            "name": "红山区",
            "level": "3",
            "id": 28155
          },
          {
            "name": "元宝山区",
            "level": "3",
            "id": 29215
          },
          {
            "name": "松山区",
            "level": "3",
            "id": 29962
          },
          {
            "name": "阿鲁科尔沁旗",
            "level": "3",
            "id": 38373
          },
          {
            "name": "巴林左旗",
            "level": "3",
            "id": 39223
          },
          {
            "name": "巴林右旗",
            "level": "3",
            "id": 39947
          },
          {
            "name": "林西县",
            "level": "3",
            "id": 44572
          },
          {
            "name": "克什克腾旗",
            "level": "3",
            "id": 48903
          },
          {
            "name": "翁牛特旗",
            "level": "3",
            "id": 49726
          },
          {
            "name": "喀喇沁旗",
            "level": "3",
            "id": 50785
          },
          {
            "name": "宁城县",
            "level": "3",
            "id": 51390
          },
          {
            "name": "敖汉旗",
            "level": "3",
            "id": 51744
          }
        ]
      },
      {
        "name": "通辽市",
        "level": "2",
        "id": 53103,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 53140
          },
          {
            "name": "科尔沁区",
            "level": "3",
            "id": 53141
          },
          {
            "name": "科尔沁左翼中旗",
            "level": "3",
            "id": 55568
          },
          {
            "name": "科尔沁左翼后旗",
            "level": "3",
            "id": 56922
          },
          {
            "name": "开鲁县",
            "level": "3",
            "id": 62299
          },
          {
            "name": "库伦旗",
            "level": "3",
            "id": 72954
          },
          {
            "name": "奈曼旗",
            "level": "3",
            "id": 73473
          },
          {
            "name": "扎鲁特旗",
            "level": "3",
            "id": 74220
          },
          {
            "name": "霍林郭勒市",
            "level": "3",
            "id": 75425
          }
        ]
      },
      {
        "name": "鄂尔多斯市",
        "level": "2",
        "id": 75703,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 75741
          },
          {
            "name": "东胜区",
            "level": "3",
            "id": 75743
          },
          {
            "name": "康巴什区",
            "level": "3",
            "id": 78835
          },
          {
            "name": "达拉特旗",
            "level": "3",
            "id": 80191
          },
          {
            "name": "准格尔旗",
            "level": "3",
            "id": 86538
          },
          {
            "name": "鄂托克前旗",
            "level": "3",
            "id": 86821
          },
          {
            "name": "鄂托克旗",
            "level": "3",
            "id": 90222
          },
          {
            "name": "杭锦旗",
            "level": "3",
            "id": 90603
          },
          {
            "name": "乌审旗",
            "level": "3",
            "id": 91204
          },
          {
            "name": "伊金霍洛旗",
            "level": "3",
            "id": 91671
          }
        ]
      },
      {
        "name": "呼伦贝尔市",
        "level": "2",
        "id": 92579,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 92637
          },
          {
            "name": "海拉尔区",
            "level": "3",
            "id": 92638
          },
          {
            "name": "扎赉诺尔区",
            "level": "3",
            "id": 93335
          },
          {
            "name": "阿荣旗",
            "level": "3",
            "id": 93695
          },
          {
            "name": "莫力达瓦达斡尔族自治旗",
            "level": "3",
            "id": 94461
          },
          {
            "name": "鄂伦春自治旗",
            "level": "3",
            "id": 95274
          },
          {
            "name": "鄂温克族自治旗",
            "level": "3",
            "id": 103754
          },
          {
            "name": "陈巴尔虎旗",
            "level": "3",
            "id": 103975
          },
          {
            "name": "新巴尔虎左旗",
            "level": "3",
            "id": 104211
          },
          {
            "name": "新巴尔虎右旗",
            "level": "3",
            "id": 104415
          },
          {
            "name": "满洲里市",
            "level": "3",
            "id": 104704
          },
          {
            "name": "牙克石市",
            "level": "3",
            "id": 104921
          },
          {
            "name": "扎兰屯市",
            "level": "3",
            "id": 111088
          },
          {
            "name": "额尔古纳市",
            "level": "3",
            "id": 116780
          },
          {
            "name": "根河市",
            "level": "3",
            "id": 123463
          }
        ]
      },
      {
        "name": "巴彦淖尔市",
        "level": "2",
        "id": 123799,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 123823
          },
          {
            "name": "临河区",
            "level": "3",
            "id": 123825
          },
          {
            "name": "五原县",
            "level": "3",
            "id": 124534
          },
          {
            "name": "磴口县",
            "level": "3",
            "id": 125139
          },
          {
            "name": "乌拉特前旗",
            "level": "3",
            "id": 125972
          },
          {
            "name": "乌拉特中旗",
            "level": "3",
            "id": 126982
          },
          {
            "name": "乌拉特后旗",
            "level": "3",
            "id": 127780
          },
          {
            "name": "杭锦后旗",
            "level": "3",
            "id": 128063
          }
        ]
      },
      {
        "name": "乌兰察布市",
        "level": "2",
        "id": 128483,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 128494
          },
          {
            "name": "集宁区",
            "level": "3",
            "id": 128496
          },
          {
            "name": "卓资县",
            "level": "3",
            "id": 128893
          },
          {
            "name": "化德县",
            "level": "3",
            "id": 130925
          },
          {
            "name": "商都县",
            "level": "3",
            "id": 131297
          },
          {
            "name": "兴和县",
            "level": "3",
            "id": 136924
          },
          {
            "name": "凉城县",
            "level": "3",
            "id": 137250
          },
          {
            "name": "察哈尔右翼前旗",
            "level": "3",
            "id": 137638
          },
          {
            "name": "察哈尔右翼中旗",
            "level": "3",
            "id": 148764
          },
          {
            "name": "察哈尔右翼后旗",
            "level": "3",
            "id": 149597
          },
          {
            "name": "四子王旗",
            "level": "3",
            "id": 150055
          },
          {
            "name": "丰镇市",
            "level": "3",
            "id": 150656
          }
        ]
      },
      {
        "name": "兴安盟",
        "level": "2",
        "id": 151104,
        "childs": [{
            "name": "乌兰浩特市",
            "level": "3",
            "id": 151119
          },
          {
            "name": "阿尔山市",
            "level": "3",
            "id": 156393
          },
          {
            "name": "科尔沁右翼前旗",
            "level": "3",
            "id": 156547
          },
          {
            "name": "科尔沁右翼中旗",
            "level": "3",
            "id": 157571
          },
          {
            "name": "扎赉特旗",
            "level": "3",
            "id": 165537
          },
          {
            "name": "突泉县",
            "level": "3",
            "id": 166371
          }
        ]
      },
      {
        "name": "锡林郭勒盟",
        "level": "2",
        "id": 172396,
        "childs": [{
            "name": "二连浩特市",
            "level": "3",
            "id": 172397
          },
          {
            "name": "锡林浩特市",
            "level": "3",
            "id": 172415
          },
          {
            "name": "阿巴嘎旗",
            "level": "3",
            "id": 176365
          },
          {
            "name": "苏尼特左旗",
            "level": "3",
            "id": 180859
          },
          {
            "name": "苏尼特右旗",
            "level": "3",
            "id": 191948
          },
          {
            "name": "东乌珠穆沁旗",
            "level": "3",
            "id": 193158
          },
          {
            "name": "西乌珠穆沁旗",
            "level": "3",
            "id": 194102
          },
          {
            "name": "太仆寺旗",
            "level": "3",
            "id": 194955
          },
          {
            "name": "镶黄旗",
            "level": "3",
            "id": 195757
          },
          {
            "name": "正镶白旗",
            "level": "3",
            "id": 196044
          },
          {
            "name": "正蓝旗",
            "level": "3",
            "id": 196416
          },
          {
            "name": "多伦县",
            "level": "3",
            "id": 196724
          }
        ]
      },
      {
        "name": "阿拉善盟",
        "level": "2",
        "id": 199360,
        "childs": [{
            "name": "阿拉善左旗",
            "level": "3",
            "id": 199372
          },
          {
            "name": "阿拉善右旗",
            "level": "3",
            "id": 200039
          },
          {
            "name": "额济纳旗",
            "level": "3",
            "id": 200253
          }
        ]
      }
    ]
  },
  {
    "name": "辽宁省",
    "level": "1",
    "id": 6,
    "childs": [{
        "name": "沈阳市",
        "level": "2",
        "id": 25,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 41
          },
          {
            "name": "和平区",
            "level": "3",
            "id": 42
          },
          {
            "name": "沈河区",
            "level": "3",
            "id": 1223
          },
          {
            "name": "大东区",
            "level": "3",
            "id": 2295
          },
          {
            "name": "皇姑区",
            "level": "3",
            "id": 3448
          },
          {
            "name": "铁西区",
            "level": "3",
            "id": 4685
          },
          {
            "name": "苏家屯区",
            "level": "3",
            "id": 6492
          },
          {
            "name": "浑南区",
            "level": "3",
            "id": 8105
          },
          {
            "name": "沈北新区",
            "level": "3",
            "id": 9730
          },
          {
            "name": "于洪区",
            "level": "3",
            "id": 17221
          },
          {
            "name": "辽中区",
            "level": "3",
            "id": 17469
          },
          {
            "name": "康平县",
            "level": "3",
            "id": 18253
          },
          {
            "name": "法库县",
            "level": "3",
            "id": 19273
          },
          {
            "name": "新民市",
            "level": "3",
            "id": 26413
          }
        ]
      },
      {
        "name": "大连市",
        "level": "2",
        "id": 28943,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 30814
          },
          {
            "name": "中山区",
            "level": "3",
            "id": 30816
          },
          {
            "name": "西岗区",
            "level": "3",
            "id": 31124
          },
          {
            "name": "沙河口区",
            "level": "3",
            "id": 31370
          },
          {
            "name": "甘井子区",
            "level": "3",
            "id": 33390
          },
          {
            "name": "旅顺口区",
            "level": "3",
            "id": 34653
          },
          {
            "name": "金州区",
            "level": "3",
            "id": 35599
          },
          {
            "name": "普兰店区",
            "level": "3",
            "id": 42100
          },
          {
            "name": "长海县",
            "level": "3",
            "id": 42944
          },
          {
            "name": "瓦房店市",
            "level": "3",
            "id": 47765
          },
          {
            "name": "庄河市",
            "level": "3",
            "id": 53459
          }
        ]
      },
      {
        "name": "鞍山市",
        "level": "2",
        "id": 55671,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 55737
          },
          {
            "name": "铁东区",
            "level": "3",
            "id": 55738
          },
          {
            "name": "铁西区",
            "level": "3",
            "id": 67511
          },
          {
            "name": "立山区",
            "level": "3",
            "id": 68040
          },
          {
            "name": "千山区",
            "level": "3",
            "id": 68489
          },
          {
            "name": "台安县",
            "level": "3",
            "id": 68633
          },
          {
            "name": "岫岩满族自治县",
            "level": "3",
            "id": 69135
          },
          {
            "name": "海城市",
            "level": "3",
            "id": 70287
          }
        ]
      },
      {
        "name": "抚顺市",
        "level": "2",
        "id": 78136,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 78198
          },
          {
            "name": "新抚区",
            "level": "3",
            "id": 78200
          },
          {
            "name": "东洲区",
            "level": "3",
            "id": 79881
          },
          {
            "name": "望花区",
            "level": "3",
            "id": 81031
          },
          {
            "name": "顺城区",
            "level": "3",
            "id": 82437
          },
          {
            "name": "抚顺县",
            "level": "3",
            "id": 83383
          },
          {
            "name": "新宾满族自治县",
            "level": "3",
            "id": 84264
          },
          {
            "name": "清原满族自治县",
            "level": "3",
            "id": 87075
          }
        ]
      },
      {
        "name": "本溪市",
        "level": "2",
        "id": 91979,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 92025
          },
          {
            "name": "平山区",
            "level": "3",
            "id": 92026
          },
          {
            "name": "溪湖区",
            "level": "3",
            "id": 92641
          },
          {
            "name": "明山区",
            "level": "3",
            "id": 93544
          },
          {
            "name": "南芬区",
            "level": "3",
            "id": 97209
          },
          {
            "name": "本溪满族自治县",
            "level": "3",
            "id": 97294
          },
          {
            "name": "桓仁满族自治县",
            "level": "3",
            "id": 97518
          }
        ]
      },
      {
        "name": "丹东市",
        "level": "2",
        "id": 97695,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 97710
          },
          {
            "name": "元宝区",
            "level": "3",
            "id": 97712
          },
          {
            "name": "振兴区",
            "level": "3",
            "id": 97902
          },
          {
            "name": "振安区",
            "level": "3",
            "id": 98352
          },
          {
            "name": "宽甸满族自治县",
            "level": "3",
            "id": 108189
          },
          {
            "name": "东港市",
            "level": "3",
            "id": 113244
          },
          {
            "name": "凤城市",
            "level": "3",
            "id": 115133
          }
        ]
      },
      {
        "name": "锦州市",
        "level": "2",
        "id": 115881,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 115910
          },
          {
            "name": "古塔区",
            "level": "3",
            "id": 115911
          },
          {
            "name": "凌河区",
            "level": "3",
            "id": 116244
          },
          {
            "name": "太和区",
            "level": "3",
            "id": 116452
          },
          {
            "name": "黑山县",
            "level": "3",
            "id": 119213
          },
          {
            "name": "义县",
            "level": "3",
            "id": 120381
          },
          {
            "name": "凌海市",
            "level": "3",
            "id": 121210
          },
          {
            "name": "北镇市",
            "level": "3",
            "id": 121919
          }
        ]
      },
      {
        "name": "营口市",
        "level": "2",
        "id": 122820,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 122857
          },
          {
            "name": "站前区",
            "level": "3",
            "id": 122860
          },
          {
            "name": "西市区",
            "level": "3",
            "id": 123270
          },
          {
            "name": "鲅鱼圈区",
            "level": "3",
            "id": 123697
          },
          {
            "name": "老边区",
            "level": "3",
            "id": 130720
          },
          {
            "name": "盖州市",
            "level": "3",
            "id": 131057
          },
          {
            "name": "大石桥市",
            "level": "3",
            "id": 137228
          }
        ]
      },
      {
        "name": "阜新市",
        "level": "2",
        "id": 137937,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 137954
          },
          {
            "name": "海州区",
            "level": "3",
            "id": 137955
          },
          {
            "name": "新邱区",
            "level": "3",
            "id": 138399
          },
          {
            "name": "太平区",
            "level": "3",
            "id": 138661
          },
          {
            "name": "清河门区",
            "level": "3",
            "id": 138993
          },
          {
            "name": "细河区",
            "level": "3",
            "id": 139267
          },
          {
            "name": "阜新蒙古族自治县",
            "level": "3",
            "id": 139664
          },
          {
            "name": "彰武县",
            "level": "3",
            "id": 144929
          }
        ]
      },
      {
        "name": "辽阳市",
        "level": "2",
        "id": 146242,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 146250
          },
          {
            "name": "白塔区",
            "level": "3",
            "id": 146251
          },
          {
            "name": "文圣区",
            "level": "3",
            "id": 146406
          },
          {
            "name": "宏伟区",
            "level": "3",
            "id": 146517
          },
          {
            "name": "弓长岭区",
            "level": "3",
            "id": 158405
          },
          {
            "name": "太子河区",
            "level": "3",
            "id": 162718
          },
          {
            "name": "辽阳县",
            "level": "3",
            "id": 163094
          },
          {
            "name": "灯塔市",
            "level": "3",
            "id": 166938
          }
        ]
      },
      {
        "name": "盘锦市",
        "level": "2",
        "id": 167909,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 167966
          },
          {
            "name": "双台子区",
            "level": "3",
            "id": 167970
          },
          {
            "name": "兴隆台区",
            "level": "3",
            "id": 176380
          },
          {
            "name": "大洼区",
            "level": "3",
            "id": 176538
          },
          {
            "name": "盘山县",
            "level": "3",
            "id": 176797
          }
        ]
      },
      {
        "name": "铁岭市",
        "level": "2",
        "id": 180950,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 186472
          },
          {
            "name": "银州区",
            "level": "3",
            "id": 186473
          },
          {
            "name": "清河区",
            "level": "3",
            "id": 186731
          },
          {
            "name": "铁岭县",
            "level": "3",
            "id": 186956
          },
          {
            "name": "西丰县",
            "level": "3",
            "id": 187824
          },
          {
            "name": "昌图县",
            "level": "3",
            "id": 198078
          },
          {
            "name": "调兵山市",
            "level": "3",
            "id": 214548
          },
          {
            "name": "开原市",
            "level": "3",
            "id": 221376
          }
        ]
      },
      {
        "name": "朝阳市",
        "level": "2",
        "id": 222190,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 222221
          },
          {
            "name": "双塔区",
            "level": "3",
            "id": 222222
          },
          {
            "name": "龙城区",
            "level": "3",
            "id": 222883
          },
          {
            "name": "朝阳县",
            "level": "3",
            "id": 229955
          },
          {
            "name": "建平县",
            "level": "3",
            "id": 231607
          },
          {
            "name": "喀喇沁左翼蒙古族自治县",
            "level": "3",
            "id": 234918
          },
          {
            "name": "北票市",
            "level": "3",
            "id": 235234
          },
          {
            "name": "凌源市",
            "level": "3",
            "id": 244842
          }
        ]
      },
      {
        "name": "葫芦岛市",
        "level": "2",
        "id": 245158,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 245165
          },
          {
            "name": "连山区",
            "level": "3",
            "id": 245166
          },
          {
            "name": "龙港区",
            "level": "3",
            "id": 246015
          },
          {
            "name": "南票区",
            "level": "3",
            "id": 251806
          },
          {
            "name": "绥中县",
            "level": "3",
            "id": 259876
          },
          {
            "name": "建昌县",
            "level": "3",
            "id": 262135
          },
          {
            "name": "兴城市",
            "level": "3",
            "id": 264408
          }
        ]
      }
    ]
  },
  {
    "name": "吉林省",
    "level": "1",
    "id": 7,
    "childs": [{
        "name": "长春市",
        "level": "2",
        "id": 32,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 51
          },
          {
            "name": "南关区",
            "level": "3",
            "id": 55
          },
          {
            "name": "宽城区",
            "level": "3",
            "id": 10767
          },
          {
            "name": "朝阳区",
            "level": "3",
            "id": 12052
          },
          {
            "name": "二道区",
            "level": "3",
            "id": 12783
          },
          {
            "name": "绿园区",
            "level": "3",
            "id": 13310
          },
          {
            "name": "双阳区",
            "level": "3",
            "id": 13732
          },
          {
            "name": "九台区",
            "level": "3",
            "id": 14094
          },
          {
            "name": "农安县",
            "level": "3",
            "id": 15609
          },
          {
            "name": "榆树市",
            "level": "3",
            "id": 16804
          },
          {
            "name": "德惠市",
            "level": "3",
            "id": 23515
          }
        ]
      },
      {
        "name": "吉林市",
        "level": "2",
        "id": 25023,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 25058
          },
          {
            "name": "昌邑区",
            "level": "3",
            "id": 25061
          },
          {
            "name": "龙潭区",
            "level": "3",
            "id": 25729
          },
          {
            "name": "船营区",
            "level": "3",
            "id": 26398
          },
          {
            "name": "丰满区",
            "level": "3",
            "id": 27493
          },
          {
            "name": "永吉县",
            "level": "3",
            "id": 35742
          },
          {
            "name": "蛟河市",
            "level": "3",
            "id": 36195
          },
          {
            "name": "桦甸市",
            "level": "3",
            "id": 42474
          },
          {
            "name": "舒兰市",
            "level": "3",
            "id": 43014
          },
          {
            "name": "磐石市",
            "level": "3",
            "id": 43650
          }
        ]
      },
      {
        "name": "四平市",
        "level": "2",
        "id": 44078,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 44080
          },
          {
            "name": "铁西区",
            "level": "3",
            "id": 44081
          },
          {
            "name": "铁东区",
            "level": "3",
            "id": 44302
          },
          {
            "name": "梨树县",
            "level": "3",
            "id": 45049
          },
          {
            "name": "伊通满族自治县",
            "level": "3",
            "id": 49644
          },
          {
            "name": "公主岭市",
            "level": "3",
            "id": 50620
          },
          {
            "name": "双辽市",
            "level": "3",
            "id": 63958
          }
        ]
      },
      {
        "name": "辽源市",
        "level": "2",
        "id": 64536,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 64547
          },
          {
            "name": "龙山区",
            "level": "3",
            "id": 64550
          },
          {
            "name": "西安区",
            "level": "3",
            "id": 64804
          },
          {
            "name": "东丰县",
            "level": "3",
            "id": 64974
          },
          {
            "name": "东辽县",
            "level": "3",
            "id": 65900
          }
        ]
      },
      {
        "name": "通化市",
        "level": "2",
        "id": 66745,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 66797
          },
          {
            "name": "东昌区",
            "level": "3",
            "id": 66798
          },
          {
            "name": "二道江区",
            "level": "3",
            "id": 67317
          },
          {
            "name": "通化县",
            "level": "3",
            "id": 67646
          },
          {
            "name": "辉南县",
            "level": "3",
            "id": 68278
          },
          {
            "name": "柳河县",
            "level": "3",
            "id": 68620
          },
          {
            "name": "梅河口市",
            "level": "3",
            "id": 69132
          },
          {
            "name": "集安市",
            "level": "3",
            "id": 70339
          }
        ]
      },
      {
        "name": "白山市",
        "level": "2",
        "id": 74969,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 75012
          },
          {
            "name": "浑江区",
            "level": "3",
            "id": 75014
          },
          {
            "name": "江源区",
            "level": "3",
            "id": 75621
          },
          {
            "name": "抚松县",
            "level": "3",
            "id": 75967
          },
          {
            "name": "靖宇县",
            "level": "3",
            "id": 76500
          },
          {
            "name": "长白朝鲜族自治县",
            "level": "3",
            "id": 76665
          },
          {
            "name": "临江市",
            "level": "3",
            "id": 80201
          }
        ]
      },
      {
        "name": "松原市",
        "level": "2",
        "id": 86536,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 86539
          },
          {
            "name": "宁江区",
            "level": "3",
            "id": 86540
          },
          {
            "name": "前郭尔罗斯蒙古族自治县",
            "level": "3",
            "id": 90488
          },
          {
            "name": "长岭县",
            "level": "3",
            "id": 102984
          },
          {
            "name": "乾安县",
            "level": "3",
            "id": 106315
          },
          {
            "name": "扶余市",
            "level": "3",
            "id": 107049
          }
        ]
      },
      {
        "name": "白城市",
        "level": "2",
        "id": 107964,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 107976
          },
          {
            "name": "洮北区",
            "level": "3",
            "id": 107977
          },
          {
            "name": "镇赉县",
            "level": "3",
            "id": 112744
          },
          {
            "name": "通榆县",
            "level": "3",
            "id": 114684
          },
          {
            "name": "洮南市",
            "level": "3",
            "id": 115640
          },
          {
            "name": "大安市",
            "level": "3",
            "id": 126227
          }
        ]
      },
      {
        "name": "延边朝鲜族自治州",
        "level": "2",
        "id": 139228,
        "childs": [{
            "name": "延吉市",
            "level": "3",
            "id": 139273
          },
          {
            "name": "图们市",
            "level": "3",
            "id": 139996
          },
          {
            "name": "敦化市",
            "level": "3",
            "id": 140412
          },
          {
            "name": "珲春市",
            "level": "3",
            "id": 144991
          },
          {
            "name": "龙井市",
            "level": "3",
            "id": 145425
          },
          {
            "name": "和龙市",
            "level": "3",
            "id": 145604
          },
          {
            "name": "汪清县",
            "level": "3",
            "id": 145773
          },
          {
            "name": "安图县",
            "level": "3",
            "id": 157454
          }
        ]
      }
    ]
  },
  {
    "name": "黑龙江省",
    "level": "1",
    "id": 8,
    "childs": [{
        "name": "哈尔滨市",
        "level": "2",
        "id": 23,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 31
          },
          {
            "name": "道里区",
            "level": "3",
            "id": 34
          },
          {
            "name": "南岗区",
            "level": "3",
            "id": 14409
          },
          {
            "name": "道外区",
            "level": "3",
            "id": 15748
          },
          {
            "name": "平房区",
            "level": "3",
            "id": 16791
          },
          {
            "name": "松北区",
            "level": "3",
            "id": 16939
          },
          {
            "name": "香坊区",
            "level": "3",
            "id": 17155
          },
          {
            "name": "呼兰区",
            "level": "3",
            "id": 24120
          },
          {
            "name": "阿城区",
            "level": "3",
            "id": 25406
          },
          {
            "name": "双城区",
            "level": "3",
            "id": 25850
          },
          {
            "name": "依兰县",
            "level": "3",
            "id": 27809
          },
          {
            "name": "方正县",
            "level": "3",
            "id": 28926
          },
          {
            "name": "宾县",
            "level": "3",
            "id": 29585
          },
          {
            "name": "巴彦县",
            "level": "3",
            "id": 30534
          },
          {
            "name": "木兰县",
            "level": "3",
            "id": 31233
          },
          {
            "name": "通河县",
            "level": "3",
            "id": 31569
          },
          {
            "name": "延寿县",
            "level": "3",
            "id": 31954
          },
          {
            "name": "尚志市",
            "level": "3",
            "id": 32365
          },
          {
            "name": "五常市",
            "level": "3",
            "id": 33449
          }
        ]
      },
      {
        "name": "齐齐哈尔市",
        "level": "2",
        "id": 35186,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 35231
          },
          {
            "name": "龙沙区",
            "level": "3",
            "id": 35235
          },
          {
            "name": "建华区",
            "level": "3",
            "id": 35693
          },
          {
            "name": "铁锋区",
            "level": "3",
            "id": 35933
          },
          {
            "name": "昂昂溪区",
            "level": "3",
            "id": 36307
          },
          {
            "name": "富拉尔基区",
            "level": "3",
            "id": 36489
          },
          {
            "name": "碾子山区",
            "level": "3",
            "id": 37021
          },
          {
            "name": "梅里斯达斡尔族区",
            "level": "3",
            "id": 37320
          },
          {
            "name": "龙江县",
            "level": "3",
            "id": 37825
          },
          {
            "name": "依安县",
            "level": "3",
            "id": 43314
          },
          {
            "name": "泰来县",
            "level": "3",
            "id": 43716
          },
          {
            "name": "甘南县",
            "level": "3",
            "id": 54063
          },
          {
            "name": "富裕县",
            "level": "3",
            "id": 59728
          },
          {
            "name": "克山县",
            "level": "3",
            "id": 60191
          },
          {
            "name": "克东县",
            "level": "3",
            "id": 61314
          },
          {
            "name": "拜泉县",
            "level": "3",
            "id": 61958
          },
          {
            "name": "讷河市",
            "level": "3",
            "id": 63819
          }
        ]
      },
      {
        "name": "鸡西市",
        "level": "2",
        "id": 75979,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 76001
          },
          {
            "name": "鸡冠区",
            "level": "3",
            "id": 76003
          },
          {
            "name": "恒山区",
            "level": "3",
            "id": 76388
          },
          {
            "name": "滴道区",
            "level": "3",
            "id": 76543
          },
          {
            "name": "梨树区",
            "level": "3",
            "id": 80307
          },
          {
            "name": "城子河区",
            "level": "3",
            "id": 80744
          },
          {
            "name": "麻山区",
            "level": "3",
            "id": 81448
          },
          {
            "name": "鸡东县",
            "level": "3",
            "id": 81731
          },
          {
            "name": "虎林市",
            "level": "3",
            "id": 83088
          },
          {
            "name": "密山市",
            "level": "3",
            "id": 84862
          }
        ]
      },
      {
        "name": "鹤岗市",
        "level": "2",
        "id": 94675,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 94696
          },
          {
            "name": "向阳区",
            "level": "3",
            "id": 94697
          },
          {
            "name": "工农区",
            "level": "3",
            "id": 94835
          },
          {
            "name": "南山区",
            "level": "3",
            "id": 95199
          },
          {
            "name": "兴安区",
            "level": "3",
            "id": 95558
          },
          {
            "name": "东山区",
            "level": "3",
            "id": 95791
          },
          {
            "name": "兴山区",
            "level": "3",
            "id": 103590
          },
          {
            "name": "萝北县",
            "level": "3",
            "id": 107962
          },
          {
            "name": "绥滨县",
            "level": "3",
            "id": 108325
          }
        ]
      },
      {
        "name": "双鸭山市",
        "level": "2",
        "id": 108584,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 108590
          },
          {
            "name": "尖山区",
            "level": "3",
            "id": 108591
          },
          {
            "name": "岭东区",
            "level": "3",
            "id": 111159
          },
          {
            "name": "四方台区",
            "level": "3",
            "id": 111272
          },
          {
            "name": "宝山区",
            "level": "3",
            "id": 111444
          },
          {
            "name": "集贤县",
            "level": "3",
            "id": 111669
          },
          {
            "name": "友谊县",
            "level": "3",
            "id": 116673
          },
          {
            "name": "宝清县",
            "level": "3",
            "id": 116975
          },
          {
            "name": "饶河县",
            "level": "3",
            "id": 118442
          }
        ]
      },
      {
        "name": "大庆市",
        "level": "2",
        "id": 119922,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 119933
          },
          {
            "name": "萨尔图区",
            "level": "3",
            "id": 119934
          },
          {
            "name": "龙凤区",
            "level": "3",
            "id": 120305
          },
          {
            "name": "让胡路区",
            "level": "3",
            "id": 120612
          },
          {
            "name": "红岗区",
            "level": "3",
            "id": 121133
          },
          {
            "name": "大同区",
            "level": "3",
            "id": 121341
          },
          {
            "name": "肇州县",
            "level": "3",
            "id": 121783
          },
          {
            "name": "肇源县",
            "level": "3",
            "id": 129931
          },
          {
            "name": "林甸县",
            "level": "3",
            "id": 130425
          },
          {
            "name": "杜尔伯特蒙古族自治县",
            "level": "3",
            "id": 130533
          }
        ]
      },
      {
        "name": "伊春市",
        "level": "2",
        "id": 131118,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 131145
          },
          {
            "name": "伊春区",
            "level": "3",
            "id": 131147
          },
          {
            "name": "南岔区",
            "level": "3",
            "id": 131401
          },
          {
            "name": "友好区",
            "level": "3",
            "id": 137154
          },
          {
            "name": "西林区",
            "level": "3",
            "id": 137613
          },
          {
            "name": "翠峦区",
            "level": "3",
            "id": 138581
          },
          {
            "name": "新青区",
            "level": "3",
            "id": 139046
          },
          {
            "name": "美溪区",
            "level": "3",
            "id": 144280
          },
          {
            "name": "金山屯区",
            "level": "3",
            "id": 145474
          },
          {
            "name": "五营区",
            "level": "3",
            "id": 145611
          },
          {
            "name": "乌马河区",
            "level": "3",
            "id": 151387
          },
          {
            "name": "汤旺河区",
            "level": "3",
            "id": 151782
          },
          {
            "name": "带岭区",
            "level": "3",
            "id": 152182
          },
          {
            "name": "乌伊岭区",
            "level": "3",
            "id": 157915
          },
          {
            "name": "红星区",
            "level": "3",
            "id": 158261
          },
          {
            "name": "上甘岭区",
            "level": "3",
            "id": 158707
          },
          {
            "name": "嘉荫县",
            "level": "3",
            "id": 159071
          },
          {
            "name": "铁力市",
            "level": "3",
            "id": 159393
          }
        ]
      },
      {
        "name": "佳木斯市",
        "level": "2",
        "id": 161203,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 161215
          },
          {
            "name": "向阳区",
            "level": "3",
            "id": 161216
          },
          {
            "name": "前进区",
            "level": "3",
            "id": 161657
          },
          {
            "name": "东风区",
            "level": "3",
            "id": 163889
          },
          {
            "name": "郊区",
            "level": "3",
            "id": 164239
          },
          {
            "name": "桦南县",
            "level": "3",
            "id": 164787
          },
          {
            "name": "桦川县",
            "level": "3",
            "id": 165496
          },
          {
            "name": "汤原县",
            "level": "3",
            "id": 165809
          },
          {
            "name": "同江市",
            "level": "3",
            "id": 166451
          },
          {
            "name": "富锦市",
            "level": "3",
            "id": 167719
          },
          {
            "name": "抚远市",
            "level": "3",
            "id": 169771
          }
        ]
      },
      {
        "name": "七台河市",
        "level": "2",
        "id": 173250,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 173268
          },
          {
            "name": "新兴区",
            "level": "3",
            "id": 173270
          },
          {
            "name": "桃山区",
            "level": "3",
            "id": 177496
          },
          {
            "name": "茄子河区",
            "level": "3",
            "id": 178040
          },
          {
            "name": "勃利县",
            "level": "3",
            "id": 178386
          }
        ]
      },
      {
        "name": "牡丹江市",
        "level": "2",
        "id": 180737,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 180799
          },
          {
            "name": "东安区",
            "level": "3",
            "id": 180803
          },
          {
            "name": "阳明区",
            "level": "3",
            "id": 181280
          },
          {
            "name": "爱民区",
            "level": "3",
            "id": 186755
          },
          {
            "name": "西安区",
            "level": "3",
            "id": 187072
          },
          {
            "name": "林口县",
            "level": "3",
            "id": 187509
          },
          {
            "name": "绥芬河市",
            "level": "3",
            "id": 192519
          },
          {
            "name": "海林市",
            "level": "3",
            "id": 198030
          },
          {
            "name": "宁安市",
            "level": "3",
            "id": 198383
          },
          {
            "name": "穆棱市",
            "level": "3",
            "id": 203627
          },
          {
            "name": "东宁市",
            "level": "3",
            "id": 204251
          }
        ]
      },
      {
        "name": "黑河市",
        "level": "2",
        "id": 208823,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 215479
          },
          {
            "name": "爱辉区",
            "level": "3",
            "id": 215480
          },
          {
            "name": "嫩江县",
            "level": "3",
            "id": 216813
          },
          {
            "name": "逊克县",
            "level": "3",
            "id": 223650
          },
          {
            "name": "孙吴县",
            "level": "3",
            "id": 223956
          },
          {
            "name": "北安市",
            "level": "3",
            "id": 232249
          },
          {
            "name": "五大连池市",
            "level": "3",
            "id": 247215
          }
        ]
      },
      {
        "name": "绥化市",
        "level": "2",
        "id": 253898,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 253911
          },
          {
            "name": "北林区",
            "level": "3",
            "id": 253912
          },
          {
            "name": "望奎县",
            "level": "3",
            "id": 254829
          },
          {
            "name": "兰西县",
            "level": "3",
            "id": 263891
          },
          {
            "name": "青冈县",
            "level": "3",
            "id": 264530
          },
          {
            "name": "庆安县",
            "level": "3",
            "id": 269525
          },
          {
            "name": "明水县",
            "level": "3",
            "id": 274203
          },
          {
            "name": "绥棱县",
            "level": "3",
            "id": 275102
          },
          {
            "name": "安达市",
            "level": "3",
            "id": 280958
          },
          {
            "name": "肇东市",
            "level": "3",
            "id": 287538
          },
          {
            "name": "海伦市",
            "level": "3",
            "id": 288503
          }
        ]
      },
      {
        "name": "大兴安岭地区",
        "level": "2",
        "id": 299519,
        "childs": [{
            "name": "呼玛县",
            "level": "3",
            "id": 299548
          },
          {
            "name": "塔河县",
            "level": "3",
            "id": 300160
          },
          {
            "name": "漠河县",
            "level": "3",
            "id": 300636
          }
        ]
      }
    ]
  },
  {
    "name": "上海市",
    "level": "1",
    "id": 9,
    "childs": [{
      "name": "上海市",
      "level": "2",
      "id": 27,
      "childs": [{
          "name": "黄浦区",
          "level": "3",
          "id": 48
        },
        {
          "name": "徐汇区",
          "level": "3",
          "id": 1630
        },
        {
          "name": "长宁区",
          "level": "3",
          "id": 3963
        },
        {
          "name": "静安区",
          "level": "3",
          "id": 5256
        },
        {
          "name": "普陀区",
          "level": "3",
          "id": 15442
        },
        {
          "name": "虹口区",
          "level": "3",
          "id": 20545
        },
        {
          "name": "杨浦区",
          "level": "3",
          "id": 20870
        },
        {
          "name": "闵行区",
          "level": "3",
          "id": 21802
        },
        {
          "name": "宝山区",
          "level": "3",
          "id": 23545
        },
        {
          "name": "嘉定区",
          "level": "3",
          "id": 24761
        },
        {
          "name": "浦东新区",
          "level": "3",
          "id": 32607
        },
        {
          "name": "金山区",
          "level": "3",
          "id": 45894
        },
        {
          "name": "松江区",
          "level": "3",
          "id": 46381
        },
        {
          "name": "青浦区",
          "level": "3",
          "id": 47591
        },
        {
          "name": "奉贤区",
          "level": "3",
          "id": 48485
        },
        {
          "name": "崇明区",
          "level": "3",
          "id": 53239
        }
      ]
    }]
  },
  {
    "name": "江苏省",
    "level": "1",
    "id": 11,
    "childs": [{
        "name": "南京市",
        "level": "2",
        "id": 28,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 46
          },
          {
            "name": "玄武区",
            "level": "3",
            "id": 49
          },
          {
            "name": "秦淮区",
            "level": "3",
            "id": 682
          },
          {
            "name": "建邺区",
            "level": "3",
            "id": 1843
          },
          {
            "name": "鼓楼区",
            "level": "3",
            "id": 2580
          },
          {
            "name": "浦口区",
            "level": "3",
            "id": 3732
          },
          {
            "name": "栖霞区",
            "level": "3",
            "id": 4953
          },
          {
            "name": "雨花台区",
            "level": "3",
            "id": 6627
          },
          {
            "name": "江宁区",
            "level": "3",
            "id": 7465
          },
          {
            "name": "六合区",
            "level": "3",
            "id": 9072
          },
          {
            "name": "溧水区",
            "level": "3",
            "id": 10555
          },
          {
            "name": "高淳区",
            "level": "3",
            "id": 11515
          }
        ]
      },
      {
        "name": "无锡市",
        "level": "2",
        "id": 12630,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 12661
          },
          {
            "name": "锡山区",
            "level": "3",
            "id": 12665
          },
          {
            "name": "惠山区",
            "level": "3",
            "id": 13312
          },
          {
            "name": "滨湖区",
            "level": "3",
            "id": 13756
          },
          {
            "name": "梁溪区",
            "level": "3",
            "id": 19268
          },
          {
            "name": "新吴区",
            "level": "3",
            "id": 20151
          },
          {
            "name": "江阴市",
            "level": "3",
            "id": 26895
          },
          {
            "name": "宜兴市",
            "level": "3",
            "id": 28766
          }
        ]
      },
      {
        "name": "徐州市",
        "level": "2",
        "id": 30159,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 30185
          },
          {
            "name": "鼓楼区",
            "level": "3",
            "id": 30187
          },
          {
            "name": "云龙区",
            "level": "3",
            "id": 30523
          },
          {
            "name": "贾汪区",
            "level": "3",
            "id": 30864
          },
          {
            "name": "泉山区",
            "level": "3",
            "id": 31247
          },
          {
            "name": "铜山区",
            "level": "3",
            "id": 44063
          },
          {
            "name": "丰县",
            "level": "3",
            "id": 49005
          },
          {
            "name": "沛县",
            "level": "3",
            "id": 50254
          },
          {
            "name": "睢宁县",
            "level": "3",
            "id": 57837
          },
          {
            "name": "新沂市",
            "level": "3",
            "id": 58392
          },
          {
            "name": "邳州市",
            "level": "3",
            "id": 58722
          }
        ]
      },
      {
        "name": "常州市",
        "level": "2",
        "id": 66479,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 66489
          },
          {
            "name": "天宁区",
            "level": "3",
            "id": 66492
          },
          {
            "name": "钟楼区",
            "level": "3",
            "id": 66989
          },
          {
            "name": "新北区",
            "level": "3",
            "id": 67463
          },
          {
            "name": "武进区",
            "level": "3",
            "id": 71133
          },
          {
            "name": "金坛区",
            "level": "3",
            "id": 71865
          },
          {
            "name": "溧阳市",
            "level": "3",
            "id": 72414
          }
        ]
      },
      {
        "name": "苏州市",
        "level": "2",
        "id": 73296,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 73316
          },
          {
            "name": "虎丘区",
            "level": "3",
            "id": 73317
          },
          {
            "name": "吴中区",
            "level": "3",
            "id": 77329
          },
          {
            "name": "相城区",
            "level": "3",
            "id": 85994
          },
          {
            "name": "姑苏区",
            "level": "3",
            "id": 86153
          },
          {
            "name": "吴江区",
            "level": "3",
            "id": 89082
          },
          {
            "name": "常熟市",
            "level": "3",
            "id": 89792
          },
          {
            "name": "张家港市",
            "level": "3",
            "id": 90627
          },
          {
            "name": "昆山市",
            "level": "3",
            "id": 91670
          },
          {
            "name": "太仓市",
            "level": "3",
            "id": 92715
          }
        ]
      },
      {
        "name": "南通市",
        "level": "2",
        "id": 93577,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 93594
          },
          {
            "name": "崇川区",
            "level": "3",
            "id": 93597
          },
          {
            "name": "港闸区",
            "level": "3",
            "id": 94246
          },
          {
            "name": "通州区",
            "level": "3",
            "id": 96085
          },
          {
            "name": "海安县",
            "level": "3",
            "id": 99222
          },
          {
            "name": "如东县",
            "level": "3",
            "id": 100118
          },
          {
            "name": "启东市",
            "level": "3",
            "id": 100931
          },
          {
            "name": "如皋市",
            "level": "3",
            "id": 101979
          },
          {
            "name": "海门市",
            "level": "3",
            "id": 105659
          }
        ]
      },
      {
        "name": "连云港市",
        "level": "2",
        "id": 106270,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 106287
          },
          {
            "name": "连云区",
            "level": "3",
            "id": 106288
          },
          {
            "name": "海州区",
            "level": "3",
            "id": 106885
          },
          {
            "name": "赣榆区",
            "level": "3",
            "id": 109754
          },
          {
            "name": "东海县",
            "level": "3",
            "id": 113938
          },
          {
            "name": "灌云县",
            "level": "3",
            "id": 126104
          },
          {
            "name": "灌南县",
            "level": "3",
            "id": 127354
          }
        ]
      },
      {
        "name": "淮安市",
        "level": "2",
        "id": 133433,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 133456
          },
          {
            "name": "淮安区",
            "level": "3",
            "id": 133457
          },
          {
            "name": "淮阴区",
            "level": "3",
            "id": 140758
          },
          {
            "name": "清江浦区",
            "level": "3",
            "id": 141827
          },
          {
            "name": "洪泽区",
            "level": "3",
            "id": 146529
          },
          {
            "name": "涟水县",
            "level": "3",
            "id": 146742
          },
          {
            "name": "盱眙县",
            "level": "3",
            "id": 148034
          },
          {
            "name": "金湖县",
            "level": "3",
            "id": 154826
          }
        ]
      },
      {
        "name": "盐城市",
        "level": "2",
        "id": 155077,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 155099
          },
          {
            "name": "亭湖区",
            "level": "3",
            "id": 155100
          },
          {
            "name": "盐都区",
            "level": "3",
            "id": 155519
          },
          {
            "name": "大丰区",
            "level": "3",
            "id": 161496
          },
          {
            "name": "响水县",
            "level": "3",
            "id": 161892
          },
          {
            "name": "滨海县",
            "level": "3",
            "id": 162068
          },
          {
            "name": "阜宁县",
            "level": "3",
            "id": 162502
          },
          {
            "name": "射阳县",
            "level": "3",
            "id": 163345
          },
          {
            "name": "建湖县",
            "level": "3",
            "id": 167528
          },
          {
            "name": "东台市",
            "level": "3",
            "id": 168708
          }
        ]
      },
      {
        "name": "扬州市",
        "level": "2",
        "id": 170278,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 170338
          },
          {
            "name": "广陵区",
            "level": "3",
            "id": 170340
          },
          {
            "name": "邗江区",
            "level": "3",
            "id": 171002
          },
          {
            "name": "江都区",
            "level": "3",
            "id": 177562
          },
          {
            "name": "宝应县",
            "level": "3",
            "id": 178137
          },
          {
            "name": "仪征市",
            "level": "3",
            "id": 182030
          },
          {
            "name": "高邮市",
            "level": "3",
            "id": 183628
          }
        ]
      },
      {
        "name": "镇江市",
        "level": "2",
        "id": 184884,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 184917
          },
          {
            "name": "京口区",
            "level": "3",
            "id": 184918
          },
          {
            "name": "润州区",
            "level": "3",
            "id": 185397
          },
          {
            "name": "丹徒区",
            "level": "3",
            "id": 185670
          },
          {
            "name": "丹阳市",
            "level": "3",
            "id": 186458
          },
          {
            "name": "扬中市",
            "level": "3",
            "id": 192659
          },
          {
            "name": "句容市",
            "level": "3",
            "id": 193208
          }
        ]
      },
      {
        "name": "泰州市",
        "level": "2",
        "id": 194534,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 194603
          },
          {
            "name": "海陵区",
            "level": "3",
            "id": 194604
          },
          {
            "name": "高港区",
            "level": "3",
            "id": 198802
          },
          {
            "name": "姜堰区",
            "level": "3",
            "id": 203977
          },
          {
            "name": "兴化市",
            "level": "3",
            "id": 209051
          },
          {
            "name": "靖江市",
            "level": "3",
            "id": 210700
          },
          {
            "name": "泰兴市",
            "level": "3",
            "id": 218320
          }
        ]
      },
      {
        "name": "宿迁市",
        "level": "2",
        "id": 219428,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 219470
          },
          {
            "name": "宿城区",
            "level": "3",
            "id": 219472
          },
          {
            "name": "宿豫区",
            "level": "3",
            "id": 220030
          },
          {
            "name": "沭阳县",
            "level": "3",
            "id": 220910
          },
          {
            "name": "泗阳县",
            "level": "3",
            "id": 235428
          },
          {
            "name": "泗洪县",
            "level": "3",
            "id": 236406
          }
        ]
      }
    ]
  },
  {
    "name": "浙江省",
    "level": "1",
    "id": 12,
    "childs": [{
        "name": "杭州市",
        "level": "2",
        "id": 38191,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 38204
          },
          {
            "name": "上城区",
            "level": "3",
            "id": 38207
          },
          {
            "name": "下城区",
            "level": "3",
            "id": 38416
          },
          {
            "name": "江干区",
            "level": "3",
            "id": 38774
          },
          {
            "name": "拱墅区",
            "level": "3",
            "id": 39258
          },
          {
            "name": "西湖区",
            "level": "3",
            "id": 39778
          },
          {
            "name": "滨江区",
            "level": "3",
            "id": 44415
          },
          {
            "name": "萧山区",
            "level": "3",
            "id": 44605
          },
          {
            "name": "余杭区",
            "level": "3",
            "id": 50365
          },
          {
            "name": "富阳区",
            "level": "3",
            "id": 57872
          },
          {
            "name": "桐庐县",
            "level": "3",
            "id": 64046
          },
          {
            "name": "淳安县",
            "level": "3",
            "id": 64524
          },
          {
            "name": "建德市",
            "level": "3",
            "id": 65889
          },
          {
            "name": "临安市",
            "level": "3",
            "id": 66882
          }
        ]
      },
      {
        "name": "宁波市",
        "level": "2",
        "id": 67937,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 67949
          },
          {
            "name": "海曙区",
            "level": "3",
            "id": 67951
          },
          {
            "name": "江东区",
            "level": "3",
            "id": 68258
          },
          {
            "name": "江北区",
            "level": "3",
            "id": 71704
          },
          {
            "name": "北仑区",
            "level": "3",
            "id": 72230
          },
          {
            "name": "镇海区",
            "level": "3",
            "id": 75208
          },
          {
            "name": "鄞州区",
            "level": "3",
            "id": 75602
          },
          {
            "name": "象山县",
            "level": "3",
            "id": 79182
          },
          {
            "name": "宁海县",
            "level": "3",
            "id": 80656
          },
          {
            "name": "余姚市",
            "level": "3",
            "id": 83009
          },
          {
            "name": "慈溪市",
            "level": "3",
            "id": 90593
          },
          {
            "name": "奉化市",
            "level": "3",
            "id": 92090
          }
        ]
      },
      {
        "name": "温州市",
        "level": "2",
        "id": 93554,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 93579
          },
          {
            "name": "鹿城区",
            "level": "3",
            "id": 93581
          },
          {
            "name": "龙湾区",
            "level": "3",
            "id": 95192
          },
          {
            "name": "瓯海区",
            "level": "3",
            "id": 95615
          },
          {
            "name": "洞头区",
            "level": "3",
            "id": 96072
          },
          {
            "name": "永嘉县",
            "level": "3",
            "id": 96284
          },
          {
            "name": "平阳县",
            "level": "3",
            "id": 100364
          },
          {
            "name": "苍南县",
            "level": "3",
            "id": 101525
          },
          {
            "name": "文成县",
            "level": "3",
            "id": 103053
          },
          {
            "name": "泰顺县",
            "level": "3",
            "id": 106105
          },
          {
            "name": "瑞安市",
            "level": "3",
            "id": 106903
          },
          {
            "name": "乐清市",
            "level": "3",
            "id": 112732
          }
        ]
      },
      {
        "name": "嘉兴市",
        "level": "2",
        "id": 118970,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 119060
          },
          {
            "name": "南湖区",
            "level": "3",
            "id": 119061
          },
          {
            "name": "秀洲区",
            "level": "3",
            "id": 127303
          },
          {
            "name": "嘉善县",
            "level": "3",
            "id": 127981
          },
          {
            "name": "海盐县",
            "level": "3",
            "id": 128359
          },
          {
            "name": "海宁市",
            "level": "3",
            "id": 128741
          },
          {
            "name": "平湖市",
            "level": "3",
            "id": 129286
          },
          {
            "name": "桐乡市",
            "level": "3",
            "id": 129560
          }
        ]
      },
      {
        "name": "湖州市",
        "level": "2",
        "id": 130169,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 130204
          },
          {
            "name": "吴兴区",
            "level": "3",
            "id": 130205
          },
          {
            "name": "南浔区",
            "level": "3",
            "id": 135478
          },
          {
            "name": "德清县",
            "level": "3",
            "id": 136086
          },
          {
            "name": "长兴县",
            "level": "3",
            "id": 142550
          },
          {
            "name": "安吉县",
            "level": "3",
            "id": 143068
          }
        ]
      },
      {
        "name": "绍兴市",
        "level": "2",
        "id": 143644,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 143654
          },
          {
            "name": "越城区",
            "level": "3",
            "id": 143655
          },
          {
            "name": "柯桥区",
            "level": "3",
            "id": 147533
          },
          {
            "name": "上虞区",
            "level": "3",
            "id": 154198
          },
          {
            "name": "新昌县",
            "level": "3",
            "id": 160186
          },
          {
            "name": "诸暨市",
            "level": "3",
            "id": 171026
          },
          {
            "name": "嵊州市",
            "level": "3",
            "id": 171740
          }
        ]
      },
      {
        "name": "金华市",
        "level": "2",
        "id": 174873,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 174874
          },
          {
            "name": "婺城区",
            "level": "3",
            "id": 174875
          },
          {
            "name": "金东区",
            "level": "3",
            "id": 175856
          },
          {
            "name": "武义县",
            "level": "3",
            "id": 179838
          },
          {
            "name": "浦江县",
            "level": "3",
            "id": 181650
          },
          {
            "name": "磐安县",
            "level": "3",
            "id": 183422
          },
          {
            "name": "兰溪市",
            "level": "3",
            "id": 185121
          },
          {
            "name": "义乌市",
            "level": "3",
            "id": 188959
          },
          {
            "name": "东阳市",
            "level": "3",
            "id": 190634
          },
          {
            "name": "永康市",
            "level": "3",
            "id": 193330
          }
        ]
      },
      {
        "name": "衢州市",
        "level": "2",
        "id": 195537,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 195596
          },
          {
            "name": "柯城区",
            "level": "3",
            "id": 195599
          },
          {
            "name": "衢江区",
            "level": "3",
            "id": 196541
          },
          {
            "name": "常山县",
            "level": "3",
            "id": 196947
          },
          {
            "name": "开化县",
            "level": "3",
            "id": 197155
          },
          {
            "name": "龙游县",
            "level": "3",
            "id": 197436
          },
          {
            "name": "江山市",
            "level": "3",
            "id": 201311
          }
        ]
      },
      {
        "name": "舟山市",
        "level": "2",
        "id": 201739,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 201752
          },
          {
            "name": "定海区",
            "level": "3",
            "id": 201753
          },
          {
            "name": "普陀区",
            "level": "3",
            "id": 207984
          },
          {
            "name": "岱山县",
            "level": "3",
            "id": 212571
          },
          {
            "name": "嵊泗县",
            "level": "3",
            "id": 212937
          }
        ]
      },
      {
        "name": "台州市",
        "level": "2",
        "id": 213295,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 213310
          },
          {
            "name": "椒江区",
            "level": "3",
            "id": 213311
          },
          {
            "name": "黄岩区",
            "level": "3",
            "id": 214152
          },
          {
            "name": "路桥区",
            "level": "3",
            "id": 215629
          },
          {
            "name": "玉环县",
            "level": "3",
            "id": 216266
          },
          {
            "name": "三门县",
            "level": "3",
            "id": 216868
          },
          {
            "name": "天台县",
            "level": "3",
            "id": 217431
          },
          {
            "name": "仙居县",
            "level": "3",
            "id": 218552
          },
          {
            "name": "温岭市",
            "level": "3",
            "id": 224237
          },
          {
            "name": "临海市",
            "level": "3",
            "id": 225723
          }
        ]
      },
      {
        "name": "丽水市",
        "level": "2",
        "id": 228511,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 228527
          },
          {
            "name": "莲都区",
            "level": "3",
            "id": 228530
          },
          {
            "name": "青田县",
            "level": "3",
            "id": 229058
          },
          {
            "name": "缙云县",
            "level": "3",
            "id": 230486
          },
          {
            "name": "遂昌县",
            "level": "3",
            "id": 234027
          },
          {
            "name": "松阳县",
            "level": "3",
            "id": 234344
          },
          {
            "name": "云和县",
            "level": "3",
            "id": 235058
          },
          {
            "name": "庆元县",
            "level": "3",
            "id": 240388
          },
          {
            "name": "景宁畲族自治县",
            "level": "3",
            "id": 241321
          },
          {
            "name": "龙泉市",
            "level": "3",
            "id": 241728
          }
        ]
      }
    ]
  },
  {
    "name": "安徽省",
    "level": "1",
    "id": 13,
    "childs": [{
        "name": "合肥市",
        "level": "2",
        "id": 55316,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 55337
          },
          {
            "name": "瑶海区",
            "level": "3",
            "id": 55338
          },
          {
            "name": "庐阳区",
            "level": "3",
            "id": 66893
          },
          {
            "name": "蜀山区",
            "level": "3",
            "id": 76703
          },
          {
            "name": "包河区",
            "level": "3",
            "id": 76811
          },
          {
            "name": "长丰县",
            "level": "3",
            "id": 80711
          },
          {
            "name": "肥东县",
            "level": "3",
            "id": 89372
          },
          {
            "name": "肥西县",
            "level": "3",
            "id": 92809
          },
          {
            "name": "庐江县",
            "level": "3",
            "id": 94039
          },
          {
            "name": "巢湖市",
            "level": "3",
            "id": 94714
          }
        ]
      },
      {
        "name": "芜湖市",
        "level": "2",
        "id": 97761,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 97795
          },
          {
            "name": "镜湖区",
            "level": "3",
            "id": 97796
          },
          {
            "name": "弋江区",
            "level": "3",
            "id": 103549
          },
          {
            "name": "鸠江区",
            "level": "3",
            "id": 103739
          },
          {
            "name": "三山区",
            "level": "3",
            "id": 103959
          },
          {
            "name": "芜湖县",
            "level": "3",
            "id": 104023
          },
          {
            "name": "繁昌县",
            "level": "3",
            "id": 108456
          },
          {
            "name": "南陵县",
            "level": "3",
            "id": 108615
          },
          {
            "name": "无为县",
            "level": "3",
            "id": 110790
          }
        ]
      },
      {
        "name": "蚌埠市",
        "level": "2",
        "id": 114314,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 114403
          },
          {
            "name": "龙子湖区",
            "level": "3",
            "id": 114405
          },
          {
            "name": "蚌山区",
            "level": "3",
            "id": 114870
          },
          {
            "name": "禹会区",
            "level": "3",
            "id": 115288
          },
          {
            "name": "淮上区",
            "level": "3",
            "id": 115500
          },
          {
            "name": "怀远县",
            "level": "3",
            "id": 115751
          },
          {
            "name": "五河县",
            "level": "3",
            "id": 118114
          },
          {
            "name": "固镇县",
            "level": "3",
            "id": 119351
          }
        ]
      },
      {
        "name": "淮南市",
        "level": "2",
        "id": 121115,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 121121
          },
          {
            "name": "大通区",
            "level": "3",
            "id": 121122
          },
          {
            "name": "田家庵区",
            "level": "3",
            "id": 121333
          },
          {
            "name": "谢家集区",
            "level": "3",
            "id": 121760
          },
          {
            "name": "八公山区",
            "level": "3",
            "id": 122070
          },
          {
            "name": "潘集区",
            "level": "3",
            "id": 122333
          },
          {
            "name": "凤台县",
            "level": "3",
            "id": 123036
          },
          {
            "name": "寿县",
            "level": "3",
            "id": 131734
          }
        ]
      },
      {
        "name": "马鞍山市",
        "level": "2",
        "id": 132417,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 132419
          },
          {
            "name": "花山区",
            "level": "3",
            "id": 132420
          },
          {
            "name": "雨山区",
            "level": "3",
            "id": 132721
          },
          {
            "name": "博望区",
            "level": "3",
            "id": 132894
          },
          {
            "name": "当涂县",
            "level": "3",
            "id": 133028
          },
          {
            "name": "含山县",
            "level": "3",
            "id": 133586
          },
          {
            "name": "和县",
            "level": "3",
            "id": 140039
          }
        ]
      },
      {
        "name": "淮北市",
        "level": "2",
        "id": 140749,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 140796
          },
          {
            "name": "杜集区",
            "level": "3",
            "id": 140798
          },
          {
            "name": "相山区",
            "level": "3",
            "id": 141165
          },
          {
            "name": "烈山区",
            "level": "3",
            "id": 141732
          },
          {
            "name": "濉溪县",
            "level": "3",
            "id": 141910
          }
        ]
      },
      {
        "name": "铜陵市",
        "level": "2",
        "id": 142272,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 142273
          },
          {
            "name": "铜官区",
            "level": "3",
            "id": 142274
          },
          {
            "name": "义安区",
            "level": "3",
            "id": 142334
          },
          {
            "name": "郊区",
            "level": "3",
            "id": 142462
          },
          {
            "name": "枞阳县",
            "level": "3",
            "id": 145839
          }
        ]
      },
      {
        "name": "安庆市",
        "level": "2",
        "id": 146315,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 146326
          },
          {
            "name": "迎江区",
            "level": "3",
            "id": 146327
          },
          {
            "name": "大观区",
            "level": "3",
            "id": 146456
          },
          {
            "name": "宜秀区",
            "level": "3",
            "id": 146740
          },
          {
            "name": "怀宁县",
            "level": "3",
            "id": 146885
          },
          {
            "name": "潜山县",
            "level": "3",
            "id": 147847
          },
          {
            "name": "太湖县",
            "level": "3",
            "id": 148669
          },
          {
            "name": "宿松县",
            "level": "3",
            "id": 149709
          },
          {
            "name": "望江县",
            "level": "3",
            "id": 150724
          },
          {
            "name": "岳西县",
            "level": "3",
            "id": 152210
          },
          {
            "name": "桐城市",
            "level": "3",
            "id": 152985
          }
        ]
      },
      {
        "name": "黄山市",
        "level": "2",
        "id": 159044,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 159056
          },
          {
            "name": "屯溪区",
            "level": "3",
            "id": 159059
          },
          {
            "name": "黄山区",
            "level": "3",
            "id": 166898
          },
          {
            "name": "徽州区",
            "level": "3",
            "id": 167701
          },
          {
            "name": "歙县",
            "level": "3",
            "id": 168261
          },
          {
            "name": "休宁县",
            "level": "3",
            "id": 170208
          },
          {
            "name": "黟县",
            "level": "3",
            "id": 173531
          },
          {
            "name": "祁门县",
            "level": "3",
            "id": 177247
          }
        ]
      },
      {
        "name": "滁州市",
        "level": "2",
        "id": 179154,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 179156
          },
          {
            "name": "琅琊区",
            "level": "3",
            "id": 179157
          },
          {
            "name": "南谯区",
            "level": "3",
            "id": 179315
          },
          {
            "name": "来安县",
            "level": "3",
            "id": 182042
          },
          {
            "name": "全椒县",
            "level": "3",
            "id": 187371
          },
          {
            "name": "定远县",
            "level": "3",
            "id": 187955
          },
          {
            "name": "凤阳县",
            "level": "3",
            "id": 201870
          },
          {
            "name": "天长市",
            "level": "3",
            "id": 202666
          },
          {
            "name": "明光市",
            "level": "3",
            "id": 203302
          }
        ]
      },
      {
        "name": "阜阳市",
        "level": "2",
        "id": 214776,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 214791
          },
          {
            "name": "颍州区",
            "level": "3",
            "id": 214794
          },
          {
            "name": "颍东区",
            "level": "3",
            "id": 215646
          },
          {
            "name": "颍泉区",
            "level": "3",
            "id": 216197
          },
          {
            "name": "临泉县",
            "level": "3",
            "id": 216530
          },
          {
            "name": "太和县",
            "level": "3",
            "id": 223446
          },
          {
            "name": "阜南县",
            "level": "3",
            "id": 223944
          },
          {
            "name": "颍上县",
            "level": "3",
            "id": 225375
          },
          {
            "name": "界首市",
            "level": "3",
            "id": 227467
          }
        ]
      },
      {
        "name": "宿州市",
        "level": "2",
        "id": 230334,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 237501
          },
          {
            "name": "��桥区",
            "level": "3",
            "id": 237504
          },
          {
            "name": "砀山县",
            "level": "3",
            "id": 243297
          },
          {
            "name": "萧县",
            "level": "3",
            "id": 251585
          },
          {
            "name": "灵璧县",
            "level": "3",
            "id": 252789
          },
          {
            "name": "泗县",
            "level": "3",
            "id": 253601
          }
        ]
      },
      {
        "name": "六安市",
        "level": "2",
        "id": 253948,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 253960
          },
          {
            "name": "金安区",
            "level": "3",
            "id": 253961
          },
          {
            "name": "裕安区",
            "level": "3",
            "id": 254807
          },
          {
            "name": "叶集区",
            "level": "3",
            "id": 255314
          },
          {
            "name": "霍邱县",
            "level": "3",
            "id": 255448
          },
          {
            "name": "舒城县",
            "level": "3",
            "id": 257301
          },
          {
            "name": "金寨县",
            "level": "3",
            "id": 265229
          },
          {
            "name": "霍山县",
            "level": "3",
            "id": 275876
          }
        ]
      },
      {
        "name": "亳州市",
        "level": "2",
        "id": 276256,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 276271
          },
          {
            "name": "谯城区",
            "level": "3",
            "id": 276272
          },
          {
            "name": "涡阳县",
            "level": "3",
            "id": 277117
          },
          {
            "name": "蒙城县",
            "level": "3",
            "id": 277855
          },
          {
            "name": "利辛县",
            "level": "3",
            "id": 285545
          }
        ]
      },
      {
        "name": "池州市",
        "level": "2",
        "id": 286431,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 286432
          },
          {
            "name": "贵池区",
            "level": "3",
            "id": 286433
          },
          {
            "name": "东至县",
            "level": "3",
            "id": 286685
          },
          {
            "name": "石台县",
            "level": "3",
            "id": 291204
          },
          {
            "name": "青阳县",
            "level": "3",
            "id": 291684
          }
        ]
      },
      {
        "name": "宣城市",
        "level": "2",
        "id": 292203,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 292207
          },
          {
            "name": "宣州区",
            "level": "3",
            "id": 292209
          },
          {
            "name": "郎溪县",
            "level": "3",
            "id": 292938
          },
          {
            "name": "广德县",
            "level": "3",
            "id": 307213
          },
          {
            "name": "泾县",
            "level": "3",
            "id": 307627
          },
          {
            "name": "绩溪县",
            "level": "3",
            "id": 307839
          },
          {
            "name": "旌德县",
            "level": "3",
            "id": 307948
          },
          {
            "name": "宁国市",
            "level": "3",
            "id": 312595
          }
        ]
      }
    ]
  },
  {
    "name": "福建省",
    "level": "1",
    "id": 14,
    "childs": [{
        "name": "福州市",
        "level": "2",
        "id": 65727,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 65773
          },
          {
            "name": "鼓楼区",
            "level": "3",
            "id": 65774
          },
          {
            "name": "台江区",
            "level": "3",
            "id": 66330
          },
          {
            "name": "仓山区",
            "level": "3",
            "id": 66822
          },
          {
            "name": "马尾区",
            "level": "3",
            "id": 67607
          },
          {
            "name": "晋安区",
            "level": "3",
            "id": 71060
          },
          {
            "name": "闽侯县",
            "level": "3",
            "id": 71421
          },
          {
            "name": "连江县",
            "level": "3",
            "id": 72305
          },
          {
            "name": "罗源县",
            "level": "3",
            "id": 73616
          },
          {
            "name": "闽清县",
            "level": "3",
            "id": 74140
          },
          {
            "name": "永泰县",
            "level": "3",
            "id": 77303
          },
          {
            "name": "平潭县",
            "level": "3",
            "id": 79159
          },
          {
            "name": "福清市",
            "level": "3",
            "id": 80049
          },
          {
            "name": "长乐市",
            "level": "3",
            "id": 83075
          }
        ]
      },
      {
        "name": "厦门市",
        "level": "2",
        "id": 84816,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 84847
          },
          {
            "name": "思明区",
            "level": "3",
            "id": 84852
          },
          {
            "name": "海沧区",
            "level": "3",
            "id": 87078
          },
          {
            "name": "湖里区",
            "level": "3",
            "id": 87254
          },
          {
            "name": "集美区",
            "level": "3",
            "id": 91963
          },
          {
            "name": "同安区",
            "level": "3",
            "id": 92606
          },
          {
            "name": "翔安区",
            "level": "3",
            "id": 93611
          }
        ]
      },
      {
        "name": "莆田市",
        "level": "2",
        "id": 97228,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 97237
          },
          {
            "name": "城厢区",
            "level": "3",
            "id": 97238
          },
          {
            "name": "涵江区",
            "level": "3",
            "id": 103545
          },
          {
            "name": "荔城区",
            "level": "3",
            "id": 107044
          },
          {
            "name": "秀屿区",
            "level": "3",
            "id": 107231
          },
          {
            "name": "仙游县",
            "level": "3",
            "id": 107736
          }
        ]
      },
      {
        "name": "三明市",
        "level": "2",
        "id": 110425,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 110447
          },
          {
            "name": "梅列区",
            "level": "3",
            "id": 110448
          },
          {
            "name": "三元区",
            "level": "3",
            "id": 110527
          },
          {
            "name": "明溪县",
            "level": "3",
            "id": 110615
          },
          {
            "name": "清流县",
            "level": "3",
            "id": 110724
          },
          {
            "name": "宁化县",
            "level": "3",
            "id": 110894
          },
          {
            "name": "大田县",
            "level": "3",
            "id": 113291
          },
          {
            "name": "尤溪县",
            "level": "3",
            "id": 122977
          },
          {
            "name": "沙县",
            "level": "3",
            "id": 123842
          },
          {
            "name": "将乐县",
            "level": "3",
            "id": 131327
          },
          {
            "name": "泰宁县",
            "level": "3",
            "id": 131928
          },
          {
            "name": "建宁县",
            "level": "3",
            "id": 132202
          },
          {
            "name": "永安市",
            "level": "3",
            "id": 132414
          }
        ]
      },
      {
        "name": "泉州市",
        "level": "2",
        "id": 132839,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 132842
          },
          {
            "name": "鲤城区",
            "level": "3",
            "id": 132843
          },
          {
            "name": "丰泽区",
            "level": "3",
            "id": 133115
          },
          {
            "name": "洛江区",
            "level": "3",
            "id": 133455
          },
          {
            "name": "泉港区",
            "level": "3",
            "id": 133647
          },
          {
            "name": "惠安县",
            "level": "3",
            "id": 133850
          },
          {
            "name": "安溪县",
            "level": "3",
            "id": 134167
          },
          {
            "name": "永春县",
            "level": "3",
            "id": 134802
          },
          {
            "name": "德化县",
            "level": "3",
            "id": 135950
          },
          {
            "name": "金门县",
            "level": "3",
            "id": 142602
          },
          {
            "name": "石狮市",
            "level": "3",
            "id": 142603
          },
          {
            "name": "晋江市",
            "level": "3",
            "id": 142905
          },
          {
            "name": "南安市",
            "level": "3",
            "id": 143689
          }
        ]
      },
      {
        "name": "漳州市",
        "level": "2",
        "id": 147896,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 147923
          },
          {
            "name": "芗城区",
            "level": "3",
            "id": 147926
          },
          {
            "name": "龙文区",
            "level": "3",
            "id": 148630
          },
          {
            "name": "云霄县",
            "level": "3",
            "id": 148914
          },
          {
            "name": "漳浦县",
            "level": "3",
            "id": 149736
          },
          {
            "name": "诏安县",
            "level": "3",
            "id": 155574
          },
          {
            "name": "长泰县",
            "level": "3",
            "id": 158094
          },
          {
            "name": "东山县",
            "level": "3",
            "id": 158386
          },
          {
            "name": "南靖县",
            "level": "3",
            "id": 158732
          },
          {
            "name": "平和县",
            "level": "3",
            "id": 159116
          },
          {
            "name": "华安县",
            "level": "3",
            "id": 159574
          },
          {
            "name": "龙海市",
            "level": "3",
            "id": 168405
          }
        ]
      },
      {
        "name": "南平市",
        "level": "2",
        "id": 170125,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 170150
          },
          {
            "name": "延平区",
            "level": "3",
            "id": 170151
          },
          {
            "name": "建阳区",
            "level": "3",
            "id": 177371
          },
          {
            "name": "顺昌县",
            "level": "3",
            "id": 181219
          },
          {
            "name": "浦城县",
            "level": "3",
            "id": 182360
          },
          {
            "name": "光泽县",
            "level": "3",
            "id": 184139
          },
          {
            "name": "松溪县",
            "level": "3",
            "id": 184845
          },
          {
            "name": "政和县",
            "level": "3",
            "id": 185414
          },
          {
            "name": "邵武市",
            "level": "3",
            "id": 185770
          },
          {
            "name": "武夷山市",
            "level": "3",
            "id": 186027
          },
          {
            "name": "建瓯市",
            "level": "3",
            "id": 186180
          }
        ]
      },
      {
        "name": "龙岩市",
        "level": "2",
        "id": 186454,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 186455
          },
          {
            "name": "新罗区",
            "level": "3",
            "id": 186456
          },
          {
            "name": "永定区",
            "level": "3",
            "id": 191455
          },
          {
            "name": "长汀县",
            "level": "3",
            "id": 191760
          },
          {
            "name": "上杭县",
            "level": "3",
            "id": 193435
          },
          {
            "name": "武平县",
            "level": "3",
            "id": 195634
          },
          {
            "name": "连城县",
            "level": "3",
            "id": 198943
          },
          {
            "name": "漳平市",
            "level": "3",
            "id": 199496
          }
        ]
      },
      {
        "name": "宁德市",
        "level": "2",
        "id": 200131,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 200149
          },
          {
            "name": "蕉城区",
            "level": "3",
            "id": 200150
          },
          {
            "name": "霞浦县",
            "level": "3",
            "id": 200677
          },
          {
            "name": "古田县",
            "level": "3",
            "id": 202030
          },
          {
            "name": "屏南县",
            "level": "3",
            "id": 202801
          },
          {
            "name": "寿宁县",
            "level": "3",
            "id": 203253
          },
          {
            "name": "周宁县",
            "level": "3",
            "id": 203968
          },
          {
            "name": "柘荣县",
            "level": "3",
            "id": 204533
          },
          {
            "name": "福安市",
            "level": "3",
            "id": 204985
          },
          {
            "name": "福鼎市",
            "level": "3",
            "id": 205936
          }
        ]
      }
    ]
  },
  {
    "name": "江西省",
    "level": "1",
    "id": 15,
    "childs": [{
        "name": "南昌市",
        "level": "2",
        "id": 162404,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 162410
          },
          {
            "name": "东湖区",
            "level": "3",
            "id": 162411
          },
          {
            "name": "西湖区",
            "level": "3",
            "id": 162945
          },
          {
            "name": "青云谱区",
            "level": "3",
            "id": 163459
          },
          {
            "name": "湾里区",
            "level": "3",
            "id": 163686
          },
          {
            "name": "青山湖区",
            "level": "3",
            "id": 167395
          },
          {
            "name": "新建区",
            "level": "3",
            "id": 168492
          },
          {
            "name": "南昌县",
            "level": "3",
            "id": 176791
          },
          {
            "name": "安义县",
            "level": "3",
            "id": 177623
          },
          {
            "name": "进贤县",
            "level": "3",
            "id": 186544
          }
        ]
      },
      {
        "name": "景德镇市",
        "level": "2",
        "id": 187571,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 187632
          },
          {
            "name": "昌江区",
            "level": "3",
            "id": 187634
          },
          {
            "name": "珠山区",
            "level": "3",
            "id": 192047
          },
          {
            "name": "浮梁县",
            "level": "3",
            "id": 193156
          },
          {
            "name": "乐平市",
            "level": "3",
            "id": 194920
          }
        ]
      },
      {
        "name": "萍乡市",
        "level": "2",
        "id": 196506,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 196566
          },
          {
            "name": "安源区",
            "level": "3",
            "id": 196567
          },
          {
            "name": "湘东区",
            "level": "3",
            "id": 199387
          },
          {
            "name": "莲花县",
            "level": "3",
            "id": 199860
          },
          {
            "name": "上栗县",
            "level": "3",
            "id": 200281
          },
          {
            "name": "芦溪县",
            "level": "3",
            "id": 210541
          }
        ]
      },
      {
        "name": "九江市",
        "level": "2",
        "id": 211050,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 211068
          },
          {
            "name": "濂溪区",
            "level": "3",
            "id": 211069
          },
          {
            "name": "浔阳区",
            "level": "3",
            "id": 211388
          },
          {
            "name": "九江县",
            "level": "3",
            "id": 211628
          },
          {
            "name": "武宁县",
            "level": "3",
            "id": 219615
          },
          {
            "name": "修水县",
            "level": "3",
            "id": 220239
          },
          {
            "name": "永修县",
            "level": "3",
            "id": 227355
          },
          {
            "name": "德安县",
            "level": "3",
            "id": 233480
          },
          {
            "name": "都昌县",
            "level": "3",
            "id": 235956
          },
          {
            "name": "湖口县",
            "level": "3",
            "id": 242545
          },
          {
            "name": "彭泽县",
            "level": "3",
            "id": 250492
          },
          {
            "name": "瑞昌市",
            "level": "3",
            "id": 251001
          },
          {
            "name": "共青城市",
            "level": "3",
            "id": 258213
          },
          {
            "name": "庐山市",
            "level": "3",
            "id": 258706
          }
        ]
      },
      {
        "name": "新余市",
        "level": "2",
        "id": 259351,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 259394
          },
          {
            "name": "渝水区",
            "level": "3",
            "id": 259396
          },
          {
            "name": "分宜县",
            "level": "3",
            "id": 261200
          }
        ]
      },
      {
        "name": "鹰潭市",
        "level": "2",
        "id": 263555,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 263611
          },
          {
            "name": "月湖区",
            "level": "3",
            "id": 263613
          },
          {
            "name": "余江县",
            "level": "3",
            "id": 264182
          },
          {
            "name": "贵溪市",
            "level": "3",
            "id": 264598
          }
        ]
      },
      {
        "name": "赣州市",
        "level": "2",
        "id": 264878,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 264879
          },
          {
            "name": "章贡区",
            "level": "3",
            "id": 264880
          },
          {
            "name": "南康区",
            "level": "3",
            "id": 265274
          },
          {
            "name": "赣县",
            "level": "3",
            "id": 270175
          },
          {
            "name": "信丰县",
            "level": "3",
            "id": 276413
          },
          {
            "name": "大余县",
            "level": "3",
            "id": 277066
          },
          {
            "name": "上犹县",
            "level": "3",
            "id": 277351
          },
          {
            "name": "崇义县",
            "level": "3",
            "id": 282142
          },
          {
            "name": "安远县",
            "level": "3",
            "id": 282535
          },
          {
            "name": "龙南县",
            "level": "3",
            "id": 285878
          },
          {
            "name": "定南县",
            "level": "3",
            "id": 286400
          },
          {
            "name": "全南县",
            "level": "3",
            "id": 290367
          },
          {
            "name": "宁都县",
            "level": "3",
            "id": 290636
          },
          {
            "name": "于都县",
            "level": "3",
            "id": 291135
          },
          {
            "name": "兴国县",
            "level": "3",
            "id": 292229
          },
          {
            "name": "会昌县",
            "level": "3",
            "id": 293459
          },
          {
            "name": "寻乌县",
            "level": "3",
            "id": 293873
          },
          {
            "name": "石城县",
            "level": "3",
            "id": 294743
          },
          {
            "name": "瑞金市",
            "level": "3",
            "id": 295354
          }
        ]
      },
      {
        "name": "吉安市",
        "level": "2",
        "id": 296415,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 296418
          },
          {
            "name": "吉州区",
            "level": "3",
            "id": 296419
          },
          {
            "name": "青原区",
            "level": "3",
            "id": 296923
          },
          {
            "name": "吉安县",
            "level": "3",
            "id": 299172
          },
          {
            "name": "吉水县",
            "level": "3",
            "id": 300790
          },
          {
            "name": "峡江县",
            "level": "3",
            "id": 302218
          },
          {
            "name": "新干县",
            "level": "3",
            "id": 308335
          },
          {
            "name": "永丰县",
            "level": "3",
            "id": 313360
          },
          {
            "name": "泰和县",
            "level": "3",
            "id": 317202
          },
          {
            "name": "遂川县",
            "level": "3",
            "id": 328009
          },
          {
            "name": "万安县",
            "level": "3",
            "id": 330033
          },
          {
            "name": "安福县",
            "level": "3",
            "id": 331029
          },
          {
            "name": "永新县",
            "level": "3",
            "id": 342493
          },
          {
            "name": "井冈山市",
            "level": "3",
            "id": 347951
          }
        ]
      },
      {
        "name": "宜春市",
        "level": "2",
        "id": 353566,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 353634
          },
          {
            "name": "袁州区",
            "level": "3",
            "id": 353642
          },
          {
            "name": "奉新县",
            "level": "3",
            "id": 360065
          },
          {
            "name": "万载县",
            "level": "3",
            "id": 361012
          },
          {
            "name": "上高县",
            "level": "3",
            "id": 361487
          },
          {
            "name": "宜丰县",
            "level": "3",
            "id": 363734
          },
          {
            "name": "靖安县",
            "level": "3",
            "id": 363999
          },
          {
            "name": "铜鼓县",
            "level": "3",
            "id": 365178
          },
          {
            "name": "丰城市",
            "level": "3",
            "id": 365636
          },
          {
            "name": "樟树市",
            "level": "3",
            "id": 387061
          },
          {
            "name": "高安市",
            "level": "3",
            "id": 393028
          }
        ]
      },
      {
        "name": "抚州市",
        "level": "2",
        "id": 399552,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 399572
          },
          {
            "name": "临川区",
            "level": "3",
            "id": 399574
          },
          {
            "name": "南城县",
            "level": "3",
            "id": 405144
          },
          {
            "name": "黎川县",
            "level": "3",
            "id": 406314
          },
          {
            "name": "南丰县",
            "level": "3",
            "id": 413866
          },
          {
            "name": "崇仁县",
            "level": "3",
            "id": 414471
          },
          {
            "name": "乐安县",
            "level": "3",
            "id": 414766
          },
          {
            "name": "宜黄县",
            "level": "3",
            "id": 414975
          },
          {
            "name": "金溪县",
            "level": "3",
            "id": 420830
          },
          {
            "name": "资溪县",
            "level": "3",
            "id": 421360
          },
          {
            "name": "东乡县",
            "level": "3",
            "id": 421764
          },
          {
            "name": "广昌县",
            "level": "3",
            "id": 425442
          }
        ]
      },
      {
        "name": "上饶市",
        "level": "2",
        "id": 426271,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 426319
          },
          {
            "name": "信州区",
            "level": "3",
            "id": 426321
          },
          {
            "name": "广丰区",
            "level": "3",
            "id": 431432
          },
          {
            "name": "上饶县",
            "level": "3",
            "id": 432345
          },
          {
            "name": "玉山县",
            "level": "3",
            "id": 434005
          },
          {
            "name": "铅山县",
            "level": "3",
            "id": 435454
          },
          {
            "name": "横峰县",
            "level": "3",
            "id": 436783
          },
          {
            "name": "弋阳县",
            "level": "3",
            "id": 440574
          },
          {
            "name": "余干县",
            "level": "3",
            "id": 452131
          },
          {
            "name": "鄱阳县",
            "level": "3",
            "id": 454178
          },
          {
            "name": "万年县",
            "level": "3",
            "id": 458183
          },
          {
            "name": "婺源县",
            "level": "3",
            "id": 466710
          },
          {
            "name": "德兴市",
            "level": "3",
            "id": 467755
          }
        ]
      }
    ]
  },
  {
    "name": "山东省",
    "level": "1",
    "id": 16,
    "childs": [{
        "name": "济南市",
        "level": "2",
        "id": 200459,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 200495
          },
          {
            "name": "历下区",
            "level": "3",
            "id": 200496
          },
          {
            "name": "市中区",
            "level": "3",
            "id": 200878
          },
          {
            "name": "槐荫区",
            "level": "3",
            "id": 201427
          },
          {
            "name": "天桥区",
            "level": "3",
            "id": 207486
          },
          {
            "name": "历城区",
            "level": "3",
            "id": 212228
          },
          {
            "name": "长清区",
            "level": "3",
            "id": 213592
          },
          {
            "name": "平阴县",
            "level": "3",
            "id": 214738
          },
          {
            "name": "济阳县",
            "level": "3",
            "id": 215590
          },
          {
            "name": "商河县",
            "level": "3",
            "id": 222621
          },
          {
            "name": "章丘市",
            "level": "3",
            "id": 230738
          }
        ]
      },
      {
        "name": "青岛市",
        "level": "2",
        "id": 232138,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 232139
          },
          {
            "name": "市南区",
            "level": "3",
            "id": 232140
          },
          {
            "name": "市北区",
            "level": "3",
            "id": 232216
          },
          {
            "name": "黄岛区",
            "level": "3",
            "id": 239790
          },
          {
            "name": "崂山区",
            "level": "3",
            "id": 244604
          },
          {
            "name": "李沧区",
            "level": "3",
            "id": 244770
          },
          {
            "name": "城阳区",
            "level": "3",
            "id": 248259
          },
          {
            "name": "胶州市",
            "level": "3",
            "id": 248608
          },
          {
            "name": "即墨市",
            "level": "3",
            "id": 249784
          },
          {
            "name": "平度市",
            "level": "3",
            "id": 256349
          },
          {
            "name": "莱西市",
            "level": "3",
            "id": 259287
          }
        ]
      },
      {
        "name": "淄博市",
        "level": "2",
        "id": 261187,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 261222
          },
          {
            "name": "淄川区",
            "level": "3",
            "id": 261225
          },
          {
            "name": "张店区",
            "level": "3",
            "id": 266461
          },
          {
            "name": "博山区",
            "level": "3",
            "id": 267123
          },
          {
            "name": "临淄区",
            "level": "3",
            "id": 267991
          },
          {
            "name": "周村区",
            "level": "3",
            "id": 271960
          },
          {
            "name": "桓台县",
            "level": "3",
            "id": 272892
          },
          {
            "name": "高青县",
            "level": "3",
            "id": 278584
          },
          {
            "name": "沂源县",
            "level": "3",
            "id": 279364
          }
        ]
      },
      {
        "name": "枣庄市",
        "level": "2",
        "id": 280067,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 280077
          },
          {
            "name": "市中区",
            "level": "3",
            "id": 280078
          },
          {
            "name": "薛城区",
            "level": "3",
            "id": 280689
          },
          {
            "name": "峄城区",
            "level": "3",
            "id": 281191
          },
          {
            "name": "台儿庄区",
            "level": "3",
            "id": 281544
          },
          {
            "name": "山亭区",
            "level": "3",
            "id": 284820
          },
          {
            "name": "滕州市",
            "level": "3",
            "id": 288392
          }
        ]
      },
      {
        "name": "东营市",
        "level": "2",
        "id": 295167,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 295187
          },
          {
            "name": "东营区",
            "level": "3",
            "id": 295188
          },
          {
            "name": "河口区",
            "level": "3",
            "id": 296061
          },
          {
            "name": "垦利区",
            "level": "3",
            "id": 296421
          },
          {
            "name": "利津县",
            "level": "3",
            "id": 297062
          },
          {
            "name": "广饶县",
            "level": "3",
            "id": 297776
          }
        ]
      },
      {
        "name": "烟台市",
        "level": "2",
        "id": 306771,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 306793
          },
          {
            "name": "芝罘区",
            "level": "3",
            "id": 306794
          },
          {
            "name": "福山区",
            "level": "3",
            "id": 314712
          },
          {
            "name": "牟平区",
            "level": "3",
            "id": 315160
          },
          {
            "name": "莱山区",
            "level": "3",
            "id": 319884
          },
          {
            "name": "长岛县",
            "level": "3",
            "id": 320177
          },
          {
            "name": "龙口市",
            "level": "3",
            "id": 320435
          },
          {
            "name": "莱阳市",
            "level": "3",
            "id": 321540
          },
          {
            "name": "莱州市",
            "level": "3",
            "id": 323255
          },
          {
            "name": "蓬莱市",
            "level": "3",
            "id": 328085
          },
          {
            "name": "招远市",
            "level": "3",
            "id": 329575
          },
          {
            "name": "栖霞市",
            "level": "3",
            "id": 331102
          },
          {
            "name": "海阳市",
            "level": "3",
            "id": 333185
          }
        ]
      },
      {
        "name": "潍坊市",
        "level": "2",
        "id": 334975,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 335021
          },
          {
            "name": "潍城区",
            "level": "3",
            "id": 335023
          },
          {
            "name": "寒亭区",
            "level": "3",
            "id": 335577
          },
          {
            "name": "坊子区",
            "level": "3",
            "id": 336139
          },
          {
            "name": "奎文区",
            "level": "3",
            "id": 337030
          },
          {
            "name": "临朐县",
            "level": "3",
            "id": 337624
          },
          {
            "name": "昌乐县",
            "level": "3",
            "id": 338341
          },
          {
            "name": "青州市",
            "level": "3",
            "id": 339095
          },
          {
            "name": "诸城市",
            "level": "3",
            "id": 341436
          },
          {
            "name": "寿光市",
            "level": "3",
            "id": 342255
          },
          {
            "name": "安丘市",
            "level": "3",
            "id": 344680
          },
          {
            "name": "高密市",
            "level": "3",
            "id": 349729
          },
          {
            "name": "昌邑市",
            "level": "3",
            "id": 351183
          }
        ]
      },
      {
        "name": "济宁市",
        "level": "2",
        "id": 352175,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 353630
          },
          {
            "name": "任城区",
            "level": "3",
            "id": 353638
          },
          {
            "name": "兖州区",
            "level": "3",
            "id": 364702
          },
          {
            "name": "微山县",
            "level": "3",
            "id": 370195
          },
          {
            "name": "鱼台县",
            "level": "3",
            "id": 371673
          },
          {
            "name": "金乡县",
            "level": "3",
            "id": 373181
          },
          {
            "name": "嘉祥县",
            "level": "3",
            "id": 374800
          },
          {
            "name": "汶上县",
            "level": "3",
            "id": 376622
          },
          {
            "name": "泗水县",
            "level": "3",
            "id": 378155
          },
          {
            "name": "梁山县",
            "level": "3",
            "id": 380395
          },
          {
            "name": "曲阜市",
            "level": "3",
            "id": 382671
          },
          {
            "name": "邹城市",
            "level": "3",
            "id": 383792
          }
        ]
      },
      {
        "name": "泰安市",
        "level": "2",
        "id": 385617,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 385640
          },
          {
            "name": "泰山区",
            "level": "3",
            "id": 385641
          },
          {
            "name": "岱岳区",
            "level": "3",
            "id": 386383
          },
          {
            "name": "宁阳县",
            "level": "3",
            "id": 393544
          },
          {
            "name": "东平县",
            "level": "3",
            "id": 395081
          },
          {
            "name": "新泰市",
            "level": "3",
            "id": 400628
          },
          {
            "name": "肥城市",
            "level": "3",
            "id": 403197
          }
        ]
      },
      {
        "name": "威海市",
        "level": "2",
        "id": 404955,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 404978
          },
          {
            "name": "环翠区",
            "level": "3",
            "id": 404979
          },
          {
            "name": "文登区",
            "level": "3",
            "id": 405686
          },
          {
            "name": "荣成市",
            "level": "3",
            "id": 407514
          },
          {
            "name": "乳山市",
            "level": "3",
            "id": 408864
          }
        ]
      },
      {
        "name": "日照市",
        "level": "2",
        "id": 410404,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 410424
          },
          {
            "name": "东港区",
            "level": "3",
            "id": 410426
          },
          {
            "name": "岚山区",
            "level": "3",
            "id": 411559
          },
          {
            "name": "五莲县",
            "level": "3",
            "id": 415605
          },
          {
            "name": "莒县",
            "level": "3",
            "id": 422859
          }
        ]
      },
      {
        "name": "莱芜市",
        "level": "2",
        "id": 424736,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 424759
          },
          {
            "name": "莱城区",
            "level": "3",
            "id": 424761
          },
          {
            "name": "钢城区",
            "level": "3",
            "id": 426511
          }
        ]
      },
      {
        "name": "临沂市",
        "level": "2",
        "id": 427105,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 427114
          },
          {
            "name": "兰山区",
            "level": "3",
            "id": 427115
          },
          {
            "name": "罗庄区",
            "level": "3",
            "id": 428282
          },
          {
            "name": "河东区",
            "level": "3",
            "id": 428804
          },
          {
            "name": "沂南县",
            "level": "3",
            "id": 429309
          },
          {
            "name": "郯城县",
            "level": "3",
            "id": 435269
          },
          {
            "name": "沂水县",
            "level": "3",
            "id": 448111
          },
          {
            "name": "兰陵县",
            "level": "3",
            "id": 453500
          },
          {
            "name": "费县",
            "level": "3",
            "id": 456811
          },
          {
            "name": "平邑县",
            "level": "3",
            "id": 458903
          },
          {
            "name": "莒南县",
            "level": "3",
            "id": 461904
          },
          {
            "name": "蒙阴县",
            "level": "3",
            "id": 462610
          },
          {
            "name": "临沭县",
            "level": "3",
            "id": 463177
          }
        ]
      },
      {
        "name": "德州市",
        "level": "2",
        "id": 463553,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 463580
          },
          {
            "name": "德城区",
            "level": "3",
            "id": 463581
          },
          {
            "name": "陵城区",
            "level": "3",
            "id": 463908
          },
          {
            "name": "宁津县",
            "level": "3",
            "id": 465498
          },
          {
            "name": "庆云县",
            "level": "3",
            "id": 466965
          },
          {
            "name": "临邑县",
            "level": "3",
            "id": 467797
          },
          {
            "name": "齐河县",
            "level": "3",
            "id": 470498
          },
          {
            "name": "平原县",
            "level": "3",
            "id": 472208
          },
          {
            "name": "夏津县",
            "level": "3",
            "id": 476646
          },
          {
            "name": "武城县",
            "level": "3",
            "id": 477092
          },
          {
            "name": "乐陵市",
            "level": "3",
            "id": 477577
          },
          {
            "name": "禹城市",
            "level": "3",
            "id": 479054
          }
        ]
      },
      {
        "name": "聊城市",
        "level": "2",
        "id": 483436,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 483476
          },
          {
            "name": "东昌府区",
            "level": "3",
            "id": 483479
          },
          {
            "name": "阳谷县",
            "level": "3",
            "id": 485955
          },
          {
            "name": "莘县",
            "level": "3",
            "id": 489280
          },
          {
            "name": "茌平县",
            "level": "3",
            "id": 491836
          },
          {
            "name": "东阿县",
            "level": "3",
            "id": 496874
          },
          {
            "name": "冠县",
            "level": "3",
            "id": 497693
          },
          {
            "name": "高唐县",
            "level": "3",
            "id": 499127
          },
          {
            "name": "临清市",
            "level": "3",
            "id": 503926
          }
        ]
      },
      {
        "name": "滨州市",
        "level": "2",
        "id": 504839,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 504850
          },
          {
            "name": "滨城区",
            "level": "3",
            "id": 504852
          },
          {
            "name": "沾化区",
            "level": "3",
            "id": 507019
          },
          {
            "name": "惠民县",
            "level": "3",
            "id": 515124
          },
          {
            "name": "阳信县",
            "level": "3",
            "id": 516619
          },
          {
            "name": "无棣县",
            "level": "3",
            "id": 518122
          },
          {
            "name": "博兴县",
            "level": "3",
            "id": 519690
          },
          {
            "name": "邹平县",
            "level": "3",
            "id": 520965
          }
        ]
      },
      {
        "name": "菏泽市",
        "level": "2",
        "id": 522758,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 522779
          },
          {
            "name": "牡丹区",
            "level": "3",
            "id": 522780
          },
          {
            "name": "定陶区",
            "level": "3",
            "id": 526504
          },
          {
            "name": "曹县",
            "level": "3",
            "id": 527071
          },
          {
            "name": "单县",
            "level": "3",
            "id": 534604
          },
          {
            "name": "成武县",
            "level": "3",
            "id": 536553
          },
          {
            "name": "巨野县",
            "level": "3",
            "id": 542412
          },
          {
            "name": "郓城县",
            "level": "3",
            "id": 545194
          },
          {
            "name": "鄄城县",
            "level": "3",
            "id": 548004
          },
          {
            "name": "东明县",
            "level": "3",
            "id": 551869
          }
        ]
      }
    ]
  },
  {
    "name": "河南省",
    "level": "1",
    "id": 18,
    "childs": [{
        "name": "郑州市",
        "level": "2",
        "id": 206685,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 206688
          },
          {
            "name": "中原区",
            "level": "3",
            "id": 206689
          },
          {
            "name": "二七区",
            "level": "3",
            "id": 218206
          },
          {
            "name": "管城回族区",
            "level": "3",
            "id": 218939
          },
          {
            "name": "金水区",
            "level": "3",
            "id": 219593
          },
          {
            "name": "上街区",
            "level": "3",
            "id": 232342
          },
          {
            "name": "惠济区",
            "level": "3",
            "id": 232408
          },
          {
            "name": "中牟县",
            "level": "3",
            "id": 232482
          },
          {
            "name": "巩义市",
            "level": "3",
            "id": 232826
          },
          {
            "name": "荥阳市",
            "level": "3",
            "id": 235618
          },
          {
            "name": "新密市",
            "level": "3",
            "id": 236523
          },
          {
            "name": "新郑市",
            "level": "3",
            "id": 237676
          },
          {
            "name": "登封市",
            "level": "3",
            "id": 238686
          }
        ]
      },
      {
        "name": "开封市",
        "level": "2",
        "id": 239581,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 239582
          },
          {
            "name": "龙亭区",
            "level": "3",
            "id": 239584
          },
          {
            "name": "顺河回族区",
            "level": "3",
            "id": 239691
          },
          {
            "name": "鼓楼区",
            "level": "3",
            "id": 246383
          },
          {
            "name": "禹王台区",
            "level": "3",
            "id": 246663
          },
          {
            "name": "金明区",
            "level": "3",
            "id": 246854
          },
          {
            "name": "祥符区",
            "level": "3",
            "id": 247067
          },
          {
            "name": "杞县",
            "level": "3",
            "id": 261237
          },
          {
            "name": "通许县",
            "level": "3",
            "id": 262617
          },
          {
            "name": "尉氏县",
            "level": "3",
            "id": 267391
          },
          {
            "name": "兰考县",
            "level": "3",
            "id": 277836
          }
        ]
      },
      {
        "name": "洛阳市",
        "level": "2",
        "id": 285648,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 285684
          },
          {
            "name": "老城区",
            "level": "3",
            "id": 285686
          },
          {
            "name": "西工区",
            "level": "3",
            "id": 286071
          },
          {
            "name": "�e河回族区",
            "level": "3",
            "id": 286335
          },
          {
            "name": "涧西区",
            "level": "3",
            "id": 293940
          },
          {
            "name": "吉利区",
            "level": "3",
            "id": 294591
          },
          {
            "name": "洛龙区",
            "level": "3",
            "id": 294808
          },
          {
            "name": "孟津县",
            "level": "3",
            "id": 304023
          },
          {
            "name": "新安县",
            "level": "3",
            "id": 304587
          },
          {
            "name": "栾川县",
            "level": "3",
            "id": 305338
          },
          {
            "name": "嵩县",
            "level": "3",
            "id": 306121
          },
          {
            "name": "汝阳县",
            "level": "3",
            "id": 306808
          },
          {
            "name": "宜阳县",
            "level": "3",
            "id": 307365
          },
          {
            "name": "洛宁县",
            "level": "3",
            "id": 311931
          },
          {
            "name": "伊川县",
            "level": "3",
            "id": 326273
          },
          {
            "name": "偃师市",
            "level": "3",
            "id": 334053
          }
        ]
      },
      {
        "name": "平顶山市",
        "level": "2",
        "id": 335128,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 335164
          },
          {
            "name": "新华区",
            "level": "3",
            "id": 335165
          },
          {
            "name": "卫东区",
            "level": "3",
            "id": 345929
          },
          {
            "name": "石龙区",
            "level": "3",
            "id": 346000
          },
          {
            "name": "湛河区",
            "level": "3",
            "id": 346019
          },
          {
            "name": "宝丰县",
            "level": "3",
            "id": 346130
          },
          {
            "name": "叶县",
            "level": "3",
            "id": 352071
          },
          {
            "name": "鲁山县",
            "level": "3",
            "id": 355308
          },
          {
            "name": "郏县",
            "level": "3",
            "id": 358220
          },
          {
            "name": "舞钢市",
            "level": "3",
            "id": 359381
          },
          {
            "name": "汝州市",
            "level": "3",
            "id": 359916
          }
        ]
      },
      {
        "name": "安阳市",
        "level": "2",
        "id": 360944,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 360955
          },
          {
            "name": "文峰区",
            "level": "3",
            "id": 360956
          },
          {
            "name": "北关区",
            "level": "3",
            "id": 361428
          },
          {
            "name": "殷都区",
            "level": "3",
            "id": 366886
          },
          {
            "name": "龙安区",
            "level": "3",
            "id": 376538
          },
          {
            "name": "安阳县",
            "level": "3",
            "id": 377205
          },
          {
            "name": "汤阴县",
            "level": "3",
            "id": 379615
          },
          {
            "name": "滑县",
            "level": "3",
            "id": 381117
          },
          {
            "name": "内黄县",
            "level": "3",
            "id": 383935
          },
          {
            "name": "林州市",
            "level": "3",
            "id": 390182
          }
        ]
      },
      {
        "name": "鹤壁市",
        "level": "2",
        "id": 391696,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 397651
          },
          {
            "name": "鹤山区",
            "level": "3",
            "id": 397653
          },
          {
            "name": "山城区",
            "level": "3",
            "id": 397872
          },
          {
            "name": "淇滨区",
            "level": "3",
            "id": 398102
          },
          {
            "name": "浚县",
            "level": "3",
            "id": 398453
          },
          {
            "name": "淇县",
            "level": "3",
            "id": 399375
          }
        ]
      },
      {
        "name": "新乡市",
        "level": "2",
        "id": 399729,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 399741
          },
          {
            "name": "红旗区",
            "level": "3",
            "id": 399743
          },
          {
            "name": "卫滨区",
            "level": "3",
            "id": 410807
          },
          {
            "name": "凤泉区",
            "level": "3",
            "id": 411281
          },
          {
            "name": "牧野区",
            "level": "3",
            "id": 411511
          },
          {
            "name": "新乡县",
            "level": "3",
            "id": 411827
          },
          {
            "name": "获嘉县",
            "level": "3",
            "id": 412207
          },
          {
            "name": "原阳县",
            "level": "3",
            "id": 412534
          },
          {
            "name": "延津县",
            "level": "3",
            "id": 413247
          },
          {
            "name": "封丘县",
            "level": "3",
            "id": 418031
          },
          {
            "name": "长垣县",
            "level": "3",
            "id": 431348
          },
          {
            "name": "卫辉市",
            "level": "3",
            "id": 441697
          },
          {
            "name": "辉县市",
            "level": "3",
            "id": 442948
          }
        ]
      },
      {
        "name": "焦作市",
        "level": "2",
        "id": 444661,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 444690
          },
          {
            "name": "解放区",
            "level": "3",
            "id": 444691
          },
          {
            "name": "中站区",
            "level": "3",
            "id": 445097
          },
          {
            "name": "马村区",
            "level": "3",
            "id": 445384
          },
          {
            "name": "山阳区",
            "level": "3",
            "id": 445733
          },
          {
            "name": "修武县",
            "level": "3",
            "id": 446048
          },
          {
            "name": "博爱县",
            "level": "3",
            "id": 446481
          },
          {
            "name": "武陟县",
            "level": "3",
            "id": 446919
          },
          {
            "name": "温县",
            "level": "3",
            "id": 447546
          },
          {
            "name": "沁阳市",
            "level": "3",
            "id": 447827
          },
          {
            "name": "孟州市",
            "level": "3",
            "id": 450807
          }
        ]
      },
      {
        "name": "濮阳市",
        "level": "2",
        "id": 451533,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 451565
          },
          {
            "name": "华龙区",
            "level": "3",
            "id": 451567
          },
          {
            "name": "清丰县",
            "level": "3",
            "id": 452179
          },
          {
            "name": "南乐县",
            "level": "3",
            "id": 453775
          },
          {
            "name": "范县",
            "level": "3",
            "id": 455326
          },
          {
            "name": "台前县",
            "level": "3",
            "id": 457690
          },
          {
            "name": "濮阳县",
            "level": "3",
            "id": 459144
          }
        ]
      },
      {
        "name": "许昌市",
        "level": "2",
        "id": 470534,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 470536
          },
          {
            "name": "魏都区",
            "level": "3",
            "id": 470537
          },
          {
            "name": "许昌县",
            "level": "3",
            "id": 471208
          },
          {
            "name": "鄢陵县",
            "level": "3",
            "id": 472507
          },
          {
            "name": "襄城县",
            "level": "3",
            "id": 476971
          },
          {
            "name": "禹州市",
            "level": "3",
            "id": 477868
          },
          {
            "name": "长葛市",
            "level": "3",
            "id": 481990
          }
        ]
      },
      {
        "name": "漯河市",
        "level": "2",
        "id": 483512,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 483524
          },
          {
            "name": "源汇区",
            "level": "3",
            "id": 483526
          },
          {
            "name": "郾城区",
            "level": "3",
            "id": 484055
          },
          {
            "name": "召陵区",
            "level": "3",
            "id": 484854
          },
          {
            "name": "舞阳县",
            "level": "3",
            "id": 485549
          },
          {
            "name": "临颍县",
            "level": "3",
            "id": 487309
          }
        ]
      },
      {
        "name": "三门峡市",
        "level": "2",
        "id": 489326,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 489358
          },
          {
            "name": "湖滨区",
            "level": "3",
            "id": 489360
          },
          {
            "name": "陕州区",
            "level": "3",
            "id": 490025
          },
          {
            "name": "渑池县",
            "level": "3",
            "id": 490984
          },
          {
            "name": "卢氏县",
            "level": "3",
            "id": 491832
          },
          {
            "name": "义马市",
            "level": "3",
            "id": 493179
          },
          {
            "name": "灵宝市",
            "level": "3",
            "id": 497078
          }
        ]
      },
      {
        "name": "南阳市",
        "level": "2",
        "id": 498226,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 498252
          },
          {
            "name": "宛城区",
            "level": "3",
            "id": 498253
          },
          {
            "name": "卧龙区",
            "level": "3",
            "id": 499094
          },
          {
            "name": "南召县",
            "level": "3",
            "id": 500012
          },
          {
            "name": "方城县",
            "level": "3",
            "id": 504739
          },
          {
            "name": "西峡县",
            "level": "3",
            "id": 506405
          },
          {
            "name": "镇平县",
            "level": "3",
            "id": 507801
          },
          {
            "name": "内乡县",
            "level": "3",
            "id": 512279
          },
          {
            "name": "淅川县",
            "level": "3",
            "id": 515716
          },
          {
            "name": "社旗县",
            "level": "3",
            "id": 517068
          },
          {
            "name": "唐河县",
            "level": "3",
            "id": 518260
          },
          {
            "name": "新野县",
            "level": "3",
            "id": 520513
          },
          {
            "name": "桐柏县",
            "level": "3",
            "id": 521645
          },
          {
            "name": "邓州市",
            "level": "3",
            "id": 525467
          }
        ]
      },
      {
        "name": "商丘市",
        "level": "2",
        "id": 530807,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 530813
          },
          {
            "name": "梁园区",
            "level": "3",
            "id": 530815
          },
          {
            "name": "睢阳区",
            "level": "3",
            "id": 534190
          },
          {
            "name": "民权县",
            "level": "3",
            "id": 537256
          },
          {
            "name": "睢县",
            "level": "3",
            "id": 538443
          },
          {
            "name": "宁陵县",
            "level": "3",
            "id": 542907
          },
          {
            "name": "柘城县",
            "level": "3",
            "id": 544644
          },
          {
            "name": "虞城县",
            "level": "3",
            "id": 550337
          },
          {
            "name": "夏邑县",
            "level": "3",
            "id": 555730
          },
          {
            "name": "永城市",
            "level": "3",
            "id": 560042
          }
        ]
      },
      {
        "name": "信阳市",
        "level": "2",
        "id": 561400,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 561403
          },
          {
            "name": "�负忧�",
            "level": "3",
            "id": 561405
          },
          {
            "name": "平桥区",
            "level": "3",
            "id": 561980
          },
          {
            "name": "罗山县",
            "level": "3",
            "id": 566726
          },
          {
            "name": "光山县",
            "level": "3",
            "id": 567679
          },
          {
            "name": "新县",
            "level": "3",
            "id": 578968
          },
          {
            "name": "商城县",
            "level": "3",
            "id": 579492
          },
          {
            "name": "固始县",
            "level": "3",
            "id": 580364
          },
          {
            "name": "潢川县",
            "level": "3",
            "id": 581616
          },
          {
            "name": "淮滨县",
            "level": "3",
            "id": 586686
          },
          {
            "name": "息县",
            "level": "3",
            "id": 587207
          }
        ]
      },
      {
        "name": "周口市",
        "level": "2",
        "id": 593101,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 593114
          },
          {
            "name": "川汇区",
            "level": "3",
            "id": 593116
          },
          {
            "name": "扶沟县",
            "level": "3",
            "id": 596686
          },
          {
            "name": "西华县",
            "level": "3",
            "id": 597460
          },
          {
            "name": "商水县",
            "level": "3",
            "id": 605481
          },
          {
            "name": "沈丘县",
            "level": "3",
            "id": 610942
          },
          {
            "name": "郸城县",
            "level": "3",
            "id": 621792
          },
          {
            "name": "淮阳县",
            "level": "3",
            "id": 622636
          },
          {
            "name": "太康县",
            "level": "3",
            "id": 623228
          },
          {
            "name": "鹿邑县",
            "level": "3",
            "id": 625886
          },
          {
            "name": "项城市",
            "level": "3",
            "id": 630673
          }
        ]
      },
      {
        "name": "驻马店市",
        "level": "2",
        "id": 635119,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 635120
          },
          {
            "name": "驿城区",
            "level": "3",
            "id": 635121
          },
          {
            "name": "西平县",
            "level": "3",
            "id": 635352
          },
          {
            "name": "上蔡县",
            "level": "3",
            "id": 640993
          },
          {
            "name": "平舆县",
            "level": "3",
            "id": 642409
          },
          {
            "name": "正阳县",
            "level": "3",
            "id": 643119
          },
          {
            "name": "确山县",
            "level": "3",
            "id": 647270
          },
          {
            "name": "泌阳县",
            "level": "3",
            "id": 647753
          },
          {
            "name": "汝南县",
            "level": "3",
            "id": 648519
          },
          {
            "name": "遂平县",
            "level": "3",
            "id": 652795
          },
          {
            "name": "新蔡县",
            "level": "3",
            "id": 653015
          }
        ]
      },
      {
        "name": "省直辖县级行政区划",
        "level": "2",
        "id": 653399,
        "childs": [{
          "name": "济源市",
          "level": "3",
          "id": 653400
        }]
      }
    ]
  },
  {
    "name": "湖北省",
    "level": "1",
    "id": 19,
    "childs": [{
        "name": "武汉市",
        "level": "2",
        "id": 242205,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 245141
          },
          {
            "name": "江岸区",
            "level": "3",
            "id": 245143
          },
          {
            "name": "江汉区",
            "level": "3",
            "id": 245382
          },
          {
            "name": "�~口区",
            "level": "3",
            "id": 245508
          },
          {
            "name": "汉阳区",
            "level": "3",
            "id": 245656
          },
          {
            "name": "武昌区",
            "level": "3",
            "id": 251035
          },
          {
            "name": "青山区",
            "level": "3",
            "id": 257872
          },
          {
            "name": "洪山区",
            "level": "3",
            "id": 258994
          },
          {
            "name": "东西湖区",
            "level": "3",
            "id": 265830
          },
          {
            "name": "汉南区",
            "level": "3",
            "id": 265996
          },
          {
            "name": "蔡甸区",
            "level": "3",
            "id": 266168
          },
          {
            "name": "江夏区",
            "level": "3",
            "id": 267018
          },
          {
            "name": "黄陂区",
            "level": "3",
            "id": 271237
          },
          {
            "name": "新洲区",
            "level": "3",
            "id": 273180
          }
        ]
      },
      {
        "name": "黄石市",
        "level": "2",
        "id": 283483,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 283484
          },
          {
            "name": "黄石港区",
            "level": "3",
            "id": 283485
          },
          {
            "name": "西塞山区",
            "level": "3",
            "id": 283523
          },
          {
            "name": "下陆区",
            "level": "3",
            "id": 283565
          },
          {
            "name": "铁山区",
            "level": "3",
            "id": 283608
          },
          {
            "name": "阳新县",
            "level": "3",
            "id": 283624
          },
          {
            "name": "大冶市",
            "level": "3",
            "id": 286797
          }
        ]
      },
      {
        "name": "十堰市",
        "level": "2",
        "id": 291645,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 291681
          },
          {
            "name": "茅箭区",
            "level": "3",
            "id": 291682
          },
          {
            "name": "张湾区",
            "level": "3",
            "id": 291977
          },
          {
            "name": "郧阳区",
            "level": "3",
            "id": 292319
          },
          {
            "name": "郧西县",
            "level": "3",
            "id": 298691
          },
          {
            "name": "竹山县",
            "level": "3",
            "id": 299984
          },
          {
            "name": "竹溪县",
            "level": "3",
            "id": 301055
          },
          {
            "name": "房县",
            "level": "3",
            "id": 302694
          },
          {
            "name": "丹江口市",
            "level": "3",
            "id": 303854
          }
        ]
      },
      {
        "name": "宜昌市",
        "level": "2",
        "id": 309274,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 309290
          },
          {
            "name": "西陵区",
            "level": "3",
            "id": 309291
          },
          {
            "name": "伍家岗区",
            "level": "3",
            "id": 309669
          },
          {
            "name": "点军区",
            "level": "3",
            "id": 309908
          },
          {
            "name": "�V亭区",
            "level": "3",
            "id": 310094
          },
          {
            "name": "夷陵区",
            "level": "3",
            "id": 310124
          },
          {
            "name": "远安县",
            "level": "3",
            "id": 310622
          },
          {
            "name": "兴山县",
            "level": "3",
            "id": 310922
          },
          {
            "name": "秭归县",
            "level": "3",
            "id": 311235
          },
          {
            "name": "长阳土家族自治县",
            "level": "3",
            "id": 315227
          },
          {
            "name": "五峰土家族自治县",
            "level": "3",
            "id": 315769
          },
          {
            "name": "宜都市",
            "level": "3",
            "id": 315968
          },
          {
            "name": "当阳市",
            "level": "3",
            "id": 316133
          },
          {
            "name": "枝江市",
            "level": "3",
            "id": 316317
          }
        ]
      },
      {
        "name": "襄阳市",
        "level": "2",
        "id": 316620,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 316632
          },
          {
            "name": "襄城区",
            "level": "3",
            "id": 316633
          },
          {
            "name": "樊城区",
            "level": "3",
            "id": 316873
          },
          {
            "name": "襄州区",
            "level": "3",
            "id": 323465
          },
          {
            "name": "南漳县",
            "level": "3",
            "id": 324880
          },
          {
            "name": "谷城县",
            "level": "3",
            "id": 325201
          },
          {
            "name": "保康县",
            "level": "3",
            "id": 325503
          },
          {
            "name": "老河口市",
            "level": "3",
            "id": 325877
          },
          {
            "name": "枣阳市",
            "level": "3",
            "id": 331286
          },
          {
            "name": "宜城市",
            "level": "3",
            "id": 333138
          }
        ]
      },
      {
        "name": "鄂州市",
        "level": "2",
        "id": 334025,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 334068
          },
          {
            "name": "梁子湖区",
            "level": "3",
            "id": 334070
          },
          {
            "name": "华容区",
            "level": "3",
            "id": 334621
          },
          {
            "name": "鄂城区",
            "level": "3",
            "id": 335142
          }
        ]
      },
      {
        "name": "荆门市",
        "level": "2",
        "id": 335949,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 335996
          },
          {
            "name": "东宝区",
            "level": "3",
            "id": 335998
          },
          {
            "name": "掇刀区",
            "level": "3",
            "id": 336640
          },
          {
            "name": "京山县",
            "level": "3",
            "id": 337055
          },
          {
            "name": "沙洋县",
            "level": "3",
            "id": 338273
          },
          {
            "name": "钟祥市",
            "level": "3",
            "id": 339189
          }
        ]
      },
      {
        "name": "孝感市",
        "level": "2",
        "id": 341608,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 341650
          },
          {
            "name": "孝南区",
            "level": "3",
            "id": 341652
          },
          {
            "name": "孝昌县",
            "level": "3",
            "id": 343563
          },
          {
            "name": "大悟县",
            "level": "3",
            "id": 348394
          },
          {
            "name": "云梦县",
            "level": "3",
            "id": 349862
          },
          {
            "name": "应城市",
            "level": "3",
            "id": 354242
          },
          {
            "name": "安陆市",
            "level": "3",
            "id": 356807
          },
          {
            "name": "汉川市",
            "level": "3",
            "id": 362687
          }
        ]
      },
      {
        "name": "荆州市",
        "level": "2",
        "id": 363347,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 363348
          },
          {
            "name": "沙市区",
            "level": "3",
            "id": 363349
          },
          {
            "name": "荆州区",
            "level": "3",
            "id": 363477
          },
          {
            "name": "公安县",
            "level": "3",
            "id": 366316
          },
          {
            "name": "监利县",
            "level": "3",
            "id": 367026
          },
          {
            "name": "江陵县",
            "level": "3",
            "id": 368601
          },
          {
            "name": "石首市",
            "level": "3",
            "id": 368978
          },
          {
            "name": "洪湖市",
            "level": "3",
            "id": 369323
          },
          {
            "name": "松滋市",
            "level": "3",
            "id": 370138
          }
        ]
      },
      {
        "name": "黄冈市",
        "level": "2",
        "id": 371327,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 371365
          },
          {
            "name": "黄州区",
            "level": "3",
            "id": 371367
          },
          {
            "name": "团风县",
            "level": "3",
            "id": 385644
          },
          {
            "name": "红安县",
            "level": "3",
            "id": 391036
          },
          {
            "name": "罗田县",
            "level": "3",
            "id": 392589
          },
          {
            "name": "英山县",
            "level": "3",
            "id": 394340
          },
          {
            "name": "浠水县",
            "level": "3",
            "id": 395614
          },
          {
            "name": "蕲春县",
            "level": "3",
            "id": 401102
          },
          {
            "name": "黄梅县",
            "level": "3",
            "id": 403038
          },
          {
            "name": "麻城市",
            "level": "3",
            "id": 404938
          },
          {
            "name": "武穴市",
            "level": "3",
            "id": 413776
          }
        ]
      },
      {
        "name": "咸宁市",
        "level": "2",
        "id": 414367,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 414388
          },
          {
            "name": "咸安区",
            "level": "3",
            "id": 414389
          },
          {
            "name": "嘉鱼县",
            "level": "3",
            "id": 427084
          },
          {
            "name": "通城县",
            "level": "3",
            "id": 427704
          },
          {
            "name": "崇阳县",
            "level": "3",
            "id": 432565
          },
          {
            "name": "通山县",
            "level": "3",
            "id": 433655
          },
          {
            "name": "赤壁市",
            "level": "3",
            "id": 440239
          }
        ]
      },
      {
        "name": "随州市",
        "level": "2",
        "id": 448351,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 448361
          },
          {
            "name": "曾都区",
            "level": "3",
            "id": 448363
          },
          {
            "name": "随县",
            "level": "3",
            "id": 449130
          },
          {
            "name": "广水市",
            "level": "3",
            "id": 454470
          }
        ]
      },
      {
        "name": "恩施土家族苗族自治州",
        "level": "2",
        "id": 456914,
        "childs": [{
            "name": "恩施市",
            "level": "3",
            "id": 457005
          },
          {
            "name": "利川市",
            "level": "3",
            "id": 459021
          },
          {
            "name": "建始县",
            "level": "3",
            "id": 467948
          },
          {
            "name": "巴东县",
            "level": "3",
            "id": 469186
          },
          {
            "name": "宣恩县",
            "level": "3",
            "id": 473010
          },
          {
            "name": "咸丰县",
            "level": "3",
            "id": 473514
          },
          {
            "name": "来凤县",
            "level": "3",
            "id": 474134
          },
          {
            "name": "鹤峰县",
            "level": "3",
            "id": 474419
          }
        ]
      },
      {
        "name": "省直辖县级行政区划",
        "level": "2",
        "id": 474751,
        "childs": [{
            "name": "仙桃市",
            "level": "3",
            "id": 474760
          },
          {
            "name": "潜江市",
            "level": "3",
            "id": 475931
          },
          {
            "name": "天门市",
            "level": "3",
            "id": 485994
          },
          {
            "name": "神农架林区",
            "level": "3",
            "id": 489781
          }
        ]
      }
    ]
  },
  {
    "name": "湖南省",
    "level": "1",
    "id": 21,
    "childs": [{
        "name": "长沙市",
        "level": "2",
        "id": 242763,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 242769
          },
          {
            "name": "芙蓉区",
            "level": "3",
            "id": 242770
          },
          {
            "name": "天心区",
            "level": "3",
            "id": 243073
          },
          {
            "name": "岳麓区",
            "level": "3",
            "id": 243332
          },
          {
            "name": "开福区",
            "level": "3",
            "id": 243713
          },
          {
            "name": "雨花区",
            "level": "3",
            "id": 243837
          },
          {
            "name": "望城区",
            "level": "3",
            "id": 243998
          },
          {
            "name": "长沙县",
            "level": "3",
            "id": 247586
          },
          {
            "name": "宁乡县",
            "level": "3",
            "id": 248127
          },
          {
            "name": "浏阳市",
            "level": "3",
            "id": 249094
          }
        ]
      },
      {
        "name": "株洲市",
        "level": "2",
        "id": 250415,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 250424
          },
          {
            "name": "荷塘区",
            "level": "3",
            "id": 250425
          },
          {
            "name": "芦淞区",
            "level": "3",
            "id": 250557
          },
          {
            "name": "石峰区",
            "level": "3",
            "id": 250777
          },
          {
            "name": "天元区",
            "level": "3",
            "id": 250912
          },
          {
            "name": "株洲县",
            "level": "3",
            "id": 251169
          },
          {
            "name": "攸县",
            "level": "3",
            "id": 251423
          },
          {
            "name": "茶陵县",
            "level": "3",
            "id": 252208
          },
          {
            "name": "炎陵县",
            "level": "3",
            "id": 260288
          },
          {
            "name": "醴陵市",
            "level": "3",
            "id": 261324
          }
        ]
      },
      {
        "name": "湘潭市",
        "level": "2",
        "id": 270597,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 270598
          },
          {
            "name": "雨湖区",
            "level": "3",
            "id": 270599
          },
          {
            "name": "岳塘区",
            "level": "3",
            "id": 270740
          },
          {
            "name": "湘潭县",
            "level": "3",
            "id": 270902
          },
          {
            "name": "湘乡市",
            "level": "3",
            "id": 272211
          },
          {
            "name": "韶山市",
            "level": "3",
            "id": 273445
          }
        ]
      },
      {
        "name": "衡阳市",
        "level": "2",
        "id": 273563,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 273597
          },
          {
            "name": "珠晖区",
            "level": "3",
            "id": 273599
          },
          {
            "name": "雁峰区",
            "level": "3",
            "id": 273971
          },
          {
            "name": "石鼓区",
            "level": "3",
            "id": 274216
          },
          {
            "name": "蒸湘区",
            "level": "3",
            "id": 274574
          },
          {
            "name": "南岳区",
            "level": "3",
            "id": 274807
          },
          {
            "name": "衡阳县",
            "level": "3",
            "id": 274943
          },
          {
            "name": "衡南县",
            "level": "3",
            "id": 284355
          },
          {
            "name": "衡山县",
            "level": "3",
            "id": 287941
          },
          {
            "name": "衡东县",
            "level": "3",
            "id": 288455
          },
          {
            "name": "祁东县",
            "level": "3",
            "id": 288798
          },
          {
            "name": "耒阳市",
            "level": "3",
            "id": 289191
          },
          {
            "name": "常宁市",
            "level": "3",
            "id": 302443
          }
        ]
      },
      {
        "name": "邵阳市",
        "level": "2",
        "id": 303629,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 303653
          },
          {
            "name": "双清区",
            "level": "3",
            "id": 303655
          },
          {
            "name": "大祥区",
            "level": "3",
            "id": 303982
          },
          {
            "name": "北塔区",
            "level": "3",
            "id": 304567
          },
          {
            "name": "邵东县",
            "level": "3",
            "id": 304789
          },
          {
            "name": "新邵县",
            "level": "3",
            "id": 310240
          },
          {
            "name": "邵阳县",
            "level": "3",
            "id": 310953
          },
          {
            "name": "隆回县",
            "level": "3",
            "id": 311617
          },
          {
            "name": "洞口县",
            "level": "3",
            "id": 312679
          },
          {
            "name": "绥宁县",
            "level": "3",
            "id": 316648
          },
          {
            "name": "新宁县",
            "level": "3",
            "id": 322935
          },
          {
            "name": "城步苗族自治县",
            "level": "3",
            "id": 327242
          },
          {
            "name": "武冈市",
            "level": "3",
            "id": 327810
          }
        ]
      },
      {
        "name": "岳阳市",
        "level": "2",
        "id": 329257,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 329316
          },
          {
            "name": "岳阳楼区",
            "level": "3",
            "id": 329318
          },
          {
            "name": "云溪区",
            "level": "3",
            "id": 340891
          },
          {
            "name": "君山区",
            "level": "3",
            "id": 346400
          },
          {
            "name": "岳阳县",
            "level": "3",
            "id": 346714
          },
          {
            "name": "华容县",
            "level": "3",
            "id": 352693
          },
          {
            "name": "湘阴县",
            "level": "3",
            "id": 352932
          },
          {
            "name": "平江县",
            "level": "3",
            "id": 353151
          },
          {
            "name": "汨罗市",
            "level": "3",
            "id": 364670
          },
          {
            "name": "临湘市",
            "level": "3",
            "id": 373216
          }
        ]
      },
      {
        "name": "常德市",
        "level": "2",
        "id": 387191,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 387222
          },
          {
            "name": "武陵区",
            "level": "3",
            "id": 387223
          },
          {
            "name": "鼎城区",
            "level": "3",
            "id": 387903
          },
          {
            "name": "安乡县",
            "level": "3",
            "id": 388915
          },
          {
            "name": "汉寿县",
            "level": "3",
            "id": 389513
          },
          {
            "name": "澧县",
            "level": "3",
            "id": 414166
          },
          {
            "name": "临澧县",
            "level": "3",
            "id": 419903
          },
          {
            "name": "桃源县",
            "level": "3",
            "id": 420298
          },
          {
            "name": "石门县",
            "level": "3",
            "id": 429221
          },
          {
            "name": "津市市",
            "level": "3",
            "id": 435559
          }
        ]
      },
      {
        "name": "张家界市",
        "level": "2",
        "id": 436394,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 436447
          },
          {
            "name": "永定区",
            "level": "3",
            "id": 436449
          },
          {
            "name": "武陵源区",
            "level": "3",
            "id": 437382
          },
          {
            "name": "慈利县",
            "level": "3",
            "id": 437508
          },
          {
            "name": "桑植县",
            "level": "3",
            "id": 440827
          }
        ]
      },
      {
        "name": "益阳市",
        "level": "2",
        "id": 442422,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 442460
          },
          {
            "name": "资阳区",
            "level": "3",
            "id": 442466
          },
          {
            "name": "赫山区",
            "level": "3",
            "id": 443185
          },
          {
            "name": "南县",
            "level": "3",
            "id": 449770
          },
          {
            "name": "桃江县",
            "level": "3",
            "id": 454583
          },
          {
            "name": "安化县",
            "level": "3",
            "id": 456542
          },
          {
            "name": "沅江市",
            "level": "3",
            "id": 459392
          }
        ]
      },
      {
        "name": "郴州市",
        "level": "2",
        "id": 460724,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 460768
          },
          {
            "name": "北湖区",
            "level": "3",
            "id": 460770
          },
          {
            "name": "苏仙区",
            "level": "3",
            "id": 461306
          },
          {
            "name": "桂阳县",
            "level": "3",
            "id": 468833
          },
          {
            "name": "宜章县",
            "level": "3",
            "id": 479983
          },
          {
            "name": "永兴县",
            "level": "3",
            "id": 495047
          },
          {
            "name": "嘉禾县",
            "level": "3",
            "id": 496156
          },
          {
            "name": "临武县",
            "level": "3",
            "id": 501696
          },
          {
            "name": "汝城县",
            "level": "3",
            "id": 508834
          },
          {
            "name": "桂东县",
            "level": "3",
            "id": 509395
          },
          {
            "name": "安仁县",
            "level": "3",
            "id": 509980
          },
          {
            "name": "资兴市",
            "level": "3",
            "id": 510625
          }
        ]
      },
      {
        "name": "永州市",
        "level": "2",
        "id": 514057,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 514086
          },
          {
            "name": "零陵区",
            "level": "3",
            "id": 514088
          },
          {
            "name": "冷水滩区",
            "level": "3",
            "id": 514674
          },
          {
            "name": "祁阳县",
            "level": "3",
            "id": 522012
          },
          {
            "name": "东安县",
            "level": "3",
            "id": 523262
          },
          {
            "name": "双牌县",
            "level": "3",
            "id": 526786
          },
          {
            "name": "道县",
            "level": "3",
            "id": 527367
          },
          {
            "name": "江永县",
            "level": "3",
            "id": 528575
          },
          {
            "name": "宁远县",
            "level": "3",
            "id": 528886
          },
          {
            "name": "蓝山县",
            "level": "3",
            "id": 533799
          },
          {
            "name": "新田县",
            "level": "3",
            "id": 539827
          },
          {
            "name": "江华瑶族自治县",
            "level": "3",
            "id": 540225
          }
        ]
      },
      {
        "name": "怀化市",
        "level": "2",
        "id": 551760,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 551794
          },
          {
            "name": "鹤城区",
            "level": "3",
            "id": 551796
          },
          {
            "name": "中方县",
            "level": "3",
            "id": 552421
          },
          {
            "name": "沅陵县",
            "level": "3",
            "id": 552927
          },
          {
            "name": "辰溪县",
            "level": "3",
            "id": 553899
          },
          {
            "name": "溆浦县",
            "level": "3",
            "id": 554641
          },
          {
            "name": "会同县",
            "level": "3",
            "id": 558304
          },
          {
            "name": "麻阳苗族自治县",
            "level": "3",
            "id": 562435
          },
          {
            "name": "新晃侗族自治县",
            "level": "3",
            "id": 566982
          },
          {
            "name": "芷江侗族自治县",
            "level": "3",
            "id": 567538
          },
          {
            "name": "靖州苗族侗族自治县",
            "level": "3",
            "id": 568534
          },
          {
            "name": "通道侗族自治县",
            "level": "3",
            "id": 569205
          },
          {
            "name": "洪江市",
            "level": "3",
            "id": 570812
          }
        ]
      },
      {
        "name": "娄底市",
        "level": "2",
        "id": 575639,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 575678
          },
          {
            "name": "娄星区",
            "level": "3",
            "id": 575679
          },
          {
            "name": "双峰县",
            "level": "3",
            "id": 576488
          },
          {
            "name": "新化县",
            "level": "3",
            "id": 577333
          },
          {
            "name": "冷水江市",
            "level": "3",
            "id": 578616
          },
          {
            "name": "涟源市",
            "level": "3",
            "id": 584654
          }
        ]
      },
      {
        "name": "湘西土家族苗族自治州",
        "level": "2",
        "id": 589526,
        "childs": [{
            "name": "吉首市",
            "level": "3",
            "id": 589549
          },
          {
            "name": "泸溪县",
            "level": "3",
            "id": 589999
          },
          {
            "name": "凤凰县",
            "level": "3",
            "id": 590556
          },
          {
            "name": "花垣县",
            "level": "3",
            "id": 598342
          },
          {
            "name": "保靖县",
            "level": "3",
            "id": 598947
          },
          {
            "name": "古丈县",
            "level": "3",
            "id": 599356
          },
          {
            "name": "永顺县",
            "level": "3",
            "id": 599532
          },
          {
            "name": "龙山县",
            "level": "3",
            "id": 602739
          }
        ]
      }
    ]
  },
  {
    "name": "广东省",
    "level": "1",
    "id": 26,
    "childs": [{
        "name": "广州市",
        "level": "2",
        "id": 269586,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 269594
          },
          {
            "name": "荔湾区",
            "level": "3",
            "id": 269595
          },
          {
            "name": "越秀区",
            "level": "3",
            "id": 269898
          },
          {
            "name": "海珠区",
            "level": "3",
            "id": 275528
          },
          {
            "name": "天河区",
            "level": "3",
            "id": 276002
          },
          {
            "name": "白云区",
            "level": "3",
            "id": 276571
          },
          {
            "name": "黄埔区",
            "level": "3",
            "id": 281906
          },
          {
            "name": "番禺区",
            "level": "3",
            "id": 282087
          },
          {
            "name": "花都区",
            "level": "3",
            "id": 285231
          },
          {
            "name": "南沙区",
            "level": "3",
            "id": 285726
          },
          {
            "name": "从化区",
            "level": "3",
            "id": 289430
          },
          {
            "name": "增城区",
            "level": "3",
            "id": 289981
          }
        ]
      },
      {
        "name": "韶关市",
        "level": "2",
        "id": 290537,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 290546
          },
          {
            "name": "武江区",
            "level": "3",
            "id": 290548
          },
          {
            "name": "浈江区",
            "level": "3",
            "id": 295332
          },
          {
            "name": "曲江区",
            "level": "3",
            "id": 296045
          },
          {
            "name": "始兴县",
            "level": "3",
            "id": 304562
          },
          {
            "name": "仁化县",
            "level": "3",
            "id": 305077
          },
          {
            "name": "翁源县",
            "level": "3",
            "id": 305684
          },
          {
            "name": "乳源瑶族自治县",
            "level": "3",
            "id": 306215
          },
          {
            "name": "新丰县",
            "level": "3",
            "id": 306554
          },
          {
            "name": "乐昌市",
            "level": "3",
            "id": 306847
          },
          {
            "name": "南雄市",
            "level": "3",
            "id": 315045
          }
        ]
      },
      {
        "name": "深圳市",
        "level": "2",
        "id": 331651,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 331729
          },
          {
            "name": "罗湖区",
            "level": "3",
            "id": 331731
          },
          {
            "name": "福田区",
            "level": "3",
            "id": 332635
          },
          {
            "name": "南山区",
            "level": "3",
            "id": 333273
          },
          {
            "name": "宝安区",
            "level": "3",
            "id": 333826
          },
          {
            "name": "龙岗区",
            "level": "3",
            "id": 335073
          },
          {
            "name": "盐田区",
            "level": "3",
            "id": 339153
          }
        ]
      },
      {
        "name": "珠海市",
        "level": "2",
        "id": 339619,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 339658
          },
          {
            "name": "香洲区",
            "level": "3",
            "id": 339661
          },
          {
            "name": "斗门区",
            "level": "3",
            "id": 346327
          },
          {
            "name": "金湾区",
            "level": "3",
            "id": 346735
          }
        ]
      },
      {
        "name": "汕头市",
        "level": "2",
        "id": 346915,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 346919
          },
          {
            "name": "龙湖区",
            "level": "3",
            "id": 346920
          },
          {
            "name": "金平区",
            "level": "3",
            "id": 347154
          },
          {
            "name": "濠江区",
            "level": "3",
            "id": 347735
          },
          {
            "name": "潮阳区",
            "level": "3",
            "id": 347982
          },
          {
            "name": "潮南区",
            "level": "3",
            "id": 349198
          },
          {
            "name": "澄海区",
            "level": "3",
            "id": 354872
          },
          {
            "name": "南澳县",
            "level": "3",
            "id": 356343
          }
        ]
      },
      {
        "name": "佛山市",
        "level": "2",
        "id": 356696,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 356731
          },
          {
            "name": "禅城区",
            "level": "3",
            "id": 356734
          },
          {
            "name": "南海区",
            "level": "3",
            "id": 357322
          },
          {
            "name": "顺德区",
            "level": "3",
            "id": 358301
          },
          {
            "name": "三水区",
            "level": "3",
            "id": 359091
          },
          {
            "name": "高明区",
            "level": "3",
            "id": 359519
          }
        ]
      },
      {
        "name": "江门市",
        "level": "2",
        "id": 366506,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 366507
          },
          {
            "name": "蓬江区",
            "level": "3",
            "id": 366509
          },
          {
            "name": "江海区",
            "level": "3",
            "id": 366968
          },
          {
            "name": "新会区",
            "level": "3",
            "id": 367120
          },
          {
            "name": "台山市",
            "level": "3",
            "id": 367938
          },
          {
            "name": "开平市",
            "level": "3",
            "id": 368820
          },
          {
            "name": "鹤山市",
            "level": "3",
            "id": 380961
          },
          {
            "name": "恩平市",
            "level": "3",
            "id": 382198
          }
        ]
      },
      {
        "name": "湛江市",
        "level": "2",
        "id": 383247,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 383302
          },
          {
            "name": "赤坎区",
            "level": "3",
            "id": 383303
          },
          {
            "name": "霞山区",
            "level": "3",
            "id": 383814
          },
          {
            "name": "坡头区",
            "level": "3",
            "id": 384418
          },
          {
            "name": "麻章区",
            "level": "3",
            "id": 384855
          },
          {
            "name": "遂溪县",
            "level": "3",
            "id": 385624
          },
          {
            "name": "徐闻县",
            "level": "3",
            "id": 391080
          },
          {
            "name": "廉江市",
            "level": "3",
            "id": 392691
          },
          {
            "name": "雷州市",
            "level": "3",
            "id": 394793
          },
          {
            "name": "吴川市",
            "level": "3",
            "id": 400661
          }
        ]
      },
      {
        "name": "茂名市",
        "level": "2",
        "id": 401916,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 401982
          },
          {
            "name": "茂南区",
            "level": "3",
            "id": 401984
          },
          {
            "name": "电白区",
            "level": "3",
            "id": 422508
          },
          {
            "name": "高州市",
            "level": "3",
            "id": 423736
          },
          {
            "name": "化州市",
            "level": "3",
            "id": 425746
          },
          {
            "name": "信宜市",
            "level": "3",
            "id": 431652
          }
        ]
      },
      {
        "name": "肇庆市",
        "level": "2",
        "id": 433051,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 433106
          },
          {
            "name": "端州区",
            "level": "3",
            "id": 433109
          },
          {
            "name": "鼎湖区",
            "level": "3",
            "id": 433513
          },
          {
            "name": "高要区",
            "level": "3",
            "id": 439849
          },
          {
            "name": "广宁县",
            "level": "3",
            "id": 442906
          },
          {
            "name": "怀集县",
            "level": "3",
            "id": 443804
          },
          {
            "name": "封开县",
            "level": "3",
            "id": 444986
          },
          {
            "name": "德庆县",
            "level": "3",
            "id": 456690
          },
          {
            "name": "四会市",
            "level": "3",
            "id": 458291
          }
        ]
      },
      {
        "name": "惠州市",
        "level": "2",
        "id": 459840,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 459924
          },
          {
            "name": "惠城区",
            "level": "3",
            "id": 459926
          },
          {
            "name": "惠阳区",
            "level": "3",
            "id": 468283
          },
          {
            "name": "博罗县",
            "level": "3",
            "id": 468730
          },
          {
            "name": "惠东县",
            "level": "3",
            "id": 477489
          },
          {
            "name": "龙门县",
            "level": "3",
            "id": 481224
          }
        ]
      },
      {
        "name": "梅州市",
        "level": "2",
        "id": 481674,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 481700
          },
          {
            "name": "梅江区",
            "level": "3",
            "id": 481702
          },
          {
            "name": "梅县区",
            "level": "3",
            "id": 482166
          },
          {
            "name": "大埔县",
            "level": "3",
            "id": 483787
          },
          {
            "name": "丰顺县",
            "level": "3",
            "id": 485023
          },
          {
            "name": "五华县",
            "level": "3",
            "id": 486955
          },
          {
            "name": "平远县",
            "level": "3",
            "id": 494667
          },
          {
            "name": "蕉岭县",
            "level": "3",
            "id": 494823
          },
          {
            "name": "兴宁市",
            "level": "3",
            "id": 495072
          }
        ]
      },
      {
        "name": "汕尾市",
        "level": "2",
        "id": 496636,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 496651
          },
          {
            "name": "城区",
            "level": "3",
            "id": 496653
          },
          {
            "name": "海丰县",
            "level": "3",
            "id": 501895
          },
          {
            "name": "陆河县",
            "level": "3",
            "id": 502499
          },
          {
            "name": "陆丰市",
            "level": "3",
            "id": 509536
          }
        ]
      },
      {
        "name": "河源市",
        "level": "2",
        "id": 513675,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 513756
          },
          {
            "name": "源城区",
            "level": "3",
            "id": 513757
          },
          {
            "name": "紫金县",
            "level": "3",
            "id": 514145
          },
          {
            "name": "龙川县",
            "level": "3",
            "id": 524332
          },
          {
            "name": "连平县",
            "level": "3",
            "id": 531914
          },
          {
            "name": "和平县",
            "level": "3",
            "id": 532457
          },
          {
            "name": "东源县",
            "level": "3",
            "id": 533265
          }
        ]
      },
      {
        "name": "阳江市",
        "level": "2",
        "id": 534159,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 534191
          },
          {
            "name": "江城区",
            "level": "3",
            "id": 534192
          },
          {
            "name": "阳东区",
            "level": "3",
            "id": 536489
          },
          {
            "name": "阳西县",
            "level": "3",
            "id": 537544
          },
          {
            "name": "阳春市",
            "level": "3",
            "id": 538098
          }
        ]
      },
      {
        "name": "清远市",
        "level": "2",
        "id": 539333,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 539334
          },
          {
            "name": "清城区",
            "level": "3",
            "id": 539335
          },
          {
            "name": "清新区",
            "level": "3",
            "id": 539501
          },
          {
            "name": "佛冈县",
            "level": "3",
            "id": 544297
          },
          {
            "name": "阳山县",
            "level": "3",
            "id": 544952
          },
          {
            "name": "连山壮族瑶族自治县",
            "level": "3",
            "id": 546300
          },
          {
            "name": "连南瑶族自治县",
            "level": "3",
            "id": 546918
          },
          {
            "name": "英德市",
            "level": "3",
            "id": 547452
          },
          {
            "name": "连州市",
            "level": "3",
            "id": 555625
          }
        ]
      },
      {
        "name": "东莞市",
        "level": "2",
        "id": 559701,
        "childs": []
      },
      {
        "name": "中山市",
        "level": "2",
        "id": 559702,
        "childs": []
      },
      {
        "name": "潮州市",
        "level": "2",
        "id": 559703,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 559704
          },
          {
            "name": "湘桥区",
            "level": "3",
            "id": 559705
          },
          {
            "name": "潮安区",
            "level": "3",
            "id": 559993
          },
          {
            "name": "饶平县",
            "level": "3",
            "id": 565197
          }
        ]
      },
      {
        "name": "揭阳市",
        "level": "2",
        "id": 575617,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 575663
          },
          {
            "name": "榕城区",
            "level": "3",
            "id": 575665
          },
          {
            "name": "揭东区",
            "level": "3",
            "id": 576632
          },
          {
            "name": "揭西县",
            "level": "3",
            "id": 582857
          },
          {
            "name": "惠来县",
            "level": "3",
            "id": 583744
          },
          {
            "name": "普宁市",
            "level": "3",
            "id": 587997
          }
        ]
      },
      {
        "name": "云浮市",
        "level": "2",
        "id": 589603,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 589641
          },
          {
            "name": "云城区",
            "level": "3",
            "id": 589642
          },
          {
            "name": "云安区",
            "level": "3",
            "id": 589991
          },
          {
            "name": "新兴县",
            "level": "3",
            "id": 590366
          },
          {
            "name": "郁南县",
            "level": "3",
            "id": 590922
          },
          {
            "name": "罗定市",
            "level": "3",
            "id": 591212
          }
        ]
      }
    ]
  },
  {
    "name": "广西壮族自治区",
    "level": "1",
    "id": 40,
    "childs": [{
        "name": "南宁市",
        "level": "2",
        "id": 272791,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 272836
          },
          {
            "name": "兴宁区",
            "level": "3",
            "id": 272838
          },
          {
            "name": "青秀区",
            "level": "3",
            "id": 273194
          },
          {
            "name": "江南区",
            "level": "3",
            "id": 273485
          },
          {
            "name": "西乡塘区",
            "level": "3",
            "id": 273858
          },
          {
            "name": "良庆区",
            "level": "3",
            "id": 274507
          },
          {
            "name": "邕宁区",
            "level": "3",
            "id": 274857
          },
          {
            "name": "武鸣区",
            "level": "3",
            "id": 280076
          },
          {
            "name": "隆安县",
            "level": "3",
            "id": 284245
          },
          {
            "name": "马山县",
            "level": "3",
            "id": 296812
          },
          {
            "name": "上林县",
            "level": "3",
            "id": 297421
          },
          {
            "name": "宾阳县",
            "level": "3",
            "id": 299920
          },
          {
            "name": "横县",
            "level": "3",
            "id": 301002
          }
        ]
      },
      {
        "name": "柳州市",
        "level": "2",
        "id": 302384,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 302408
          },
          {
            "name": "城中区",
            "level": "3",
            "id": 302409
          },
          {
            "name": "鱼峰区",
            "level": "3",
            "id": 302590
          },
          {
            "name": "柳南区",
            "level": "3",
            "id": 302976
          },
          {
            "name": "柳北区",
            "level": "3",
            "id": 303466
          },
          {
            "name": "柳江区",
            "level": "3",
            "id": 303848
          },
          {
            "name": "柳城县",
            "level": "3",
            "id": 308964
          },
          {
            "name": "鹿寨县",
            "level": "3",
            "id": 309418
          },
          {
            "name": "融安县",
            "level": "3",
            "id": 309761
          },
          {
            "name": "融水苗族自治县",
            "level": "3",
            "id": 314463
          },
          {
            "name": "三江侗族自治县",
            "level": "3",
            "id": 318420
          }
        ]
      },
      {
        "name": "桂林市",
        "level": "2",
        "id": 325861,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 325874
          },
          {
            "name": "秀峰区",
            "level": "3",
            "id": 325875
          },
          {
            "name": "叠彩区",
            "level": "3",
            "id": 330661
          },
          {
            "name": "象山区",
            "level": "3",
            "id": 341067
          },
          {
            "name": "七星区",
            "level": "3",
            "id": 341420
          },
          {
            "name": "雁山区",
            "level": "3",
            "id": 346725
          },
          {
            "name": "临桂区",
            "level": "3",
            "id": 346891
          },
          {
            "name": "阳朔县",
            "level": "3",
            "id": 349385
          },
          {
            "name": "灵川县",
            "level": "3",
            "id": 354494
          },
          {
            "name": "全州县",
            "level": "3",
            "id": 356111
          },
          {
            "name": "兴安县",
            "level": "3",
            "id": 358352
          },
          {
            "name": "永福县",
            "level": "3",
            "id": 359068
          },
          {
            "name": "灌阳县",
            "level": "3",
            "id": 359471
          },
          {
            "name": "龙胜各族自治县",
            "level": "3",
            "id": 359854
          },
          {
            "name": "资源县",
            "level": "3",
            "id": 360217
          },
          {
            "name": "平乐县",
            "level": "3",
            "id": 360562
          },
          {
            "name": "荔浦县",
            "level": "3",
            "id": 361005
          },
          {
            "name": "恭城瑶族自治县",
            "level": "3",
            "id": 363593
          }
        ]
      },
      {
        "name": "梧州市",
        "level": "2",
        "id": 366985,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 367003
          },
          {
            "name": "万秀区",
            "level": "3",
            "id": 367004
          },
          {
            "name": "长洲区",
            "level": "3",
            "id": 367516
          },
          {
            "name": "龙圩区",
            "level": "3",
            "id": 367790
          },
          {
            "name": "苍梧县",
            "level": "3",
            "id": 368059
          },
          {
            "name": "藤县",
            "level": "3",
            "id": 378347
          },
          {
            "name": "蒙山县",
            "level": "3",
            "id": 388421
          },
          {
            "name": "岑溪市",
            "level": "3",
            "id": 388715
          }
        ]
      },
      {
        "name": "北海市",
        "level": "2",
        "id": 389473,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 389499
          },
          {
            "name": "海城区",
            "level": "3",
            "id": 389501
          },
          {
            "name": "银海区",
            "level": "3",
            "id": 389588
          },
          {
            "name": "铁山港区",
            "level": "3",
            "id": 396846
          },
          {
            "name": "合浦县",
            "level": "3",
            "id": 404250
          }
        ]
      },
      {
        "name": "防城港市",
        "level": "2",
        "id": 413209,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 413244
          },
          {
            "name": "港口区",
            "level": "3",
            "id": 413246
          },
          {
            "name": "防城区",
            "level": "3",
            "id": 417415
          },
          {
            "name": "上思县",
            "level": "3",
            "id": 418127
          },
          {
            "name": "东兴市",
            "level": "3",
            "id": 418610
          }
        ]
      },
      {
        "name": "钦州市",
        "level": "2",
        "id": 420586,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 420607
          },
          {
            "name": "钦南区",
            "level": "3",
            "id": 420608
          },
          {
            "name": "钦北区",
            "level": "3",
            "id": 421221
          },
          {
            "name": "灵山县",
            "level": "3",
            "id": 421794
          },
          {
            "name": "浦北县",
            "level": "3",
            "id": 429893
          }
        ]
      },
      {
        "name": "贵港市",
        "level": "2",
        "id": 430348,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 430357
          },
          {
            "name": "港北区",
            "level": "3",
            "id": 430359
          },
          {
            "name": "港南区",
            "level": "3",
            "id": 438013
          },
          {
            "name": "覃塘区",
            "level": "3",
            "id": 440694
          },
          {
            "name": "平南县",
            "level": "3",
            "id": 444401
          },
          {
            "name": "桂平市",
            "level": "3",
            "id": 445358
          }
        ]
      },
      {
        "name": "玉林市",
        "level": "2",
        "id": 446489,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 446491
          },
          {
            "name": "玉州区",
            "level": "3",
            "id": 446492
          },
          {
            "name": "福绵区",
            "level": "3",
            "id": 446838
          },
          {
            "name": "容县",
            "level": "3",
            "id": 447080
          },
          {
            "name": "陆川县",
            "level": "3",
            "id": 450828
          },
          {
            "name": "博白县",
            "level": "3",
            "id": 451576
          },
          {
            "name": "兴业县",
            "level": "3",
            "id": 473482
          },
          {
            "name": "北流市",
            "level": "3",
            "id": 481198
          }
        ]
      },
      {
        "name": "百色市",
        "level": "2",
        "id": 482095,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 482120
          },
          {
            "name": "右江区",
            "level": "3",
            "id": 482121
          },
          {
            "name": "田阳县",
            "level": "3",
            "id": 482883
          },
          {
            "name": "田东县",
            "level": "3",
            "id": 493823
          },
          {
            "name": "平果县",
            "level": "3",
            "id": 494049
          },
          {
            "name": "德保县",
            "level": "3",
            "id": 494245
          },
          {
            "name": "那坡县",
            "level": "3",
            "id": 500388
          },
          {
            "name": "凌云县",
            "level": "3",
            "id": 500854
          },
          {
            "name": "乐业县",
            "level": "3",
            "id": 501149
          },
          {
            "name": "田林县",
            "level": "3",
            "id": 501263
          },
          {
            "name": "西林县",
            "level": "3",
            "id": 506684
          },
          {
            "name": "隆林各族自治县",
            "level": "3",
            "id": 507368
          },
          {
            "name": "靖西市",
            "level": "3",
            "id": 508069
          }
        ]
      },
      {
        "name": "贺州市",
        "level": "2",
        "id": 508785,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 508790
          },
          {
            "name": "八步区",
            "level": "3",
            "id": 508792
          },
          {
            "name": "平桂区",
            "level": "3",
            "id": 509329
          },
          {
            "name": "昭平县",
            "level": "3",
            "id": 509785
          },
          {
            "name": "钟山县",
            "level": "3",
            "id": 510416
          },
          {
            "name": "富川瑶族自治县",
            "level": "3",
            "id": 510887
          }
        ]
      },
      {
        "name": "河池市",
        "level": "2",
        "id": 514283,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 514288
          },
          {
            "name": "金城江区",
            "level": "3",
            "id": 514291
          },
          {
            "name": "南丹县",
            "level": "3",
            "id": 520260
          },
          {
            "name": "天峨县",
            "level": "3",
            "id": 520981
          },
          {
            "name": "凤山县",
            "level": "3",
            "id": 521634
          },
          {
            "name": "东兰县",
            "level": "3",
            "id": 522248
          },
          {
            "name": "罗城仫佬族自治县",
            "level": "3",
            "id": 530247
          },
          {
            "name": "环江毛南族自治县",
            "level": "3",
            "id": 536088
          },
          {
            "name": "巴马瑶族自治县",
            "level": "3",
            "id": 537053
          },
          {
            "name": "都安瑶族自治县",
            "level": "3",
            "id": 541278
          },
          {
            "name": "大化瑶族自治县",
            "level": "3",
            "id": 541803
          },
          {
            "name": "宜州市",
            "level": "3",
            "id": 542153
          }
        ]
      },
      {
        "name": "来宾市",
        "level": "2",
        "id": 543247,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 543291
          },
          {
            "name": "兴宾区",
            "level": "3",
            "id": 543294
          },
          {
            "name": "忻城县",
            "level": "3",
            "id": 545768
          },
          {
            "name": "象州县",
            "level": "3",
            "id": 546855
          },
          {
            "name": "武宣县",
            "level": "3",
            "id": 550586
          },
          {
            "name": "金秀瑶族自治县",
            "level": "3",
            "id": 551045
          },
          {
            "name": "合山市",
            "level": "3",
            "id": 551636
          }
        ]
      },
      {
        "name": "崇左市",
        "level": "2",
        "id": 551849,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 551870
          },
          {
            "name": "江州区",
            "level": "3",
            "id": 551872
          },
          {
            "name": "扶绥县",
            "level": "3",
            "id": 556277
          },
          {
            "name": "宁明县",
            "level": "3",
            "id": 556872
          },
          {
            "name": "龙州县",
            "level": "3",
            "id": 564885
          },
          {
            "name": "大新县",
            "level": "3",
            "id": 565175
          },
          {
            "name": "天等县",
            "level": "3",
            "id": 565465
          },
          {
            "name": "凭祥市",
            "level": "3",
            "id": 565689
          }
        ]
      }
    ]
  },
  {
    "name": "海南省",
    "level": "1",
    "id": 43,
    "childs": [{
        "name": "海口市",
        "level": "2",
        "id": 307939,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 307945
          },
          {
            "name": "秀英区",
            "level": "3",
            "id": 307946
          },
          {
            "name": "龙华区",
            "level": "3",
            "id": 308111
          },
          {
            "name": "琼山区",
            "level": "3",
            "id": 308249
          },
          {
            "name": "美兰区",
            "level": "3",
            "id": 308496
          }
        ]
      },
      {
        "name": "三亚市",
        "level": "2",
        "id": 313560,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 313575
          },
          {
            "name": "海棠区",
            "level": "3",
            "id": 313673
          },
          {
            "name": "吉阳区",
            "level": "3",
            "id": 313722
          },
          {
            "name": "天涯区",
            "level": "3",
            "id": 313787
          },
          {
            "name": "崖州区",
            "level": "3",
            "id": 313861
          }
        ]
      },
      {
        "name": "三沙市",
        "level": "2",
        "id": 313913,
        "childs": [{
            "name": "西沙群岛",
            "level": "3",
            "id": 313926
          },
          {
            "name": "南沙群岛",
            "level": "3",
            "id": 313931
          },
          {
            "name": "中沙群岛的岛礁及其海域",
            "level": "3",
            "id": 313934
          }
        ]
      },
      {
        "name": "儋州市",
        "level": "2",
        "id": 313937,
        "childs": []
      },
      {
        "name": "省直辖县级行政区划",
        "level": "2",
        "id": 313938,
        "childs": [{
            "name": "五指山市",
            "level": "3",
            "id": 313939
          },
          {
            "name": "琼海市",
            "level": "3",
            "id": 314022
          },
          {
            "name": "文昌市",
            "level": "3",
            "id": 314279
          },
          {
            "name": "万宁市",
            "level": "3",
            "id": 318135
          },
          {
            "name": "东方市",
            "level": "3",
            "id": 318762
          },
          {
            "name": "定安县",
            "level": "3",
            "id": 319251
          },
          {
            "name": "屯昌县",
            "level": "3",
            "id": 319644
          },
          {
            "name": "澄迈县",
            "level": "3",
            "id": 320107
          },
          {
            "name": "临高县",
            "level": "3",
            "id": 320726
          },
          {
            "name": "白沙黎族自治县",
            "level": "3",
            "id": 321485
          },
          {
            "name": "昌江黎族自治县",
            "level": "3",
            "id": 322352
          },
          {
            "name": "乐东黎族自治县",
            "level": "3",
            "id": 323056
          },
          {
            "name": "陵水黎族自治县",
            "level": "3",
            "id": 324078
          },
          {
            "name": "保亭黎族苗族自治县",
            "level": "3",
            "id": 337338
          },
          {
            "name": "琼中黎族苗族自治县",
            "level": "3",
            "id": 338009
          }
        ]
      }
    ]
  },
  {
    "name": "重庆市",
    "level": "1",
    "id": 44,
    "childs": [{
        "name": "重庆市",
        "level": "2",
        "id": 313075,
        "childs": [{
            "name": "万州区",
            "level": "3",
            "id": 313084
          },
          {
            "name": "涪陵区",
            "level": "3",
            "id": 317620
          },
          {
            "name": "渝中区",
            "level": "3",
            "id": 319570
          },
          {
            "name": "大渡口区",
            "level": "3",
            "id": 319933
          },
          {
            "name": "江北区",
            "level": "3",
            "id": 320316
          },
          {
            "name": "沙坪坝区",
            "level": "3",
            "id": 320945
          },
          {
            "name": "九龙坡区",
            "level": "3",
            "id": 322226
          },
          {
            "name": "南岸区",
            "level": "3",
            "id": 327005
          },
          {
            "name": "北碚区",
            "level": "3",
            "id": 327464
          },
          {
            "name": "綦江区",
            "level": "3",
            "id": 328349
          },
          {
            "name": "大足区",
            "level": "3",
            "id": 346272
          },
          {
            "name": "渝北区",
            "level": "3",
            "id": 347075
          },
          {
            "name": "巴南区",
            "level": "3",
            "id": 348179
          },
          {
            "name": "黔江区",
            "level": "3",
            "id": 354348
          },
          {
            "name": "长寿区",
            "level": "3",
            "id": 364831
          },
          {
            "name": "江津区",
            "level": "3",
            "id": 370647
          },
          {
            "name": "合川区",
            "level": "3",
            "id": 372834
          },
          {
            "name": "永川区",
            "level": "3",
            "id": 387795
          },
          {
            "name": "南川区",
            "level": "3",
            "id": 388233
          },
          {
            "name": "璧山区",
            "level": "3",
            "id": 396702
          },
          {
            "name": "铜梁区",
            "level": "3",
            "id": 406629
          },
          {
            "name": "潼南区",
            "level": "3",
            "id": 414483
          },
          {
            "name": "荣昌区",
            "level": "3",
            "id": 420251
          },
          {
            "name": "开州区",
            "level": "3",
            "id": 420669
          }
        ]
      },
      {
        "name": "县",
        "level": "2",
        "id": 422051,
        "childs": [{
            "name": "梁平县",
            "level": "3",
            "id": 422052
          },
          {
            "name": "城口县",
            "level": "3",
            "id": 430253
          },
          {
            "name": "丰都县",
            "level": "3",
            "id": 430626
          },
          {
            "name": "垫江县",
            "level": "3",
            "id": 439048
          },
          {
            "name": "武隆县",
            "level": "3",
            "id": 441705
          },
          {
            "name": "忠县",
            "level": "3",
            "id": 443146
          },
          {
            "name": "云阳县",
            "level": "3",
            "id": 444844
          },
          {
            "name": "奉节县",
            "level": "3",
            "id": 450155
          },
          {
            "name": "巫山县",
            "level": "3",
            "id": 451122
          },
          {
            "name": "巫溪县",
            "level": "3",
            "id": 452538
          },
          {
            "name": "石柱土家族自治县",
            "level": "3",
            "id": 464383
          },
          {
            "name": "秀山土家族苗族自治县",
            "level": "3",
            "id": 470034
          },
          {
            "name": "酉阳土家族苗族自治县",
            "level": "3",
            "id": 476151
          },
          {
            "name": "彭水苗族土家族自治县",
            "level": "3",
            "id": 487806
          }
        ]
      }
    ]
  },
  {
    "name": "四川省",
    "level": "1",
    "id": 45,
    "childs": [{
        "name": "成都市",
        "level": "2",
        "id": 338803,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 338861
          },
          {
            "name": "锦江区",
            "level": "3",
            "id": 338864
          },
          {
            "name": "青羊区",
            "level": "3",
            "id": 339910
          },
          {
            "name": "金牛区",
            "level": "3",
            "id": 341000
          },
          {
            "name": "武侯区",
            "level": "3",
            "id": 344970
          },
          {
            "name": "成华区",
            "level": "3",
            "id": 345772
          },
          {
            "name": "龙泉驿区",
            "level": "3",
            "id": 350193
          },
          {
            "name": "青白江区",
            "level": "3",
            "id": 353943
          },
          {
            "name": "新都区",
            "level": "3",
            "id": 355570
          },
          {
            "name": "温江区",
            "level": "3",
            "id": 357138
          },
          {
            "name": "双流区",
            "level": "3",
            "id": 358103
          },
          {
            "name": "金堂县",
            "level": "3",
            "id": 371478
          },
          {
            "name": "郫县",
            "level": "3",
            "id": 373292
          },
          {
            "name": "大邑县",
            "level": "3",
            "id": 374582
          },
          {
            "name": "蒲江县",
            "level": "3",
            "id": 375970
          },
          {
            "name": "新津县",
            "level": "3",
            "id": 376862
          },
          {
            "name": "都江堰市",
            "level": "3",
            "id": 378061
          },
          {
            "name": "彭州市",
            "level": "3",
            "id": 380046
          },
          {
            "name": "邛崃市",
            "level": "3",
            "id": 389122
          },
          {
            "name": "崇州市",
            "level": "3",
            "id": 396917
          },
          {
            "name": "简阳市",
            "level": "3",
            "id": 397196
          }
        ]
      },
      {
        "name": "自贡市",
        "level": "2",
        "id": 399049,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 399114
          },
          {
            "name": "自流井区",
            "level": "3",
            "id": 399116
          },
          {
            "name": "贡井区",
            "level": "3",
            "id": 399629
          },
          {
            "name": "大安区",
            "level": "3",
            "id": 400381
          },
          {
            "name": "沿滩区",
            "level": "3",
            "id": 401621
          },
          {
            "name": "荣县",
            "level": "3",
            "id": 402815
          },
          {
            "name": "富顺县",
            "level": "3",
            "id": 405066
          }
        ]
      },
      {
        "name": "攀枝花市",
        "level": "2",
        "id": 407037,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 407090
          },
          {
            "name": "东区",
            "level": "3",
            "id": 407091
          },
          {
            "name": "西区",
            "level": "3",
            "id": 407562
          },
          {
            "name": "仁和区",
            "level": "3",
            "id": 407831
          },
          {
            "name": "米易县",
            "level": "3",
            "id": 408349
          },
          {
            "name": "盐边县",
            "level": "3",
            "id": 408857
          }
        ]
      },
      {
        "name": "泸州市",
        "level": "2",
        "id": 409651,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 409678
          },
          {
            "name": "江阳区",
            "level": "3",
            "id": 409681
          },
          {
            "name": "纳溪区",
            "level": "3",
            "id": 412401
          },
          {
            "name": "龙马潭区",
            "level": "3",
            "id": 418494
          },
          {
            "name": "泸县",
            "level": "3",
            "id": 419266
          },
          {
            "name": "合江县",
            "level": "3",
            "id": 427803
          },
          {
            "name": "叙永县",
            "level": "3",
            "id": 433580
          },
          {
            "name": "古蔺县",
            "level": "3",
            "id": 442572
          }
        ]
      },
      {
        "name": "德阳市",
        "level": "2",
        "id": 463443,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 463466
          },
          {
            "name": "旌阳区",
            "level": "3",
            "id": 463467
          },
          {
            "name": "中江县",
            "level": "3",
            "id": 464418
          },
          {
            "name": "罗江县",
            "level": "3",
            "id": 467383
          },
          {
            "name": "广汉市",
            "level": "3",
            "id": 468043
          },
          {
            "name": "什邡市",
            "level": "3",
            "id": 471002
          },
          {
            "name": "绵竹市",
            "level": "3",
            "id": 474131
          }
        ]
      },
      {
        "name": "绵阳市",
        "level": "2",
        "id": 481871,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 481901
          },
          {
            "name": "涪城区",
            "level": "3",
            "id": 481903
          },
          {
            "name": "游仙区",
            "level": "3",
            "id": 493779
          },
          {
            "name": "安州区",
            "level": "3",
            "id": 499725
          },
          {
            "name": "三台县",
            "level": "3",
            "id": 500376
          },
          {
            "name": "盐亭县",
            "level": "3",
            "id": 513383
          },
          {
            "name": "梓潼县",
            "level": "3",
            "id": 524198
          },
          {
            "name": "北川羌族自治县",
            "level": "3",
            "id": 530028
          },
          {
            "name": "平武县",
            "level": "3",
            "id": 532661
          },
          {
            "name": "江油市",
            "level": "3",
            "id": 535613
          }
        ]
      },
      {
        "name": "广元市",
        "level": "2",
        "id": 540410,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 540412
          },
          {
            "name": "利州区",
            "level": "3",
            "id": 540413
          },
          {
            "name": "昭化区",
            "level": "3",
            "id": 540689
          },
          {
            "name": "朝天区",
            "level": "3",
            "id": 549216
          },
          {
            "name": "旺苍县",
            "level": "3",
            "id": 549560
          },
          {
            "name": "青川县",
            "level": "3",
            "id": 559384
          },
          {
            "name": "剑阁县",
            "level": "3",
            "id": 573166
          },
          {
            "name": "苍溪县",
            "level": "3",
            "id": 574932
          }
        ]
      },
      {
        "name": "遂宁市",
        "level": "2",
        "id": 582761,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 582785
          },
          {
            "name": "船山区",
            "level": "3",
            "id": 582788
          },
          {
            "name": "安居区",
            "level": "3",
            "id": 583833
          },
          {
            "name": "蓬溪县",
            "level": "3",
            "id": 594434
          },
          {
            "name": "射洪县",
            "level": "3",
            "id": 595425
          },
          {
            "name": "大英县",
            "level": "3",
            "id": 607018
          }
        ]
      },
      {
        "name": "内江市",
        "level": "2",
        "id": 608006,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 608034
          },
          {
            "name": "市中区",
            "level": "3",
            "id": 608035
          },
          {
            "name": "东兴区",
            "level": "3",
            "id": 611856
          },
          {
            "name": "威远县",
            "level": "3",
            "id": 612866
          },
          {
            "name": "资中县",
            "level": "3",
            "id": 613784
          },
          {
            "name": "隆昌县",
            "level": "3",
            "id": 617287
          }
        ]
      },
      {
        "name": "乐山市",
        "level": "2",
        "id": 618295,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 618326
          },
          {
            "name": "市中区",
            "level": "3",
            "id": 618328
          },
          {
            "name": "沙湾区",
            "level": "3",
            "id": 619295
          },
          {
            "name": "五通桥区",
            "level": "3",
            "id": 620929
          },
          {
            "name": "金口河区",
            "level": "3",
            "id": 624690
          },
          {
            "name": "犍为县",
            "level": "3",
            "id": 624957
          },
          {
            "name": "井研县",
            "level": "3",
            "id": 627262
          },
          {
            "name": "夹江县",
            "level": "3",
            "id": 628278
          },
          {
            "name": "沐川县",
            "level": "3",
            "id": 631717
          },
          {
            "name": "峨边彝族自治县",
            "level": "3",
            "id": 632213
          },
          {
            "name": "马边彝族自治县",
            "level": "3",
            "id": 635679
          },
          {
            "name": "峨眉山市",
            "level": "3",
            "id": 635874
          }
        ]
      },
      {
        "name": "南充市",
        "level": "2",
        "id": 636485,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 636491
          },
          {
            "name": "顺庆区",
            "level": "3",
            "id": 636492
          },
          {
            "name": "高坪区",
            "level": "3",
            "id": 639368
          },
          {
            "name": "嘉陵区",
            "level": "3",
            "id": 643670
          },
          {
            "name": "南部县",
            "level": "3",
            "id": 655218
          },
          {
            "name": "营山县",
            "level": "3",
            "id": 657895
          },
          {
            "name": "蓬安县",
            "level": "3",
            "id": 658791
          },
          {
            "name": "仪陇县",
            "level": "3",
            "id": 660563
          },
          {
            "name": "西充县",
            "level": "3",
            "id": 667057
          },
          {
            "name": "阆中市",
            "level": "3",
            "id": 667744
          }
        ]
      },
      {
        "name": "眉山市",
        "level": "2",
        "id": 673993,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 673994
          },
          {
            "name": "东坡区",
            "level": "3",
            "id": 673995
          },
          {
            "name": "彭山区",
            "level": "3",
            "id": 674324
          },
          {
            "name": "仁寿县",
            "level": "3",
            "id": 676016
          },
          {
            "name": "洪雅县",
            "level": "3",
            "id": 682891
          },
          {
            "name": "丹棱县",
            "level": "3",
            "id": 683066
          },
          {
            "name": "青神县",
            "level": "3",
            "id": 683152
          }
        ]
      },
      {
        "name": "宜宾市",
        "level": "2",
        "id": 683252,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 683253
          },
          {
            "name": "翠屏区",
            "level": "3",
            "id": 683254
          },
          {
            "name": "南溪区",
            "level": "3",
            "id": 683624
          },
          {
            "name": "宜宾县",
            "level": "3",
            "id": 683881
          },
          {
            "name": "江安县",
            "level": "3",
            "id": 684611
          },
          {
            "name": "长宁县",
            "level": "3",
            "id": 685122
          },
          {
            "name": "高县",
            "level": "3",
            "id": 685603
          },
          {
            "name": "珙县",
            "level": "3",
            "id": 685940
          },
          {
            "name": "筠连县",
            "level": "3",
            "id": 687861
          },
          {
            "name": "兴文县",
            "level": "3",
            "id": 688622
          },
          {
            "name": "屏山县",
            "level": "3",
            "id": 688897
          }
        ]
      },
      {
        "name": "广安市",
        "level": "2",
        "id": 689245,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 689246
          },
          {
            "name": "广安区",
            "level": "3",
            "id": 689247
          },
          {
            "name": "前锋区",
            "level": "3",
            "id": 689910
          },
          {
            "name": "岳池县",
            "level": "3",
            "id": 690211
          },
          {
            "name": "武胜县",
            "level": "3",
            "id": 691135
          },
          {
            "name": "邻水县",
            "level": "3",
            "id": 691716
          },
          {
            "name": "华蓥市",
            "level": "3",
            "id": 692284
          }
        ]
      },
      {
        "name": "达州市",
        "level": "2",
        "id": 692476,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 692477
          },
          {
            "name": "通川区",
            "level": "3",
            "id": 692478
          },
          {
            "name": "达川区",
            "level": "3",
            "id": 693029
          },
          {
            "name": "宣汉县",
            "level": "3",
            "id": 694196
          },
          {
            "name": "开江县",
            "level": "3",
            "id": 694966
          },
          {
            "name": "大竹县",
            "level": "3",
            "id": 695214
          },
          {
            "name": "渠县",
            "level": "3",
            "id": 695709
          },
          {
            "name": "万源市",
            "level": "3",
            "id": 696777
          }
        ]
      },
      {
        "name": "雅安市",
        "level": "2",
        "id": 697439,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 697440
          },
          {
            "name": "雨城区",
            "level": "3",
            "id": 697441
          },
          {
            "name": "名山区",
            "level": "3",
            "id": 697672
          },
          {
            "name": "荥经县",
            "level": "3",
            "id": 697902
          },
          {
            "name": "汉源县",
            "level": "3",
            "id": 698036
          },
          {
            "name": "石棉县",
            "level": "3",
            "id": 698277
          },
          {
            "name": "天全县",
            "level": "3",
            "id": 698395
          },
          {
            "name": "芦山县",
            "level": "3",
            "id": 698555
          },
          {
            "name": "宝兴县",
            "level": "3",
            "id": 698612
          }
        ]
      },
      {
        "name": "巴中市",
        "level": "2",
        "id": 698680,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 698681
          },
          {
            "name": "巴州区",
            "level": "3",
            "id": 698682
          },
          {
            "name": "恩阳区",
            "level": "3",
            "id": 699147
          },
          {
            "name": "通江县",
            "level": "3",
            "id": 699613
          },
          {
            "name": "南江县",
            "level": "3",
            "id": 700231
          },
          {
            "name": "平昌县",
            "level": "3",
            "id": 700904
          }
        ]
      },
      {
        "name": "资阳市",
        "level": "2",
        "id": 701499,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 701500
          },
          {
            "name": "雁江区",
            "level": "3",
            "id": 701501
          },
          {
            "name": "安岳县",
            "level": "3",
            "id": 702058
          },
          {
            "name": "乐至县",
            "level": "3",
            "id": 703106
          }
        ]
      },
      {
        "name": "阿坝藏族羌族自治州",
        "level": "2",
        "id": 703765,
        "childs": [{
            "name": "马尔康市",
            "level": "3",
            "id": 703766
          },
          {
            "name": "汶川县",
            "level": "3",
            "id": 703889
          },
          {
            "name": "理县",
            "level": "3",
            "id": 704029
          },
          {
            "name": "茂县",
            "level": "3",
            "id": 704131
          },
          {
            "name": "松潘县",
            "level": "3",
            "id": 704305
          },
          {
            "name": "九寨沟县",
            "level": "3",
            "id": 704480
          },
          {
            "name": "金川县",
            "level": "3",
            "id": 704632
          },
          {
            "name": "小金县",
            "level": "3",
            "id": 704765
          },
          {
            "name": "黑水县",
            "level": "3",
            "id": 704923
          },
          {
            "name": "壤塘县",
            "level": "3",
            "id": 705068
          },
          {
            "name": "阿坝县",
            "level": "3",
            "id": 705144
          },
          {
            "name": "若尔盖县",
            "level": "3",
            "id": 705255
          },
          {
            "name": "红原县",
            "level": "3",
            "id": 705376
          }
        ]
      },
      {
        "name": "甘孜藏族自治州",
        "level": "2",
        "id": 705426,
        "childs": [{
            "name": "康定市",
            "level": "3",
            "id": 705427
          },
          {
            "name": "泸定县",
            "level": "3",
            "id": 705693
          },
          {
            "name": "丹巴县",
            "level": "3",
            "id": 705858
          },
          {
            "name": "九龙县",
            "level": "3",
            "id": 706059
          },
          {
            "name": "雅江县",
            "level": "3",
            "id": 706143
          },
          {
            "name": "道孚县",
            "level": "3",
            "id": 706275
          },
          {
            "name": "炉霍县",
            "level": "3",
            "id": 706458
          },
          {
            "name": "甘孜县",
            "level": "3",
            "id": 706650
          },
          {
            "name": "新龙县",
            "level": "3",
            "id": 706893
          },
          {
            "name": "德格县",
            "level": "3",
            "id": 707063
          },
          {
            "name": "白玉县",
            "level": "3",
            "id": 707264
          },
          {
            "name": "石渠县",
            "level": "3",
            "id": 707441
          },
          {
            "name": "色达县",
            "level": "3",
            "id": 707634
          },
          {
            "name": "理塘县",
            "level": "3",
            "id": 707790
          },
          {
            "name": "巴塘县",
            "level": "3",
            "id": 708030
          },
          {
            "name": "乡城县",
            "level": "3",
            "id": 708173
          },
          {
            "name": "稻城县",
            "level": "3",
            "id": 708278
          },
          {
            "name": "得荣县",
            "level": "3",
            "id": 708417
          }
        ]
      },
      {
        "name": "凉山彝族自治州",
        "level": "2",
        "id": 708560,
        "childs": [{
            "name": "西昌市",
            "level": "3",
            "id": 708561
          },
          {
            "name": "木里藏族自治县",
            "level": "3",
            "id": 708875
          },
          {
            "name": "盐源县",
            "level": "3",
            "id": 709028
          },
          {
            "name": "德昌县",
            "level": "3",
            "id": 709316
          },
          {
            "name": "会理县",
            "level": "3",
            "id": 709480
          },
          {
            "name": "会东县",
            "level": "3",
            "id": 709839
          },
          {
            "name": "宁南县",
            "level": "3",
            "id": 710185
          },
          {
            "name": "普格县",
            "level": "3",
            "id": 710345
          },
          {
            "name": "布拖县",
            "level": "3",
            "id": 710541
          },
          {
            "name": "金阳县",
            "level": "3",
            "id": 710764
          },
          {
            "name": "昭觉县",
            "level": "3",
            "id": 710977
          },
          {
            "name": "喜德县",
            "level": "3",
            "id": 711297
          },
          {
            "name": "冕宁县",
            "level": "3",
            "id": 711495
          },
          {
            "name": "越西县",
            "level": "3",
            "id": 711766
          },
          {
            "name": "甘洛县",
            "level": "3",
            "id": 712102
          },
          {
            "name": "美姑县",
            "level": "3",
            "id": 712361
          },
          {
            "name": "雷波县",
            "level": "3",
            "id": 712693
          }
        ]
      }
    ]
  },
  {
    "name": "贵州省",
    "level": "1",
    "id": 54,
    "childs": [{
        "name": "贵阳市",
        "level": "2",
        "id": 439452,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 439474
          },
          {
            "name": "南明区",
            "level": "3",
            "id": 439476
          },
          {
            "name": "云岩区",
            "level": "3",
            "id": 441791
          },
          {
            "name": "花溪区",
            "level": "3",
            "id": 450819
          },
          {
            "name": "乌当区",
            "level": "3",
            "id": 472898
          },
          {
            "name": "白云区",
            "level": "3",
            "id": 473372
          },
          {
            "name": "观山湖区",
            "level": "3",
            "id": 473834
          },
          {
            "name": "开阳县",
            "level": "3",
            "id": 474303
          },
          {
            "name": "息烽县",
            "level": "3",
            "id": 474768
          },
          {
            "name": "修文县",
            "level": "3",
            "id": 475282
          },
          {
            "name": "清镇市",
            "level": "3",
            "id": 479110
          }
        ]
      },
      {
        "name": "六盘水市",
        "level": "2",
        "id": 479351,
        "childs": [{
            "name": "钟山区",
            "level": "3",
            "id": 479352
          },
          {
            "name": "六枝特区",
            "level": "3",
            "id": 486002
          },
          {
            "name": "水城县",
            "level": "3",
            "id": 488142
          },
          {
            "name": "盘县",
            "level": "3",
            "id": 490305
          }
        ]
      },
      {
        "name": "遵义市",
        "level": "2",
        "id": 496597,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 496605
          },
          {
            "name": "红花岗区",
            "level": "3",
            "id": 496608
          },
          {
            "name": "汇川区",
            "level": "3",
            "id": 502215
          },
          {
            "name": "播州区",
            "level": "3",
            "id": 509382
          },
          {
            "name": "桐梓县",
            "level": "3",
            "id": 510404
          },
          {
            "name": "绥阳县",
            "level": "3",
            "id": 518964
          },
          {
            "name": "正安县",
            "level": "3",
            "id": 528968
          },
          {
            "name": "道真仡佬族苗族自治县",
            "level": "3",
            "id": 535285
          },
          {
            "name": "务川仡佬族苗族自治县",
            "level": "3",
            "id": 541891
          },
          {
            "name": "凤冈县",
            "level": "3",
            "id": 542474
          },
          {
            "name": "湄潭县",
            "level": "3",
            "id": 543429
          },
          {
            "name": "余庆县",
            "level": "3",
            "id": 544923
          },
          {
            "name": "习水县",
            "level": "3",
            "id": 546058
          },
          {
            "name": "赤水市",
            "level": "3",
            "id": 547883
          },
          {
            "name": "仁怀市",
            "level": "3",
            "id": 548451
          }
        ]
      },
      {
        "name": "安顺市",
        "level": "2",
        "id": 548758,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 548759
          },
          {
            "name": "西秀区",
            "level": "3",
            "id": 548760
          },
          {
            "name": "平坝区",
            "level": "3",
            "id": 549168
          },
          {
            "name": "普定县",
            "level": "3",
            "id": 554059
          },
          {
            "name": "镇宁布依族苗族自治县",
            "level": "3",
            "id": 554519
          },
          {
            "name": "关岭布依族苗族自治县",
            "level": "3",
            "id": 557664
          },
          {
            "name": "紫云苗族布依族自治县",
            "level": "3",
            "id": 558274
          }
        ]
      },
      {
        "name": "毕节市",
        "level": "2",
        "id": 558844,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 558854
          },
          {
            "name": "七星关区",
            "level": "3",
            "id": 558856
          },
          {
            "name": "大方县",
            "level": "3",
            "id": 570165
          },
          {
            "name": "黔西县",
            "level": "3",
            "id": 571100
          },
          {
            "name": "金沙县",
            "level": "3",
            "id": 571785
          },
          {
            "name": "织金县",
            "level": "3",
            "id": 577570
          },
          {
            "name": "纳雍县",
            "level": "3",
            "id": 578770
          },
          {
            "name": "威宁彝族回族苗族自治县",
            "level": "3",
            "id": 579664
          },
          {
            "name": "赫章县",
            "level": "3",
            "id": 581356
          }
        ]
      },
      {
        "name": "铜仁市",
        "level": "2",
        "id": 591659,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 591677
          },
          {
            "name": "碧江区",
            "level": "3",
            "id": 591678
          },
          {
            "name": "万山区",
            "level": "3",
            "id": 591925
          },
          {
            "name": "江口县",
            "level": "3",
            "id": 592156
          },
          {
            "name": "玉屏侗族自治县",
            "level": "3",
            "id": 592479
          },
          {
            "name": "石阡县",
            "level": "3",
            "id": 592734
          },
          {
            "name": "思南县",
            "level": "3",
            "id": 593842
          },
          {
            "name": "印江土家族苗族自治县",
            "level": "3",
            "id": 597729
          },
          {
            "name": "德江县",
            "level": "3",
            "id": 605618
          },
          {
            "name": "沿河土家族自治县",
            "level": "3",
            "id": 619577
          },
          {
            "name": "松桃苗族自治县",
            "level": "3",
            "id": 620431
          }
        ]
      },
      {
        "name": "黔西南布依族苗族自治州",
        "level": "2",
        "id": 624127,
        "childs": [{
            "name": "兴义市",
            "level": "3",
            "id": 624130
          },
          {
            "name": "兴仁县",
            "level": "3",
            "id": 624968
          },
          {
            "name": "普安县",
            "level": "3",
            "id": 625301
          },
          {
            "name": "晴隆县",
            "level": "3",
            "id": 627172
          },
          {
            "name": "贞丰县",
            "level": "3",
            "id": 627676
          },
          {
            "name": "望谟县",
            "level": "3",
            "id": 628247
          },
          {
            "name": "册亨县",
            "level": "3",
            "id": 628755
          },
          {
            "name": "安龙县",
            "level": "3",
            "id": 629070
          }
        ]
      },
      {
        "name": "黔东南苗族侗族自治州",
        "level": "2",
        "id": 629419,
        "childs": [{
            "name": "凯里市",
            "level": "3",
            "id": 629429
          },
          {
            "name": "黄平县",
            "level": "3",
            "id": 632807
          },
          {
            "name": "施秉县",
            "level": "3",
            "id": 633482
          },
          {
            "name": "三穗县",
            "level": "3",
            "id": 635883
          },
          {
            "name": "镇远县",
            "level": "3",
            "id": 636233
          },
          {
            "name": "岑巩县",
            "level": "3",
            "id": 636490
          },
          {
            "name": "天柱县",
            "level": "3",
            "id": 636757
          },
          {
            "name": "锦屏县",
            "level": "3",
            "id": 637428
          },
          {
            "name": "剑河县",
            "level": "3",
            "id": 637903
          },
          {
            "name": "台江县",
            "level": "3",
            "id": 641126
          },
          {
            "name": "黎平县",
            "level": "3",
            "id": 641752
          },
          {
            "name": "榕江县",
            "level": "3",
            "id": 646946
          },
          {
            "name": "从江县",
            "level": "3",
            "id": 647250
          },
          {
            "name": "雷山县",
            "level": "3",
            "id": 648001
          },
          {
            "name": "麻江县",
            "level": "3",
            "id": 648338
          },
          {
            "name": "丹寨县",
            "level": "3",
            "id": 648515
          }
        ]
      },
      {
        "name": "黔南布依族苗族自治州",
        "level": "2",
        "id": 652470,
        "childs": [{
            "name": "都匀市",
            "level": "3",
            "id": 652500
          },
          {
            "name": "福泉市",
            "level": "3",
            "id": 654528
          },
          {
            "name": "荔波县",
            "level": "3",
            "id": 654889
          },
          {
            "name": "贵定县",
            "level": "3",
            "id": 655349
          },
          {
            "name": "瓮安县",
            "level": "3",
            "id": 656306
          },
          {
            "name": "独山县",
            "level": "3",
            "id": 656652
          },
          {
            "name": "平塘县",
            "level": "3",
            "id": 656932
          },
          {
            "name": "罗甸县",
            "level": "3",
            "id": 659250
          },
          {
            "name": "长顺县",
            "level": "3",
            "id": 659920
          },
          {
            "name": "龙里县",
            "level": "3",
            "id": 662505
          },
          {
            "name": "惠水县",
            "level": "3",
            "id": 662661
          },
          {
            "name": "三都水族自治县",
            "level": "3",
            "id": 663020
          }
        ]
      }
    ]
  },
  {
    "name": "云南省",
    "level": "1",
    "id": 56,
    "childs": [{
        "name": "昆明市",
        "level": "2",
        "id": 476455,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 476456
          },
          {
            "name": "五华区",
            "level": "3",
            "id": 476457
          },
          {
            "name": "盘龙区",
            "level": "3",
            "id": 476568
          },
          {
            "name": "官渡区",
            "level": "3",
            "id": 479823
          },
          {
            "name": "西山区",
            "level": "3",
            "id": 479958
          },
          {
            "name": "东川区",
            "level": "3",
            "id": 480247
          },
          {
            "name": "呈贡区",
            "level": "3",
            "id": 480491
          },
          {
            "name": "晋宁县",
            "level": "3",
            "id": 480568
          },
          {
            "name": "富民县",
            "level": "3",
            "id": 480819
          },
          {
            "name": "宜良县",
            "level": "3",
            "id": 491989
          },
          {
            "name": "石林彝族自治县",
            "level": "3",
            "id": 492704
          },
          {
            "name": "嵩明县",
            "level": "3",
            "id": 493099
          },
          {
            "name": "禄劝彝族苗族自治县",
            "level": "3",
            "id": 493263
          },
          {
            "name": "寻甸回族彝族自治县",
            "level": "3",
            "id": 493546
          },
          {
            "name": "安宁市",
            "level": "3",
            "id": 502978
          }
        ]
      },
      {
        "name": "曲靖市",
        "level": "2",
        "id": 503171,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 503178
          },
          {
            "name": "麒麟区",
            "level": "3",
            "id": 503180
          },
          {
            "name": "沾益区",
            "level": "3",
            "id": 503719
          },
          {
            "name": "马龙县",
            "level": "3",
            "id": 504337
          },
          {
            "name": "陆良县",
            "level": "3",
            "id": 511237
          },
          {
            "name": "师宗县",
            "level": "3",
            "id": 511539
          },
          {
            "name": "罗平县",
            "level": "3",
            "id": 511793
          },
          {
            "name": "富源县",
            "level": "3",
            "id": 512076
          },
          {
            "name": "会泽县",
            "level": "3",
            "id": 523277
          },
          {
            "name": "宣威市",
            "level": "3",
            "id": 527101
          }
        ]
      },
      {
        "name": "玉溪市",
        "level": "2",
        "id": 531804,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 531834
          },
          {
            "name": "红塔区",
            "level": "3",
            "id": 531836
          },
          {
            "name": "江川区",
            "level": "3",
            "id": 534610
          },
          {
            "name": "澄江县",
            "level": "3",
            "id": 534819
          },
          {
            "name": "通海县",
            "level": "3",
            "id": 535004
          },
          {
            "name": "华宁县",
            "level": "3",
            "id": 536732
          },
          {
            "name": "易门县",
            "level": "3",
            "id": 537214
          },
          {
            "name": "峨山彝族自治县",
            "level": "3",
            "id": 537499
          },
          {
            "name": "新平彝族傣族自治县",
            "level": "3",
            "id": 537934
          },
          {
            "name": "元江哈尼族彝族傣族自治县",
            "level": "3",
            "id": 538435
          }
        ]
      },
      {
        "name": "保山市",
        "level": "2",
        "id": 542018,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 542043
          },
          {
            "name": "隆阳区",
            "level": "3",
            "id": 542044
          },
          {
            "name": "施甸县",
            "level": "3",
            "id": 561963
          },
          {
            "name": "龙陵县",
            "level": "3",
            "id": 562285
          },
          {
            "name": "昌宁县",
            "level": "3",
            "id": 562661
          },
          {
            "name": "腾冲市",
            "level": "3",
            "id": 562949
          }
        ]
      },
      {
        "name": "昭通市",
        "level": "2",
        "id": 563509,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 563532
          },
          {
            "name": "昭阳区",
            "level": "3",
            "id": 563533
          },
          {
            "name": "鲁甸县",
            "level": "3",
            "id": 569065
          },
          {
            "name": "巧家县",
            "level": "3",
            "id": 569677
          },
          {
            "name": "盐津县",
            "level": "3",
            "id": 570148
          },
          {
            "name": "大关县",
            "level": "3",
            "id": 574275
          },
          {
            "name": "永善县",
            "level": "3",
            "id": 574577
          },
          {
            "name": "绥江县",
            "level": "3",
            "id": 581234
          },
          {
            "name": "镇雄县",
            "level": "3",
            "id": 581413
          },
          {
            "name": "彝良县",
            "level": "3",
            "id": 586618
          },
          {
            "name": "威信县",
            "level": "3",
            "id": 586971
          },
          {
            "name": "水富县",
            "level": "3",
            "id": 587234
          }
        ]
      },
      {
        "name": "丽江市",
        "level": "2",
        "id": 592370,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 592398
          },
          {
            "name": "古城区",
            "level": "3",
            "id": 592399
          },
          {
            "name": "玉龙纳西族自治县",
            "level": "3",
            "id": 592744
          },
          {
            "name": "永胜县",
            "level": "3",
            "id": 593500
          },
          {
            "name": "华坪县",
            "level": "3",
            "id": 596926
          },
          {
            "name": "宁蒗彝族自治县",
            "level": "3",
            "id": 597319
          }
        ]
      },
      {
        "name": "普洱市",
        "level": "2",
        "id": 597744,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 598207
          },
          {
            "name": "思茅区",
            "level": "3",
            "id": 598209
          },
          {
            "name": "宁洱哈尼族彝族自治县",
            "level": "3",
            "id": 598440
          },
          {
            "name": "墨江哈尼族自治县",
            "level": "3",
            "id": 600982
          },
          {
            "name": "景东彝族自治县",
            "level": "3",
            "id": 611518
          },
          {
            "name": "景谷傣族彝族自治县",
            "level": "3",
            "id": 611909
          },
          {
            "name": "镇沅彝族哈尼族拉祜族自治县",
            "level": "3",
            "id": 612280
          },
          {
            "name": "江城哈尼族彝族自治县",
            "level": "3",
            "id": 612571
          },
          {
            "name": "孟连傣族拉祜族佤族自治县",
            "level": "3",
            "id": 612816
          },
          {
            "name": "澜沧拉祜族自治县",
            "level": "3",
            "id": 613054
          },
          {
            "name": "西盟佤族自治县",
            "level": "3",
            "id": 613801
          }
        ]
      },
      {
        "name": "临沧市",
        "level": "2",
        "id": 614004,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 614016
          },
          {
            "name": "临翔区",
            "level": "3",
            "id": 614018
          },
          {
            "name": "凤庆县",
            "level": "3",
            "id": 614230
          },
          {
            "name": "云县",
            "level": "3",
            "id": 616811
          },
          {
            "name": "永德县",
            "level": "3",
            "id": 617440
          },
          {
            "name": "镇康县",
            "level": "3",
            "id": 618009
          },
          {
            "name": "双江拉祜族佤族布朗族傣族自治县",
            "level": "3",
            "id": 618370
          },
          {
            "name": "耿马傣族佤族自治县",
            "level": "3",
            "id": 621395
          },
          {
            "name": "沧源佤族自治县",
            "level": "3",
            "id": 621500
          }
        ]
      },
      {
        "name": "楚雄彝族自治州",
        "level": "2",
        "id": 621767,
        "childs": [{
            "name": "楚雄市",
            "level": "3",
            "id": 621769
          },
          {
            "name": "双柏县",
            "level": "3",
            "id": 622247
          },
          {
            "name": "牟定县",
            "level": "3",
            "id": 622515
          },
          {
            "name": "南华县",
            "level": "3",
            "id": 629443
          },
          {
            "name": "姚安县",
            "level": "3",
            "id": 629722
          },
          {
            "name": "大姚县",
            "level": "3",
            "id": 629931
          },
          {
            "name": "永仁县",
            "level": "3",
            "id": 630073
          },
          {
            "name": "元谋县",
            "level": "3",
            "id": 630144
          },
          {
            "name": "武定县",
            "level": "3",
            "id": 630233
          },
          {
            "name": "禄丰县",
            "level": "3",
            "id": 630378
          }
        ]
      },
      {
        "name": "红河哈尼族彝族自治州",
        "level": "2",
        "id": 630558,
        "childs": [{
            "name": "个旧市",
            "level": "3",
            "id": 630559
          },
          {
            "name": "开远市",
            "level": "3",
            "id": 630810
          },
          {
            "name": "蒙自市",
            "level": "3",
            "id": 631155
          },
          {
            "name": "弥勒市",
            "level": "3",
            "id": 636904
          },
          {
            "name": "屏边苗族自治县",
            "level": "3",
            "id": 637437
          },
          {
            "name": "建水县",
            "level": "3",
            "id": 637730
          },
          {
            "name": "石屏县",
            "level": "3",
            "id": 640651
          },
          {
            "name": "泸西县",
            "level": "3",
            "id": 641145
          },
          {
            "name": "元阳县",
            "level": "3",
            "id": 641664
          },
          {
            "name": "红河县",
            "level": "3",
            "id": 642287
          },
          {
            "name": "金平苗族瑶族傣族自治县",
            "level": "3",
            "id": 642830
          },
          {
            "name": "绿春县",
            "level": "3",
            "id": 643234
          },
          {
            "name": "河口瑶族自治县",
            "level": "3",
            "id": 644094
          }
        ]
      },
      {
        "name": "文山壮族苗族自治州",
        "level": "2",
        "id": 644300,
        "childs": [{
            "name": "文山市",
            "level": "3",
            "id": 644314
          },
          {
            "name": "砚山县",
            "level": "3",
            "id": 644731
          },
          {
            "name": "西畴县",
            "level": "3",
            "id": 645052
          },
          {
            "name": "麻栗坡县",
            "level": "3",
            "id": 645234
          },
          {
            "name": "马关县",
            "level": "3",
            "id": 645429
          },
          {
            "name": "丘北县",
            "level": "3",
            "id": 648653
          },
          {
            "name": "广南县",
            "level": "3",
            "id": 648855
          },
          {
            "name": "富宁县",
            "level": "3",
            "id": 650260
          }
        ]
      },
      {
        "name": "西双版纳傣族自治州",
        "level": "2",
        "id": 654218,
        "childs": [{
            "name": "景洪市",
            "level": "3",
            "id": 654219
          },
          {
            "name": "勐海县",
            "level": "3",
            "id": 655936
          },
          {
            "name": "勐腊县",
            "level": "3",
            "id": 656041
          }
        ]
      },
      {
        "name": "大理白族自治州",
        "level": "2",
        "id": 657590,
        "childs": [{
            "name": "大理市",
            "level": "3",
            "id": 657604
          },
          {
            "name": "漾濞彝族自治县",
            "level": "3",
            "id": 657936
          },
          {
            "name": "祥云县",
            "level": "3",
            "id": 663212
          },
          {
            "name": "宾川县",
            "level": "3",
            "id": 666481
          },
          {
            "name": "弥渡县",
            "level": "3",
            "id": 666666
          },
          {
            "name": "南涧彝族自治县",
            "level": "3",
            "id": 669417
          },
          {
            "name": "巍山彝族回族自治县",
            "level": "3",
            "id": 669786
          },
          {
            "name": "永平县",
            "level": "3",
            "id": 670172
          },
          {
            "name": "云龙县",
            "level": "3",
            "id": 670401
          },
          {
            "name": "洱源县",
            "level": "3",
            "id": 670690
          },
          {
            "name": "剑川县",
            "level": "3",
            "id": 673628
          },
          {
            "name": "鹤庆县",
            "level": "3",
            "id": 673730
          }
        ]
      },
      {
        "name": "德宏傣族景颇族自治州",
        "level": "2",
        "id": 673857,
        "childs": [{
            "name": "瑞丽市",
            "level": "3",
            "id": 674921
          },
          {
            "name": "芒市",
            "level": "3",
            "id": 674968
          },
          {
            "name": "梁河县",
            "level": "3",
            "id": 676529
          },
          {
            "name": "盈江县",
            "level": "3",
            "id": 678702
          },
          {
            "name": "陇川县",
            "level": "3",
            "id": 678968
          }
        ]
      },
      {
        "name": "怒江傈僳族自治州",
        "level": "2",
        "id": 679159,
        "childs": [{
            "name": "泸水市",
            "level": "3",
            "id": 681103
          },
          {
            "name": "福贡县",
            "level": "3",
            "id": 681354
          },
          {
            "name": "贡山独龙族怒族自治县",
            "level": "3",
            "id": 681511
          },
          {
            "name": "兰坪白族普米族自治县",
            "level": "3",
            "id": 681574
          }
        ]
      },
      {
        "name": "迪庆藏族自治州",
        "level": "2",
        "id": 682178,
        "childs": [{
            "name": "香格里拉市",
            "level": "3",
            "id": 682191
          },
          {
            "name": "德钦县",
            "level": "3",
            "id": 682376
          },
          {
            "name": "维西傈僳族自治县",
            "level": "3",
            "id": 682489
          }
        ]
      }
    ]
  },
  {
    "name": "西藏自治区",
    "level": "1",
    "id": 57,
    "childs": [{
        "name": "拉萨市",
        "level": "2",
        "id": 490401,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 490441
          },
          {
            "name": "城关区",
            "level": "3",
            "id": 490443
          },
          {
            "name": "堆龙德庆区",
            "level": "3",
            "id": 491066
          },
          {
            "name": "林周县",
            "level": "3",
            "id": 495943
          },
          {
            "name": "当雄县",
            "level": "3",
            "id": 496562
          },
          {
            "name": "尼木县",
            "level": "3",
            "id": 501707
          },
          {
            "name": "曲水县",
            "level": "3",
            "id": 501989
          },
          {
            "name": "达孜县",
            "level": "3",
            "id": 502169
          },
          {
            "name": "墨竹工卡县",
            "level": "3",
            "id": 502348
          }
        ]
      },
      {
        "name": "日喀则市",
        "level": "2",
        "id": 502554,
        "childs": [{
            "name": "桑珠孜区",
            "level": "3",
            "id": 502562
          },
          {
            "name": "南木林县",
            "level": "3",
            "id": 502832
          },
          {
            "name": "江孜县",
            "level": "3",
            "id": 503184
          },
          {
            "name": "定日县",
            "level": "3",
            "id": 503820
          },
          {
            "name": "萨迦县",
            "level": "3",
            "id": 511121
          },
          {
            "name": "拉孜县",
            "level": "3",
            "id": 511336
          },
          {
            "name": "昂仁县",
            "level": "3",
            "id": 511572
          },
          {
            "name": "谢通门县",
            "level": "3",
            "id": 512002
          },
          {
            "name": "白朗县",
            "level": "3",
            "id": 514858
          },
          {
            "name": "仁布县",
            "level": "3",
            "id": 515038
          },
          {
            "name": "康马县",
            "level": "3",
            "id": 515121
          },
          {
            "name": "定结县",
            "level": "3",
            "id": 523965
          },
          {
            "name": "仲巴县",
            "level": "3",
            "id": 524046
          },
          {
            "name": "亚东县",
            "level": "3",
            "id": 527984
          },
          {
            "name": "吉隆县",
            "level": "3",
            "id": 528017
          },
          {
            "name": "聂拉木县",
            "level": "3",
            "id": 528065
          },
          {
            "name": "萨嘎县",
            "level": "3",
            "id": 528117
          },
          {
            "name": "岗巴县",
            "level": "3",
            "id": 528164
          }
        ]
      },
      {
        "name": "昌都市",
        "level": "2",
        "id": 528199,
        "childs": [{
            "name": "卡若区",
            "level": "3",
            "id": 528200
          },
          {
            "name": "江达县",
            "level": "3",
            "id": 528604
          },
          {
            "name": "贡觉县",
            "level": "3",
            "id": 528991
          },
          {
            "name": "类乌齐县",
            "level": "3",
            "id": 529490
          },
          {
            "name": "丁青县",
            "level": "3",
            "id": 529798
          },
          {
            "name": "察雅县",
            "level": "3",
            "id": 530111
          },
          {
            "name": "八宿县",
            "level": "3",
            "id": 532295
          },
          {
            "name": "左贡县",
            "level": "3",
            "id": 535486
          },
          {
            "name": "芒康县",
            "level": "3",
            "id": 539550
          },
          {
            "name": "洛隆县",
            "level": "3",
            "id": 545609
          },
          {
            "name": "边坝县",
            "level": "3",
            "id": 546570
          }
        ]
      },
      {
        "name": "林芝市",
        "level": "2",
        "id": 547346,
        "childs": [{
            "name": "巴宜区",
            "level": "3",
            "id": 547389
          },
          {
            "name": "工布江达县",
            "level": "3",
            "id": 547867
          },
          {
            "name": "米林县",
            "level": "3",
            "id": 548295
          },
          {
            "name": "墨脱县",
            "level": "3",
            "id": 548472
          },
          {
            "name": "波密县",
            "level": "3",
            "id": 548616
          },
          {
            "name": "察隅县",
            "level": "3",
            "id": 552528
          },
          {
            "name": "朗县",
            "level": "3",
            "id": 552845
          }
        ]
      },
      {
        "name": "山南市",
        "level": "2",
        "id": 553055,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 553085
          },
          {
            "name": "乃东区",
            "level": "3",
            "id": 553086
          },
          {
            "name": "扎囊县",
            "level": "3",
            "id": 553424
          },
          {
            "name": "贡嘎县",
            "level": "3",
            "id": 553694
          },
          {
            "name": "桑日县",
            "level": "3",
            "id": 554038
          },
          {
            "name": "琼结县",
            "level": "3",
            "id": 554229
          },
          {
            "name": "曲松县",
            "level": "3",
            "id": 554382
          },
          {
            "name": "措美县",
            "level": "3",
            "id": 554540
          },
          {
            "name": "洛扎县",
            "level": "3",
            "id": 554601
          },
          {
            "name": "加查县",
            "level": "3",
            "id": 557541
          },
          {
            "name": "隆子县",
            "level": "3",
            "id": 561691
          },
          {
            "name": "错那县",
            "level": "3",
            "id": 562021
          },
          {
            "name": "浪卡子县",
            "level": "3",
            "id": 562249
          }
        ]
      },
      {
        "name": "那曲地区",
        "level": "2",
        "id": 562587,
        "childs": [{
            "name": "那曲县",
            "level": "3",
            "id": 562597
          },
          {
            "name": "嘉黎县",
            "level": "3",
            "id": 562901
          },
          {
            "name": "比如县",
            "level": "3",
            "id": 563184
          },
          {
            "name": "聂荣县",
            "level": "3",
            "id": 563606
          },
          {
            "name": "安多县",
            "level": "3",
            "id": 563985
          },
          {
            "name": "申扎县",
            "level": "3",
            "id": 564178
          },
          {
            "name": "索县",
            "level": "3",
            "id": 564331
          },
          {
            "name": "班戈县",
            "level": "3",
            "id": 564600
          },
          {
            "name": "巴青县",
            "level": "3",
            "id": 570255
          },
          {
            "name": "尼玛县",
            "level": "3",
            "id": 574505
          },
          {
            "name": "双湖县",
            "level": "3",
            "id": 574851
          }
        ]
      },
      {
        "name": "阿里地区",
        "level": "2",
        "id": 574950,
        "childs": [{
            "name": "普兰县",
            "level": "3",
            "id": 575009
          },
          {
            "name": "札达县",
            "level": "3",
            "id": 575131
          },
          {
            "name": "噶尔县",
            "level": "3",
            "id": 575426
          },
          {
            "name": "日土县",
            "level": "3",
            "id": 575649
          },
          {
            "name": "革吉县",
            "level": "3",
            "id": 575966
          },
          {
            "name": "改则县",
            "level": "3",
            "id": 576300
          },
          {
            "name": "措勤县",
            "level": "3",
            "id": 576761
          }
        ]
      }
    ]
  },
  {
    "name": "陕西省",
    "level": "1",
    "id": 58,
    "childs": [{
        "name": "西安市",
        "level": "2",
        "id": 490696,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 490734
          },
          {
            "name": "新城区",
            "level": "3",
            "id": 490737
          },
          {
            "name": "碑林区",
            "level": "3",
            "id": 491395
          },
          {
            "name": "莲湖区",
            "level": "3",
            "id": 496433
          },
          {
            "name": "灞桥区",
            "level": "3",
            "id": 508524
          },
          {
            "name": "未央区",
            "level": "3",
            "id": 512532
          },
          {
            "name": "雁塔区",
            "level": "3",
            "id": 512980
          },
          {
            "name": "阎良区",
            "level": "3",
            "id": 513204
          },
          {
            "name": "临潼区",
            "level": "3",
            "id": 513315
          },
          {
            "name": "长安区",
            "level": "3",
            "id": 518426
          },
          {
            "name": "高陵区",
            "level": "3",
            "id": 524478
          },
          {
            "name": "蓝田县",
            "level": "3",
            "id": 524770
          },
          {
            "name": "周至县",
            "level": "3",
            "id": 525451
          },
          {
            "name": "户县",
            "level": "3",
            "id": 532868
          }
        ]
      },
      {
        "name": "铜川市",
        "level": "2",
        "id": 534100,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 534111
          },
          {
            "name": "王益区",
            "level": "3",
            "id": 534113
          },
          {
            "name": "印台区",
            "level": "3",
            "id": 535949
          },
          {
            "name": "耀州区",
            "level": "3",
            "id": 540802
          },
          {
            "name": "宜君县",
            "level": "3",
            "id": 541195
          }
        ]
      },
      {
        "name": "宝鸡市",
        "level": "2",
        "id": 541516,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 541518
          },
          {
            "name": "渭滨区",
            "level": "3",
            "id": 541521
          },
          {
            "name": "金台区",
            "level": "3",
            "id": 543681
          },
          {
            "name": "陈仓区",
            "level": "3",
            "id": 544914
          },
          {
            "name": "凤翔县",
            "level": "3",
            "id": 550176
          },
          {
            "name": "岐山县",
            "level": "3",
            "id": 550760
          },
          {
            "name": "扶风县",
            "level": "3",
            "id": 551221
          },
          {
            "name": "眉县",
            "level": "3",
            "id": 551826
          },
          {
            "name": "陇县",
            "level": "3",
            "id": 552432
          },
          {
            "name": "千阳县",
            "level": "3",
            "id": 552911
          },
          {
            "name": "麟游县",
            "level": "3",
            "id": 553225
          },
          {
            "name": "凤县",
            "level": "3",
            "id": 553516
          },
          {
            "name": "太白县",
            "level": "3",
            "id": 557190
          }
        ]
      },
      {
        "name": "咸阳市",
        "level": "2",
        "id": 557326,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 560915
          },
          {
            "name": "秦都区",
            "level": "3",
            "id": 560916
          },
          {
            "name": "杨陵区",
            "level": "3",
            "id": 561384
          },
          {
            "name": "渭城区",
            "level": "3",
            "id": 561541
          },
          {
            "name": "三原县",
            "level": "3",
            "id": 565803
          },
          {
            "name": "泾阳县",
            "level": "3",
            "id": 566020
          },
          {
            "name": "乾县",
            "level": "3",
            "id": 566435
          },
          {
            "name": "礼泉县",
            "level": "3",
            "id": 566984
          },
          {
            "name": "永寿县",
            "level": "3",
            "id": 567621
          },
          {
            "name": "彬县",
            "level": "3",
            "id": 568122
          },
          {
            "name": "长武县",
            "level": "3",
            "id": 569043
          },
          {
            "name": "旬邑县",
            "level": "3",
            "id": 569530
          },
          {
            "name": "淳化县",
            "level": "3",
            "id": 579594
          },
          {
            "name": "武功县",
            "level": "3",
            "id": 585294
          },
          {
            "name": "兴平市",
            "level": "3",
            "id": 585522
          }
        ]
      },
      {
        "name": "渭南市",
        "level": "2",
        "id": 585784,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 585785
          },
          {
            "name": "临渭区",
            "level": "3",
            "id": 585786
          },
          {
            "name": "华州区",
            "level": "3",
            "id": 593546
          },
          {
            "name": "潼关县",
            "level": "3",
            "id": 596825
          },
          {
            "name": "大荔县",
            "level": "3",
            "id": 596992
          },
          {
            "name": "合阳县",
            "level": "3",
            "id": 600025
          },
          {
            "name": "澄城县",
            "level": "3",
            "id": 601537
          },
          {
            "name": "蒲城县",
            "level": "3",
            "id": 601980
          },
          {
            "name": "白水县",
            "level": "3",
            "id": 603838
          },
          {
            "name": "富平县",
            "level": "3",
            "id": 604192
          },
          {
            "name": "韩城市",
            "level": "3",
            "id": 604859
          },
          {
            "name": "华阴市",
            "level": "3",
            "id": 605173
          }
        ]
      },
      {
        "name": "延安市",
        "level": "2",
        "id": 605344,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 605369
          },
          {
            "name": "宝塔区",
            "level": "3",
            "id": 605370
          },
          {
            "name": "安塞区",
            "level": "3",
            "id": 606292
          },
          {
            "name": "延长县",
            "level": "3",
            "id": 606779
          },
          {
            "name": "延川县",
            "level": "3",
            "id": 607477
          },
          {
            "name": "子长县",
            "level": "3",
            "id": 608033
          },
          {
            "name": "志丹县",
            "level": "3",
            "id": 608954
          },
          {
            "name": "吴起县",
            "level": "3",
            "id": 609077
          },
          {
            "name": "甘泉县",
            "level": "3",
            "id": 609181
          },
          {
            "name": "富县",
            "level": "3",
            "id": 609259
          },
          {
            "name": "洛川县",
            "level": "3",
            "id": 609484
          },
          {
            "name": "宜川县",
            "level": "3",
            "id": 609976
          },
          {
            "name": "黄龙县",
            "level": "3",
            "id": 610191
          },
          {
            "name": "黄陵县",
            "level": "3",
            "id": 610249
          }
        ]
      },
      {
        "name": "汉中市",
        "level": "2",
        "id": 610551,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 610569
          },
          {
            "name": "汉台区",
            "level": "3",
            "id": 610571
          },
          {
            "name": "南郑县",
            "level": "3",
            "id": 611024
          },
          {
            "name": "城固县",
            "level": "3",
            "id": 615234
          },
          {
            "name": "洋县",
            "level": "3",
            "id": 619787
          },
          {
            "name": "西乡县",
            "level": "3",
            "id": 620451
          },
          {
            "name": "勉县",
            "level": "3",
            "id": 620797
          },
          {
            "name": "宁强县",
            "level": "3",
            "id": 624205
          },
          {
            "name": "略阳县",
            "level": "3",
            "id": 624757
          },
          {
            "name": "镇巴县",
            "level": "3",
            "id": 626733
          },
          {
            "name": "留坝县",
            "level": "3",
            "id": 627285
          },
          {
            "name": "佛坪县",
            "level": "3",
            "id": 627655
          }
        ]
      },
      {
        "name": "榆林市",
        "level": "2",
        "id": 631902,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 631923
          },
          {
            "name": "榆阳区",
            "level": "3",
            "id": 631924
          },
          {
            "name": "横山区",
            "level": "3",
            "id": 632900
          },
          {
            "name": "神木县",
            "level": "3",
            "id": 633705
          },
          {
            "name": "府谷县",
            "level": "3",
            "id": 634074
          },
          {
            "name": "靖边县",
            "level": "3",
            "id": 634331
          },
          {
            "name": "定边县",
            "level": "3",
            "id": 634638
          },
          {
            "name": "绥德县",
            "level": "3",
            "id": 639464
          },
          {
            "name": "米脂县",
            "level": "3",
            "id": 645604
          },
          {
            "name": "佳县",
            "level": "3",
            "id": 645956
          },
          {
            "name": "吴堡县",
            "level": "3",
            "id": 649793
          },
          {
            "name": "清涧县",
            "level": "3",
            "id": 650045
          },
          {
            "name": "子洲县",
            "level": "3",
            "id": 650751
          }
        ]
      },
      {
        "name": "安康市",
        "level": "2",
        "id": 651673,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 654399
          },
          {
            "name": "汉滨区",
            "level": "3",
            "id": 654400
          },
          {
            "name": "汉阴县",
            "level": "3",
            "id": 656455
          },
          {
            "name": "石泉县",
            "level": "3",
            "id": 656774
          },
          {
            "name": "宁陕县",
            "level": "3",
            "id": 657161
          },
          {
            "name": "紫阳县",
            "level": "3",
            "id": 659574
          },
          {
            "name": "岚皋县",
            "level": "3",
            "id": 660354
          },
          {
            "name": "平利县",
            "level": "3",
            "id": 660721
          },
          {
            "name": "镇坪县",
            "level": "3",
            "id": 661118
          },
          {
            "name": "旬阳县",
            "level": "3",
            "id": 661329
          },
          {
            "name": "白河县",
            "level": "3",
            "id": 661682
          }
        ]
      },
      {
        "name": "商洛市",
        "level": "2",
        "id": 661815,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 661816
          },
          {
            "name": "商州区",
            "level": "3",
            "id": 661817
          },
          {
            "name": "洛南县",
            "level": "3",
            "id": 664585
          },
          {
            "name": "丹凤县",
            "level": "3",
            "id": 665096
          },
          {
            "name": "商南县",
            "level": "3",
            "id": 667956
          },
          {
            "name": "山阳县",
            "level": "3",
            "id": 668176
          },
          {
            "name": "镇安县",
            "level": "3",
            "id": 672554
          },
          {
            "name": "柞水县",
            "level": "3",
            "id": 672898
          }
        ]
      }
    ]
  },
  {
    "name": "甘肃省",
    "level": "1",
    "id": 60,
    "childs": [{
        "name": "兰州市",
        "level": "2",
        "id": 556474,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 556493
          },
          {
            "name": "城关区",
            "level": "3",
            "id": 556495
          },
          {
            "name": "七里河区",
            "level": "3",
            "id": 557121
          },
          {
            "name": "西固区",
            "level": "3",
            "id": 557390
          },
          {
            "name": "安宁区",
            "level": "3",
            "id": 557547
          },
          {
            "name": "红古区",
            "level": "3",
            "id": 557725
          },
          {
            "name": "永登县",
            "level": "3",
            "id": 558125
          },
          {
            "name": "皋兰县",
            "level": "3",
            "id": 558822
          },
          {
            "name": "榆中县",
            "level": "3",
            "id": 558952
          }
        ]
      },
      {
        "name": "嘉峪关市",
        "level": "2",
        "id": 559315,
        "childs": [{
          "name": "市辖区",
          "level": "3",
          "id": 559320
        }]
      },
      {
        "name": "金昌市",
        "level": "2",
        "id": 559420,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 559421
          },
          {
            "name": "金川区",
            "level": "3",
            "id": 559424
          },
          {
            "name": "永昌县",
            "level": "3",
            "id": 559504
          }
        ]
      },
      {
        "name": "白银市",
        "level": "2",
        "id": 563919,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 563931
          },
          {
            "name": "白银区",
            "level": "3",
            "id": 563932
          },
          {
            "name": "平川区",
            "level": "3",
            "id": 564125
          },
          {
            "name": "靖远县",
            "level": "3",
            "id": 564315
          },
          {
            "name": "会宁县",
            "level": "3",
            "id": 564730
          },
          {
            "name": "景泰县",
            "level": "3",
            "id": 570838
          }
        ]
      },
      {
        "name": "天水市",
        "level": "2",
        "id": 571369,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 571383
          },
          {
            "name": "秦州区",
            "level": "3",
            "id": 571384
          },
          {
            "name": "麦积区",
            "level": "3",
            "id": 582232
          },
          {
            "name": "清水县",
            "level": "3",
            "id": 583462
          },
          {
            "name": "秦安县",
            "level": "3",
            "id": 587741
          },
          {
            "name": "甘谷县",
            "level": "3",
            "id": 588459
          },
          {
            "name": "武山县",
            "level": "3",
            "id": 589492
          },
          {
            "name": "张家川回族自治县",
            "level": "3",
            "id": 595704
          }
        ]
      },
      {
        "name": "武威市",
        "level": "2",
        "id": 596322,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 596353
          },
          {
            "name": "凉州区",
            "level": "3",
            "id": 596354
          },
          {
            "name": "民勤县",
            "level": "3",
            "id": 608562
          },
          {
            "name": "古浪县",
            "level": "3",
            "id": 608866
          },
          {
            "name": "天祝藏族自治县",
            "level": "3",
            "id": 613290
          }
        ]
      },
      {
        "name": "张掖市",
        "level": "2",
        "id": 616090,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 616096
          },
          {
            "name": "甘州区",
            "level": "3",
            "id": 616097
          },
          {
            "name": "肃南裕固族自治县",
            "level": "3",
            "id": 625034
          },
          {
            "name": "民乐县",
            "level": "3",
            "id": 630700
          },
          {
            "name": "临泽县",
            "level": "3",
            "id": 631215
          },
          {
            "name": "高台县",
            "level": "3",
            "id": 631340
          },
          {
            "name": "山丹县",
            "level": "3",
            "id": 635179
          }
        ]
      },
      {
        "name": "平凉市",
        "level": "2",
        "id": 639979,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 640015
          },
          {
            "name": "崆峒区",
            "level": "3",
            "id": 640016
          },
          {
            "name": "泾川县",
            "level": "3",
            "id": 641116
          },
          {
            "name": "灵台县",
            "level": "3",
            "id": 642033
          },
          {
            "name": "崇信县",
            "level": "3",
            "id": 642697
          },
          {
            "name": "华亭县",
            "level": "3",
            "id": 643030
          },
          {
            "name": "庄浪县",
            "level": "3",
            "id": 643372
          },
          {
            "name": "静宁县",
            "level": "3",
            "id": 644623
          }
        ]
      },
      {
        "name": "酒泉市",
        "level": "2",
        "id": 645214,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 645223
          },
          {
            "name": "肃州区",
            "level": "3",
            "id": 645224
          },
          {
            "name": "金塔县",
            "level": "3",
            "id": 646202
          },
          {
            "name": "瓜州县",
            "level": "3",
            "id": 647185
          },
          {
            "name": "肃北蒙古族自治县",
            "level": "3",
            "id": 654398
          },
          {
            "name": "阿克塞哈萨克族自治县",
            "level": "3",
            "id": 656144
          },
          {
            "name": "玉门市",
            "level": "3",
            "id": 658372
          },
          {
            "name": "敦煌市",
            "level": "3",
            "id": 661703
          }
        ]
      },
      {
        "name": "庆阳市",
        "level": "2",
        "id": 661925,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 661926
          },
          {
            "name": "西峰区",
            "level": "3",
            "id": 661927
          },
          {
            "name": "庆城县",
            "level": "3",
            "id": 662053
          },
          {
            "name": "环县",
            "level": "3",
            "id": 662242
          },
          {
            "name": "华池县",
            "level": "3",
            "id": 662721
          },
          {
            "name": "合水县",
            "level": "3",
            "id": 663214
          },
          {
            "name": "正宁县",
            "level": "3",
            "id": 663493
          },
          {
            "name": "宁县",
            "level": "3",
            "id": 663664
          },
          {
            "name": "镇原县",
            "level": "3",
            "id": 663961
          }
        ]
      },
      {
        "name": "定西市",
        "level": "2",
        "id": 664476,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 664479
          },
          {
            "name": "安定区",
            "level": "3",
            "id": 664480
          },
          {
            "name": "通渭县",
            "level": "3",
            "id": 665106
          },
          {
            "name": "陇西县",
            "level": "3",
            "id": 665508
          },
          {
            "name": "渭源县",
            "level": "3",
            "id": 665752
          },
          {
            "name": "临洮县",
            "level": "3",
            "id": 666012
          },
          {
            "name": "漳县",
            "level": "3",
            "id": 668544
          },
          {
            "name": "岷县",
            "level": "3",
            "id": 668853
          }
        ]
      },
      {
        "name": "陇南市",
        "level": "2",
        "id": 669544,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 669581
          },
          {
            "name": "武都区",
            "level": "3",
            "id": 669582
          },
          {
            "name": "成县",
            "level": "3",
            "id": 670850
          },
          {
            "name": "文县",
            "level": "3",
            "id": 671324
          },
          {
            "name": "宕昌县",
            "level": "3",
            "id": 673908
          },
          {
            "name": "康县",
            "level": "3",
            "id": 675359
          },
          {
            "name": "西和县",
            "level": "3",
            "id": 675739
          },
          {
            "name": "礼县",
            "level": "3",
            "id": 676715
          },
          {
            "name": "徽县",
            "level": "3",
            "id": 677324
          },
          {
            "name": "两当县",
            "level": "3",
            "id": 677643
          }
        ]
      },
      {
        "name": "临夏回族自治州",
        "level": "2",
        "id": 677988,
        "childs": [{
            "name": "临夏市",
            "level": "3",
            "id": 678021
          },
          {
            "name": "临夏县",
            "level": "3",
            "id": 678359
          },
          {
            "name": "康乐县",
            "level": "3",
            "id": 678851
          },
          {
            "name": "永靖县",
            "level": "3",
            "id": 679140
          },
          {
            "name": "广河县",
            "level": "3",
            "id": 679327
          },
          {
            "name": "和政县",
            "level": "3",
            "id": 679440
          },
          {
            "name": "东乡族自治县",
            "level": "3",
            "id": 679580
          },
          {
            "name": "积石山保安族东乡族撒拉族自治县",
            "level": "3",
            "id": 679835
          }
        ]
      },
      {
        "name": "甘南藏族自治州",
        "level": "2",
        "id": 680004,
        "childs": [{
            "name": "合作市",
            "level": "3",
            "id": 680005
          },
          {
            "name": "临潭县",
            "level": "3",
            "id": 680066
          },
          {
            "name": "卓尼县",
            "level": "3",
            "id": 680227
          },
          {
            "name": "舟曲县",
            "level": "3",
            "id": 680349
          },
          {
            "name": "迭部县",
            "level": "3",
            "id": 680725
          },
          {
            "name": "玛曲县",
            "level": "3",
            "id": 680885
          },
          {
            "name": "碌曲县",
            "level": "3",
            "id": 681168
          },
          {
            "name": "夏河县",
            "level": "3",
            "id": 681373
          }
        ]
      }
    ]
  },
  {
    "name": "青海省",
    "level": "1",
    "id": 81,
    "childs": [{
        "name": "西宁市",
        "level": "2",
        "id": 565921,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 571644
          },
          {
            "name": "城东区",
            "level": "3",
            "id": 571645
          },
          {
            "name": "城中区",
            "level": "3",
            "id": 571857
          },
          {
            "name": "城西区",
            "level": "3",
            "id": 572050
          },
          {
            "name": "城北区",
            "level": "3",
            "id": 572111
          },
          {
            "name": "大通回族土族自治县",
            "level": "3",
            "id": 572185
          },
          {
            "name": "湟中县",
            "level": "3",
            "id": 572517
          },
          {
            "name": "湟源县",
            "level": "3",
            "id": 573164
          }
        ]
      },
      {
        "name": "海东市",
        "level": "2",
        "id": 573463,
        "childs": [{
            "name": "乐都区",
            "level": "3",
            "id": 573480
          },
          {
            "name": "平安区",
            "level": "3",
            "id": 580369
          },
          {
            "name": "民和回族土族自治县",
            "level": "3",
            "id": 590389
          },
          {
            "name": "互助土族自治县",
            "level": "3",
            "id": 596561
          },
          {
            "name": "化隆回族自治县",
            "level": "3",
            "id": 601178
          },
          {
            "name": "循化撒拉族自治县",
            "level": "3",
            "id": 602008
          }
        ]
      },
      {
        "name": "海北藏族自治州",
        "level": "2",
        "id": 602500,
        "childs": [{
            "name": "门源回族自治县",
            "level": "3",
            "id": 602522
          },
          {
            "name": "祁连县",
            "level": "3",
            "id": 603025
          },
          {
            "name": "海晏县",
            "level": "3",
            "id": 603407
          },
          {
            "name": "刚察县",
            "level": "3",
            "id": 603733
          }
        ]
      },
      {
        "name": "黄南藏族自治州",
        "level": "2",
        "id": 604011,
        "childs": [{
            "name": "同仁县",
            "level": "3",
            "id": 604032
          },
          {
            "name": "尖扎县",
            "level": "3",
            "id": 604439
          },
          {
            "name": "泽库县",
            "level": "3",
            "id": 604779
          },
          {
            "name": "河南蒙古族自治县",
            "level": "3",
            "id": 609698
          }
        ]
      },
      {
        "name": "海南藏族自治州",
        "level": "2",
        "id": 614450,
        "childs": [{
            "name": "共和县",
            "level": "3",
            "id": 614469
          },
          {
            "name": "同德县",
            "level": "3",
            "id": 614639
          },
          {
            "name": "贵德县",
            "level": "3",
            "id": 614737
          },
          {
            "name": "兴海县",
            "level": "3",
            "id": 614877
          },
          {
            "name": "贵南县",
            "level": "3",
            "id": 625465
          }
        ]
      },
      {
        "name": "果洛藏族自治州",
        "level": "2",
        "id": 627949,
        "childs": [{
            "name": "玛沁县",
            "level": "3",
            "id": 627967
          },
          {
            "name": "班玛县",
            "level": "3",
            "id": 631533
          },
          {
            "name": "甘德县",
            "level": "3",
            "id": 631576
          },
          {
            "name": "达日县",
            "level": "3",
            "id": 631622
          },
          {
            "name": "久治县",
            "level": "3",
            "id": 631727
          },
          {
            "name": "玛多县",
            "level": "3",
            "id": 631835
          }
        ]
      },
      {
        "name": "玉树藏族自治州",
        "level": "2",
        "id": 635485,
        "childs": [{
            "name": "玉树市",
            "level": "3",
            "id": 635486
          },
          {
            "name": "杂多县",
            "level": "3",
            "id": 635579
          },
          {
            "name": "称多县",
            "level": "3",
            "id": 638282
          },
          {
            "name": "治多县",
            "level": "3",
            "id": 638355
          },
          {
            "name": "囊谦县",
            "level": "3",
            "id": 638467
          },
          {
            "name": "曲麻莱县",
            "level": "3",
            "id": 638631
          }
        ]
      },
      {
        "name": "海西蒙古族藏族自治州",
        "level": "2",
        "id": 638714,
        "childs": [{
            "name": "格尔木市",
            "level": "3",
            "id": 638725
          },
          {
            "name": "德令哈市",
            "level": "3",
            "id": 638913
          },
          {
            "name": "乌兰县",
            "level": "3",
            "id": 639067
          },
          {
            "name": "都兰县",
            "level": "3",
            "id": 640281
          },
          {
            "name": "天峻县",
            "level": "3",
            "id": 642721
          }
        ]
      }
    ]
  },
  {
    "name": "宁夏回族自治区",
    "level": "1",
    "id": 113,
    "childs": [{
        "name": "银川市",
        "level": "2",
        "id": 582349,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 582367
          },
          {
            "name": "兴庆区",
            "level": "3",
            "id": 582371
          },
          {
            "name": "西夏区",
            "level": "3",
            "id": 584574
          },
          {
            "name": "金凤区",
            "level": "3",
            "id": 584731
          },
          {
            "name": "永宁县",
            "level": "3",
            "id": 584987
          },
          {
            "name": "贺兰县",
            "level": "3",
            "id": 590060
          },
          {
            "name": "灵武市",
            "level": "3",
            "id": 590507
          }
        ]
      },
      {
        "name": "石嘴山市",
        "level": "2",
        "id": 596377,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 596393
          },
          {
            "name": "大武口区",
            "level": "3",
            "id": 596395
          },
          {
            "name": "惠农区",
            "level": "3",
            "id": 596589
          },
          {
            "name": "平罗县",
            "level": "3",
            "id": 598987
          }
        ]
      },
      {
        "name": "吴忠市",
        "level": "2",
        "id": 599369,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 599390
          },
          {
            "name": "利通区",
            "level": "3",
            "id": 599392
          },
          {
            "name": "红寺堡区",
            "level": "3",
            "id": 602226
          },
          {
            "name": "盐池县",
            "level": "3",
            "id": 602525
          },
          {
            "name": "同心县",
            "level": "3",
            "id": 602852
          },
          {
            "name": "青铜峡市",
            "level": "3",
            "id": 603460
          }
        ]
      },
      {
        "name": "固原市",
        "level": "2",
        "id": 603994,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 604012
          },
          {
            "name": "原州区",
            "level": "3",
            "id": 604013
          },
          {
            "name": "西吉县",
            "level": "3",
            "id": 604580
          },
          {
            "name": "隆德县",
            "level": "3",
            "id": 614529
          },
          {
            "name": "泾源县",
            "level": "3",
            "id": 617411
          },
          {
            "name": "彭阳县",
            "level": "3",
            "id": 617827
          }
        ]
      },
      {
        "name": "中卫市",
        "level": "2",
        "id": 618395,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 618407
          },
          {
            "name": "沙坡头区",
            "level": "3",
            "id": 618410
          },
          {
            "name": "中宁县",
            "level": "3",
            "id": 618833
          },
          {
            "name": "海原县",
            "level": "3",
            "id": 619263
          }
        ]
      }
    ]
  },
  {
    "name": "新疆维吾尔自治区",
    "level": "1",
    "id": 198,
    "childs": [{
        "name": "乌鲁木齐市",
        "level": "2",
        "id": 591885,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 591894
          },
          {
            "name": "天山区",
            "level": "3",
            "id": 591895
          },
          {
            "name": "沙依巴克区",
            "level": "3",
            "id": 592297
          },
          {
            "name": "新市区",
            "level": "3",
            "id": 593085
          },
          {
            "name": "水磨沟区",
            "level": "3",
            "id": 593933
          },
          {
            "name": "头屯河区",
            "level": "3",
            "id": 597251
          },
          {
            "name": "达坂城区",
            "level": "3",
            "id": 597546
          },
          {
            "name": "米东区",
            "level": "3",
            "id": 597751
          },
          {
            "name": "乌鲁木齐县",
            "level": "3",
            "id": 600447
          }
        ]
      },
      {
        "name": "克拉玛依市",
        "level": "2",
        "id": 600524,
        "childs": [{
            "name": "市辖区",
            "level": "3",
            "id": 600525
          },
          {
            "name": "独山子区",
            "level": "3",
            "id": 600526
          },
          {
            "name": "克拉玛依区",
            "level": "3",
            "id": 600547
          },
          {
            "name": "白碱滩区",
            "level": "3",
            "id": 600806
          },
          {
            "name": "乌尔禾区",
            "level": "3",
            "id": 606748
          }
        ]
      },
      {
        "name": "吐鲁番市",
        "level": "2",
        "id": 606884,
        "childs": [{
            "name": "高昌区",
            "level": "3",
            "id": 606901
          },
          {
            "name": "鄯善县",
            "level": "3",
            "id": 611255
          },
          {
            "name": "托克逊县",
            "level": "3",
            "id": 611542
          }
        ]
      },
      {
        "name": "哈密市",
        "level": "2",
        "id": 615452,
        "childs": [{
            "name": "伊州区",
            "level": "3",
            "id": 615473
          },
          {
            "name": "巴里坤哈萨克自治县",
            "level": "3",
            "id": 615800
          },
          {
            "name": "伊吾县",
            "level": "3",
            "id": 615888
          }
        ]
      },
      {
        "name": "昌吉回族自治州",
        "level": "2",
        "id": 615939,
        "childs": [{
            "name": "昌吉市",
            "level": "3",
            "id": 615943
          },
          {
            "name": "阜康市",
            "level": "3",
            "id": 621028
          },
          {
            "name": "呼图壁县",
            "level": "3",
            "id": 621177
          },
          {
            "name": "玛纳斯县",
            "level": "3",
            "id": 621328
          },
          {
            "name": "奇台县",
            "level": "3",
            "id": 627500
          },
          {
            "name": "吉木萨尔县",
            "level": "3",
            "id": 628168
          },
          {
            "name": "木垒哈萨克自治县",
            "level": "3",
            "id": 628514
          }
        ]
      },
      {
        "name": "博尔塔拉蒙古自治州",
        "level": "2",
        "id": 628863,
        "childs": [{
            "name": "博乐市",
            "level": "3",
            "id": 628877
          },
          {
            "name": "阿拉山口市",
            "level": "3",
            "id": 631992
          },
          {
            "name": "精河县",
            "level": "3",
            "id": 632044
          },
          {
            "name": "温泉县",
            "level": "3",
            "id": 632468
          }
        ]
      },
      {
        "name": "巴音郭楞蒙古自治州",
        "level": "2",
        "id": 632822,
        "childs": [{
            "name": "库尔勒市",
            "level": "3",
            "id": 632825
          },
          {
            "name": "轮台县",
            "level": "3",
            "id": 638432
          },
          {
            "name": "尉犁县",
            "level": "3",
            "id": 638611
          },
          {
            "name": "若羌县",
            "level": "3",
            "id": 638801
          },
          {
            "name": "且末县",
            "level": "3",
            "id": 638927
          },
          {
            "name": "焉耆回族自治县",
            "level": "3",
            "id": 639266
          },
          {
            "name": "和静县",
            "level": "3",
            "id": 643520
          },
          {
            "name": "和硕县",
            "level": "3",
            "id": 648655
          },
          {
            "name": "博湖县",
            "level": "3",
            "id": 648807
          }
        ]
      },
      {
        "name": "阿克苏地区",
        "level": "2",
        "id": 648951,
        "childs": [{
            "name": "阿克苏市",
            "level": "3",
            "id": 648964
          },
          {
            "name": "温宿县",
            "level": "3",
            "id": 649245
          },
          {
            "name": "库车县",
            "level": "3",
            "id": 649755
          },
          {
            "name": "沙雅县",
            "level": "3",
            "id": 650688
          },
          {
            "name": "新和县",
            "level": "3",
            "id": 651427
          },
          {
            "name": "拜城县",
            "level": "3",
            "id": 651731
          },
          {
            "name": "乌什县",
            "level": "3",
            "id": 651935
          },
          {
            "name": "阿瓦提县",
            "level": "3",
            "id": 652107
          },
          {
            "name": "柯坪县",
            "level": "3",
            "id": 654462
          }
        ]
      },
      {
        "name": "克孜勒苏柯尔克孜自治州",
        "level": "2",
        "id": 654702,
        "childs": [{
            "name": "阿图什市",
            "level": "3",
            "id": 654726
          },
          {
            "name": "阿克陶县",
            "level": "3",
            "id": 655239
          },
          {
            "name": "阿合奇县",
            "level": "3",
            "id": 656473
          },
          {
            "name": "乌恰县",
            "level": "3",
            "id": 658941
          }
        ]
      },
      {
        "name": "喀什地区",
        "level": "2",
        "id": 659030,
        "childs": [{
            "name": "喀什市",
            "level": "3",
            "id": 659047
          },
          {
            "name": "疏附县",
            "level": "3",
            "id": 659772
          },
          {
            "name": "疏勒县",
            "level": "3",
            "id": 666002
          },
          {
            "name": "英吉沙县",
            "level": "3",
            "id": 668465
          },
          {
            "name": "泽普县",
            "level": "3",
            "id": 668846
          },
          {
            "name": "莎车县",
            "level": "3",
            "id": 669324
          },
          {
            "name": "叶城县",
            "level": "3",
            "id": 671758
          },
          {
            "name": "麦盖提县",
            "level": "3",
            "id": 672828
          },
          {
            "name": "岳普湖县",
            "level": "3",
            "id": 673142
          },
          {
            "name": "伽师县",
            "level": "3",
            "id": 673264
          },
          {
            "name": "巴楚县",
            "level": "3",
            "id": 674455
          },
          {
            "name": "塔什库尔干塔吉克自治县",
            "level": "3",
            "id": 674704
          }
        ]
      },
      {
        "name": "和田地区",
        "level": "2",
        "id": 674766,
        "childs": [{
            "name": "和田市",
            "level": "3",
            "id": 674767
          },
          {
            "name": "和田县",
            "level": "3",
            "id": 676226
          },
          {
            "name": "墨玉县",
            "level": "3",
            "id": 677855
          },
          {
            "name": "皮山县",
            "level": "3",
            "id": 678523
          },
          {
            "name": "洛浦县",
            "level": "3",
            "id": 680882
          },
          {
            "name": "策勒县",
            "level": "3",
            "id": 681233
          },
          {
            "name": "于田县",
            "level": "3",
            "id": 681869
          },
          {
            "name": "民丰县",
            "level": "3",
            "id": 682077
          }
        ]
      },
      {
        "name": "伊犁哈萨克自治州",
        "level": "2",
        "id": 682123,
        "childs": [{
            "name": "伊宁市",
            "level": "3",
            "id": 682124
          },
          {
            "name": "奎屯市",
            "level": "3",
            "id": 682421
          },
          {
            "name": "霍尔果斯市",
            "level": "3",
            "id": 682565
          },
          {
            "name": "伊宁县",
            "level": "3",
            "id": 682660
          },
          {
            "name": "察布查尔锡伯自治县",
            "level": "3",
            "id": 684347
          },
          {
            "name": "霍城县",
            "level": "3",
            "id": 684794
          },
          {
            "name": "巩留县",
            "level": "3",
            "id": 685301
          },
          {
            "name": "新源县",
            "level": "3",
            "id": 685989
          },
          {
            "name": "昭苏县",
            "level": "3",
            "id": 686127
          },
          {
            "name": "特克斯县",
            "level": "3",
            "id": 686272
          },
          {
            "name": "尼勒克县",
            "level": "3",
            "id": 686364
          }
        ]
      },
      {
        "name": "塔城地区",
        "level": "2",
        "id": 686477,
        "childs": [{
            "name": "塔城市",
            "level": "3",
            "id": 686478
          },
          {
            "name": "乌苏市",
            "level": "3",
            "id": 686695
          },
          {
            "name": "额敏县",
            "level": "3",
            "id": 687332
          },
          {
            "name": "沙湾县",
            "level": "3",
            "id": 687615
          },
          {
            "name": "托里县",
            "level": "3",
            "id": 688368
          },
          {
            "name": "裕民县",
            "level": "3",
            "id": 688467
          },
          {
            "name": "和布克赛尔蒙古自治县",
            "level": "3",
            "id": 688544
          }
        ]
      },
      {
        "name": "阿勒泰地区",
        "level": "2",
        "id": 692467,
        "childs": [{
            "name": "阿勒泰市",
            "level": "3",
            "id": 692603
          },
          {
            "name": "布尔津县",
            "level": "3",
            "id": 692862
          },
          {
            "name": "富蕴县",
            "level": "3",
            "id": 693043
          },
          {
            "name": "福海县",
            "level": "3",
            "id": 693143
          },
          {
            "name": "哈巴河县",
            "level": "3",
            "id": 693649
          },
          {
            "name": "青河县",
            "level": "3",
            "id": 693939
          },
          {
            "name": "吉木乃县",
            "level": "3",
            "id": 694853
          }
        ]
      },
      {
        "name": "自治区直辖县级行政区划",
        "level": "2",
        "id": 694915,
        "childs": [{
            "name": "石河子市",
            "level": "3",
            "id": 694916
          },
          {
            "name": "阿拉尔市",
            "level": "3",
            "id": 696229
          },
          {
            "name": "图木舒克市",
            "level": "3",
            "id": 696769
          },
          {
            "name": "五家渠市",
            "level": "3",
            "id": 697036
          },
          {
            "name": "铁门关市",
            "level": "3",
            "id": 697159
          }
        ]
      }
    ]
  }
];
export {area}